Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x8fa (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 23 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x7022f): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xafcfa): ../Core/Src/SDCard_Configuration.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x353b9): C:/Users/Bazar/Desktop/My-STM32_Discoveries/STM32F746_Discovery/STM32F746Discovery_VCP_SDcard_DMA_FreeRTOS/VCP_SDcard_DMA_FreeRTOS/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 24 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 4 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x5384b): UINT
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 19
    <38>   DW_AT_decl_column : 22
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 7 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 4

    <52>   DW_AT_encoding    : 8	(unsigned char)
    <53>   DW_AT_name        : (indirect string, offset: 0xece1a): unsigned char
 <1><57>: Abbrev Number: 7 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 5	(signed)
    <5a>   DW_AT_name        : (indirect string, offset: 0xb79bc): short int
 <1><5e>: Abbrev Number: 4 (DW_TAG_typedef)
    <5f>   DW_AT_name        : (indirect string, offset: 0x2018c): WORD
    <63>   DW_AT_decl_file   : 2
    <64>   DW_AT_decl_line   : 26
    <65>   DW_AT_decl_column : 24
    <66>   DW_AT_type        : <0x6a>
 <1><6a>: Abbrev Number: 7 (DW_TAG_base_type)
    <6b>   DW_AT_byte_size   : 2
    <6c>   DW_AT_encoding    : 7	(unsigned)
    <6d>   DW_AT_name        : (indirect string, offset: 0xeb460): short unsigned int
 <1><71>: Abbrev Number: 7 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 5	(signed)
    <74>   DW_AT_name        : (indirect string, offset: 0x14de2): long int
 <1><78>: Abbrev Number: 4 (DW_TAG_typedef)
    <79>   DW_AT_name        : (indirect string, offset: 0x2018b): DWORD
    <7d>   DW_AT_decl_file   : 2
    <7e>   DW_AT_decl_line   : 31
    <7f>   DW_AT_decl_column : 23
    <80>   DW_AT_type        : <0x84>
 <1><84>: Abbrev Number: 7 (DW_TAG_base_type)
    <85>   DW_AT_byte_size   : 4
    <86>   DW_AT_encoding    : 7	(unsigned)
    <87>   DW_AT_name        : (indirect string, offset: 0x5dbc4): long unsigned int
 <1><8b>: Abbrev Number: 7 (DW_TAG_base_type)
    <8c>   DW_AT_byte_size   : 8
    <8d>   DW_AT_encoding    : 7	(unsigned)
    <8e>   DW_AT_name        : (indirect string, offset: 0x3373f): long long unsigned int
 <1><92>: Abbrev Number: 7 (DW_TAG_base_type)
    <93>   DW_AT_byte_size   : 1
    <94>   DW_AT_encoding    : 6	(signed char)
    <95>   DW_AT_name        : (indirect string, offset: 0x7ac23): signed char
 <1><99>: Abbrev Number: 4 (DW_TAG_typedef)
    <9a>   DW_AT_name        : (indirect string, offset: 0x9ccdb): __uint32_t
    <9e>   DW_AT_decl_file   : 3
    <9f>   DW_AT_decl_line   : 79
    <a0>   DW_AT_decl_column : 25
    <a1>   DW_AT_type        : <0x84>
 <1><a5>: Abbrev Number: 7 (DW_TAG_base_type)
    <a6>   DW_AT_byte_size   : 8
    <a7>   DW_AT_encoding    : 5	(signed)
    <a8>   DW_AT_name        : (indirect string, offset: 0x6fc4c): long long int
 <1><ac>: Abbrev Number: 4 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0xeb0bb): uint32_t
    <b1>   DW_AT_decl_file   : 4
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x99>
 <1><b8>: Abbrev Number: 4 (DW_TAG_typedef)
    <b9>   DW_AT_name        : (indirect string, offset: 0xa84e): size_t
    <bd>   DW_AT_decl_file   : 5
    <be>   DW_AT_decl_line   : 214
    <bf>   DW_AT_decl_column : 23
    <c0>   DW_AT_type        : <0x3d>
 <1><c4>: Abbrev Number: 7 (DW_TAG_base_type)
    <c5>   DW_AT_byte_size   : 8
    <c6>   DW_AT_encoding    : 4	(float)
    <c7>   DW_AT_name        : (indirect string, offset: 0x16b6a): long double
 <1><cb>: Abbrev Number: 25 (DW_TAG_pointer_type)
    <cc>   DW_AT_byte_size   : 4
 <1><cd>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ce>   DW_AT_byte_size   : 4
    <ce>   DW_AT_type        : <0xd2>
 <1><d2>: Abbrev Number: 7 (DW_TAG_base_type)
    <d3>   DW_AT_byte_size   : 1
    <d4>   DW_AT_encoding    : 8	(unsigned char)
    <d5>   DW_AT_name        : (indirect string, offset: 0xcdef9): char
 <1><d9>: Abbrev Number: 15 (DW_TAG_const_type)
    <da>   DW_AT_type        : <0xd2>
 <1><de>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <df>   DW_AT_byte_size   : 4
    <df>   DW_AT_type        : <0xd9>
 <1><e3>: Abbrev Number: 4 (DW_TAG_typedef)
    <e4>   DW_AT_name        : (indirect string, offset: 0x57b23): QueueHandle_t
    <e8>   DW_AT_decl_file   : 6
    <e9>   DW_AT_decl_line   : 48
    <ea>   DW_AT_decl_column : 34
    <eb>   DW_AT_type        : <0xef>
 <1><ef>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f0>   DW_AT_byte_size   : 4
    <f0>   DW_AT_type        : <0xf4>
 <1><f4>: Abbrev Number: 26 (DW_TAG_structure_type)
    <f5>   DW_AT_name        : (indirect string, offset: 0xa43bd): QueueDefinition
    <f9>   DW_AT_declaration : 1
 <1><f9>: Abbrev Number: 4 (DW_TAG_typedef)
    <fa>   DW_AT_name        : (indirect string, offset: 0x159a4): SemaphoreHandle_t
    <fe>   DW_AT_decl_file   : 7
    <ff>   DW_AT_decl_line   : 37
    <100>   DW_AT_decl_column : 23
    <101>   DW_AT_type        : <0xe3>
 <1><105>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <106>   DW_AT_byte_size   : 4
    <106>   DW_AT_type        : <0x10a>
 <1><10a>: Abbrev Number: 27 (DW_TAG_const_type)
 <1><10b>: Abbrev Number: 4 (DW_TAG_typedef)
    <10c>   DW_AT_name        : (indirect string, offset: 0x52098): osSemaphoreId
    <110>   DW_AT_decl_file   : 8
    <111>   DW_AT_decl_line   : 250
    <112>   DW_AT_decl_column : 27
    <113>   DW_AT_type        : <0xf9>
 <1><117>: Abbrev Number: 4 (DW_TAG_typedef)
    <118>   DW_AT_name        : (indirect string, offset: 0x8f6aa): TCHAR
    <11c>   DW_AT_decl_file   : 9
    <11d>   DW_AT_decl_line   : 62
    <11e>   DW_AT_decl_column : 14
    <11f>   DW_AT_type        : <0xd2>
 <1><123>: Abbrev Number: 15 (DW_TAG_const_type)
    <124>   DW_AT_type        : <0x117>
 <1><128>: Abbrev Number: 4 (DW_TAG_typedef)
    <129>   DW_AT_name        : (indirect string, offset: 0xc6c3f): FSIZE_t
    <12d>   DW_AT_decl_file   : 9
    <12e>   DW_AT_decl_line   : 78
    <12f>   DW_AT_decl_column : 15
    <130>   DW_AT_type        : <0x78>
 <1><134>: Abbrev Number: 16 (DW_TAG_structure_type)
    <135>   DW_AT_byte_size   : 4152
    <137>   DW_AT_decl_file   : 9
    <137>   DW_AT_decl_line   : 85
    <138>   DW_AT_decl_column : 9
    <138>   DW_AT_sibling     : <0x22c>
 <2><13c>: Abbrev Number: 1 (DW_TAG_member)
    <13d>   DW_AT_name        : (indirect string, offset: 0x33aab): fs_type
    <141>   DW_AT_decl_file   : 9
    <141>   DW_AT_decl_line   : 86
    <142>   DW_AT_decl_column : 7
    <143>   DW_AT_type        : <0x44>
    <147>   DW_AT_data_member_location: 0
 <2><148>: Abbrev Number: 8 (DW_TAG_member)
    <149>   DW_AT_name        : drv
    <14d>   DW_AT_decl_file   : 9
    <14d>   DW_AT_decl_line   : 87
    <14e>   DW_AT_decl_column : 7
    <14f>   DW_AT_type        : <0x44>
    <153>   DW_AT_data_member_location: 1
 <2><154>: Abbrev Number: 1 (DW_TAG_member)
    <155>   DW_AT_name        : (indirect string, offset: 0xbad56): n_fats
    <159>   DW_AT_decl_file   : 9
    <159>   DW_AT_decl_line   : 88
    <15a>   DW_AT_decl_column : 7
    <15b>   DW_AT_type        : <0x44>
    <15f>   DW_AT_data_member_location: 2
 <2><160>: Abbrev Number: 1 (DW_TAG_member)
    <161>   DW_AT_name        : (indirect string, offset: 0x2c552): wflag
    <165>   DW_AT_decl_file   : 9
    <165>   DW_AT_decl_line   : 89
    <166>   DW_AT_decl_column : 7
    <167>   DW_AT_type        : <0x44>
    <16b>   DW_AT_data_member_location: 3
 <2><16c>: Abbrev Number: 1 (DW_TAG_member)
    <16d>   DW_AT_name        : (indirect string, offset: 0x8186): fsi_flag
    <171>   DW_AT_decl_file   : 9
    <171>   DW_AT_decl_line   : 90
    <172>   DW_AT_decl_column : 7
    <173>   DW_AT_type        : <0x44>
    <177>   DW_AT_data_member_location: 4
 <2><178>: Abbrev Number: 8 (DW_TAG_member)
    <179>   DW_AT_name        : id
    <17c>   DW_AT_decl_file   : 9
    <17c>   DW_AT_decl_line   : 91
    <17d>   DW_AT_decl_column : 7
    <17e>   DW_AT_type        : <0x5e>
    <182>   DW_AT_data_member_location: 6
 <2><183>: Abbrev Number: 1 (DW_TAG_member)
    <184>   DW_AT_name        : (indirect string, offset: 0xa5072): n_rootdir
    <188>   DW_AT_decl_file   : 9
    <188>   DW_AT_decl_line   : 92
    <189>   DW_AT_decl_column : 7
    <18a>   DW_AT_type        : <0x5e>
    <18e>   DW_AT_data_member_location: 8
 <2><18f>: Abbrev Number: 1 (DW_TAG_member)
    <190>   DW_AT_name        : (indirect string, offset: 0xd1a45): csize
    <194>   DW_AT_decl_file   : 9
    <194>   DW_AT_decl_line   : 93
    <195>   DW_AT_decl_column : 7
    <196>   DW_AT_type        : <0x5e>
    <19a>   DW_AT_data_member_location: 10
 <2><19b>: Abbrev Number: 1 (DW_TAG_member)
    <19c>   DW_AT_name        : (indirect string, offset: 0xe675f): ssize
    <1a0>   DW_AT_decl_file   : 9
    <1a0>   DW_AT_decl_line   : 95
    <1a1>   DW_AT_decl_column : 7
    <1a2>   DW_AT_type        : <0x5e>
    <1a6>   DW_AT_data_member_location: 12
 <2><1a7>: Abbrev Number: 1 (DW_TAG_member)
    <1a8>   DW_AT_name        : (indirect string, offset: 0xf830): sobj
    <1ac>   DW_AT_decl_file   : 9
    <1ac>   DW_AT_decl_line   : 104
    <1ad>   DW_AT_decl_column : 10
    <1ae>   DW_AT_type        : <0x10b>
    <1b2>   DW_AT_data_member_location: 16
 <2><1b3>: Abbrev Number: 1 (DW_TAG_member)
    <1b4>   DW_AT_name        : (indirect string, offset: 0x87924): last_clst
    <1b8>   DW_AT_decl_file   : 9
    <1b8>   DW_AT_decl_line   : 107
    <1b9>   DW_AT_decl_column : 8
    <1ba>   DW_AT_type        : <0x78>
    <1be>   DW_AT_data_member_location: 20
 <2><1bf>: Abbrev Number: 1 (DW_TAG_member)
    <1c0>   DW_AT_name        : (indirect string, offset: 0x2b82e): free_clst
    <1c4>   DW_AT_decl_file   : 9
    <1c4>   DW_AT_decl_line   : 108
    <1c5>   DW_AT_decl_column : 8
    <1c6>   DW_AT_type        : <0x78>
    <1ca>   DW_AT_data_member_location: 24
 <2><1cb>: Abbrev Number: 1 (DW_TAG_member)
    <1cc>   DW_AT_name        : (indirect string, offset: 0x77ac7): n_fatent
    <1d0>   DW_AT_decl_file   : 9
    <1d0>   DW_AT_decl_line   : 118
    <1d1>   DW_AT_decl_column : 8
    <1d2>   DW_AT_type        : <0x78>
    <1d6>   DW_AT_data_member_location: 28
 <2><1d7>: Abbrev Number: 1 (DW_TAG_member)
    <1d8>   DW_AT_name        : (indirect string, offset: 0xf6835): fsize
    <1dc>   DW_AT_decl_file   : 9
    <1dc>   DW_AT_decl_line   : 119
    <1dd>   DW_AT_decl_column : 8
    <1de>   DW_AT_type        : <0x78>
    <1e2>   DW_AT_data_member_location: 32
 <2><1e3>: Abbrev Number: 1 (DW_TAG_member)
    <1e4>   DW_AT_name        : (indirect string, offset: 0xaaf3b): volbase
    <1e8>   DW_AT_decl_file   : 9
    <1e8>   DW_AT_decl_line   : 120
    <1e9>   DW_AT_decl_column : 8
    <1ea>   DW_AT_type        : <0x78>
    <1ee>   DW_AT_data_member_location: 36
 <2><1ef>: Abbrev Number: 1 (DW_TAG_member)
    <1f0>   DW_AT_name        : (indirect string, offset: 0x63bcc): fatbase
    <1f4>   DW_AT_decl_file   : 9
    <1f4>   DW_AT_decl_line   : 121
    <1f5>   DW_AT_decl_column : 8
    <1f6>   DW_AT_type        : <0x78>
    <1fa>   DW_AT_data_member_location: 40
 <2><1fb>: Abbrev Number: 1 (DW_TAG_member)
    <1fc>   DW_AT_name        : (indirect string, offset: 0x70eba): dirbase
    <200>   DW_AT_decl_file   : 9
    <200>   DW_AT_decl_line   : 122
    <201>   DW_AT_decl_column : 8
    <202>   DW_AT_type        : <0x78>
    <206>   DW_AT_data_member_location: 44
 <2><207>: Abbrev Number: 1 (DW_TAG_member)
    <208>   DW_AT_name        : (indirect string, offset: 0xbd006): database
    <20c>   DW_AT_decl_file   : 9
    <20c>   DW_AT_decl_line   : 123
    <20d>   DW_AT_decl_column : 8
    <20e>   DW_AT_type        : <0x78>
    <212>   DW_AT_data_member_location: 48
 <2><213>: Abbrev Number: 1 (DW_TAG_member)
    <214>   DW_AT_name        : (indirect string, offset: 0xbd00f): winsect
    <218>   DW_AT_decl_file   : 9
    <218>   DW_AT_decl_line   : 124
    <219>   DW_AT_decl_column : 8
    <21a>   DW_AT_type        : <0x78>
    <21e>   DW_AT_data_member_location: 52
 <2><21f>: Abbrev Number: 8 (DW_TAG_member)
    <220>   DW_AT_name        : win
    <224>   DW_AT_decl_file   : 9
    <224>   DW_AT_decl_line   : 125
    <225>   DW_AT_decl_column : 7
    <226>   DW_AT_type        : <0x22c>
    <22a>   DW_AT_data_member_location: 56
 <2><22b>: Abbrev Number: 0
 <1><22c>: Abbrev Number: 12 (DW_TAG_array_type)
    <22d>   DW_AT_type        : <0x44>
    <231>   DW_AT_sibling     : <0x23d>
 <2><235>: Abbrev Number: 28 (DW_TAG_subrange_type)
    <236>   DW_AT_type        : <0x3d>
    <23a>   DW_AT_upper_bound : 4095
 <2><23c>: Abbrev Number: 0
 <1><23d>: Abbrev Number: 4 (DW_TAG_typedef)
    <23e>   DW_AT_name        : (indirect string, offset: 0x5e7c9): FATFS
    <242>   DW_AT_decl_file   : 9
    <243>   DW_AT_decl_line   : 126
    <244>   DW_AT_decl_column : 3
    <245>   DW_AT_type        : <0x134>
 <1><249>: Abbrev Number: 13 (DW_TAG_structure_type)
    <24a>   DW_AT_byte_size   : 20
    <24b>   DW_AT_decl_file   : 9
    <24b>   DW_AT_decl_line   : 132
    <24c>   DW_AT_decl_column : 9
    <24c>   DW_AT_sibling     : <0x2a3>
 <2><250>: Abbrev Number: 8 (DW_TAG_member)
    <251>   DW_AT_name        : fs
    <254>   DW_AT_decl_file   : 9
    <254>   DW_AT_decl_line   : 133
    <255>   DW_AT_decl_column : 9
    <256>   DW_AT_type        : <0x2a3>
    <25a>   DW_AT_data_member_location: 0
 <2><25b>: Abbrev Number: 8 (DW_TAG_member)
    <25c>   DW_AT_name        : id
    <25f>   DW_AT_decl_file   : 9
    <25f>   DW_AT_decl_line   : 134
    <260>   DW_AT_decl_column : 7
    <261>   DW_AT_type        : <0x5e>
    <265>   DW_AT_data_member_location: 4
 <2><266>: Abbrev Number: 1 (DW_TAG_member)
    <267>   DW_AT_name        : (indirect string, offset: 0x7f162): attr
    <26b>   DW_AT_decl_file   : 9
    <26b>   DW_AT_decl_line   : 135
    <26c>   DW_AT_decl_column : 7
    <26d>   DW_AT_type        : <0x44>
    <271>   DW_AT_data_member_location: 6
 <2><272>: Abbrev Number: 1 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0x2badd): stat
    <277>   DW_AT_decl_file   : 9
    <277>   DW_AT_decl_line   : 136
    <278>   DW_AT_decl_column : 7
    <279>   DW_AT_type        : <0x44>
    <27d>   DW_AT_data_member_location: 7
 <2><27e>: Abbrev Number: 1 (DW_TAG_member)
    <27f>   DW_AT_name        : (indirect string, offset: 0xddfc): sclust
    <283>   DW_AT_decl_file   : 9
    <283>   DW_AT_decl_line   : 137
    <284>   DW_AT_decl_column : 8
    <285>   DW_AT_type        : <0x78>
    <289>   DW_AT_data_member_location: 8
 <2><28a>: Abbrev Number: 1 (DW_TAG_member)
    <28b>   DW_AT_name        : (indirect string, offset: 0x9c885): objsize
    <28f>   DW_AT_decl_file   : 9
    <28f>   DW_AT_decl_line   : 138
    <290>   DW_AT_decl_column : 10
    <291>   DW_AT_type        : <0x128>
    <295>   DW_AT_data_member_location: 12
 <2><296>: Abbrev Number: 1 (DW_TAG_member)
    <297>   DW_AT_name        : (indirect string, offset: 0xbe29a): lockid
    <29b>   DW_AT_decl_file   : 9
    <29b>   DW_AT_decl_line   : 147
    <29c>   DW_AT_decl_column : 7
    <29d>   DW_AT_type        : <0x31>
    <2a1>   DW_AT_data_member_location: 16
 <2><2a2>: Abbrev Number: 0
 <1><2a3>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <2a4>   DW_AT_byte_size   : 4
    <2a4>   DW_AT_type        : <0x23d>
 <1><2a8>: Abbrev Number: 4 (DW_TAG_typedef)
    <2a9>   DW_AT_name        : (indirect string, offset: 0x1e61c): _FDID
    <2ad>   DW_AT_decl_file   : 9
    <2ae>   DW_AT_decl_line   : 149
    <2af>   DW_AT_decl_column : 3
    <2b0>   DW_AT_type        : <0x249>
 <1><2b4>: Abbrev Number: 16 (DW_TAG_structure_type)
    <2b5>   DW_AT_byte_size   : 4144
    <2b7>   DW_AT_decl_file   : 9
    <2b7>   DW_AT_decl_line   : 155
    <2b8>   DW_AT_decl_column : 9
    <2b8>   DW_AT_sibling     : <0x335>
 <2><2bc>: Abbrev Number: 8 (DW_TAG_member)
    <2bd>   DW_AT_name        : obj
    <2c1>   DW_AT_decl_file   : 9
    <2c1>   DW_AT_decl_line   : 156
    <2c2>   DW_AT_decl_column : 8
    <2c3>   DW_AT_type        : <0x2a8>
    <2c7>   DW_AT_data_member_location: 0
 <2><2c8>: Abbrev Number: 1 (DW_TAG_member)
    <2c9>   DW_AT_name        : (indirect string, offset: 0x818a): flag
    <2cd>   DW_AT_decl_file   : 9
    <2cd>   DW_AT_decl_line   : 157
    <2ce>   DW_AT_decl_column : 7
    <2cf>   DW_AT_type        : <0x44>
    <2d3>   DW_AT_data_member_location: 20
 <2><2d4>: Abbrev Number: 8 (DW_TAG_member)
    <2d5>   DW_AT_name        : err
    <2d9>   DW_AT_decl_file   : 9
    <2d9>   DW_AT_decl_line   : 158
    <2da>   DW_AT_decl_column : 7
    <2db>   DW_AT_type        : <0x44>
    <2df>   DW_AT_data_member_location: 21
 <2><2e0>: Abbrev Number: 1 (DW_TAG_member)
    <2e1>   DW_AT_name        : (indirect string, offset: 0xfe597): fptr
    <2e5>   DW_AT_decl_file   : 9
    <2e5>   DW_AT_decl_line   : 159
    <2e6>   DW_AT_decl_column : 10
    <2e7>   DW_AT_type        : <0x128>
    <2eb>   DW_AT_data_member_location: 24
 <2><2ec>: Abbrev Number: 1 (DW_TAG_member)
    <2ed>   DW_AT_name        : (indirect string, offset: 0xff035): clust
    <2f1>   DW_AT_decl_file   : 9
    <2f1>   DW_AT_decl_line   : 160
    <2f2>   DW_AT_decl_column : 8
    <2f3>   DW_AT_type        : <0x78>
    <2f7>   DW_AT_data_member_location: 28
 <2><2f8>: Abbrev Number: 1 (DW_TAG_member)
    <2f9>   DW_AT_name        : (indirect string, offset: 0xfe242): sect
    <2fd>   DW_AT_decl_file   : 9
    <2fd>   DW_AT_decl_line   : 161
    <2fe>   DW_AT_decl_column : 8
    <2ff>   DW_AT_type        : <0x78>
    <303>   DW_AT_data_member_location: 32
 <2><304>: Abbrev Number: 1 (DW_TAG_member)
    <305>   DW_AT_name        : (indirect string, offset: 0x4444c): dir_sect
    <309>   DW_AT_decl_file   : 9
    <309>   DW_AT_decl_line   : 163
    <30a>   DW_AT_decl_column : 8
    <30b>   DW_AT_type        : <0x78>
    <30f>   DW_AT_data_member_location: 36
 <2><310>: Abbrev Number: 1 (DW_TAG_member)
    <311>   DW_AT_name        : (indirect string, offset: 0xee324): dir_ptr
    <315>   DW_AT_decl_file   : 9
    <315>   DW_AT_decl_line   : 164
    <316>   DW_AT_decl_column : 8
    <317>   DW_AT_type        : <0x335>
    <31b>   DW_AT_data_member_location: 40
 <2><31c>: Abbrev Number: 1 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x5990): cltbl
    <321>   DW_AT_decl_file   : 9
    <321>   DW_AT_decl_line   : 167
    <322>   DW_AT_decl_column : 9
    <323>   DW_AT_type        : <0x33a>
    <327>   DW_AT_data_member_location: 44
 <2><328>: Abbrev Number: 8 (DW_TAG_member)
    <329>   DW_AT_name        : buf
    <32d>   DW_AT_decl_file   : 9
    <32d>   DW_AT_decl_line   : 170
    <32e>   DW_AT_decl_column : 7
    <32f>   DW_AT_type        : <0x22c>
    <333>   DW_AT_data_member_location: 48
 <2><334>: Abbrev Number: 0
 <1><335>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <336>   DW_AT_byte_size   : 4
    <336>   DW_AT_type        : <0x44>
 <1><33a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <33b>   DW_AT_byte_size   : 4
    <33b>   DW_AT_type        : <0x78>
 <1><33f>: Abbrev Number: 17 (DW_TAG_typedef)
    <340>   DW_AT_name        : FIL
    <344>   DW_AT_decl_file   : 9
    <344>   DW_AT_decl_line   : 172
    <345>   DW_AT_decl_column : 3
    <345>   DW_AT_type        : <0x2b4>
 <1><349>: Abbrev Number: 13 (DW_TAG_structure_type)
    <34a>   DW_AT_byte_size   : 48
    <34b>   DW_AT_decl_file   : 9
    <34b>   DW_AT_decl_line   : 178
    <34c>   DW_AT_decl_column : 9
    <34c>   DW_AT_sibling     : <0x398>
 <2><350>: Abbrev Number: 8 (DW_TAG_member)
    <351>   DW_AT_name        : obj
    <355>   DW_AT_decl_file   : 9
    <355>   DW_AT_decl_line   : 179
    <356>   DW_AT_decl_column : 8
    <357>   DW_AT_type        : <0x2a8>
    <35b>   DW_AT_data_member_location: 0
 <2><35c>: Abbrev Number: 1 (DW_TAG_member)
    <35d>   DW_AT_name        : (indirect string, offset: 0x7fce2): dptr
    <361>   DW_AT_decl_file   : 9
    <361>   DW_AT_decl_line   : 180
    <362>   DW_AT_decl_column : 8
    <363>   DW_AT_type        : <0x78>
    <367>   DW_AT_data_member_location: 20
 <2><368>: Abbrev Number: 1 (DW_TAG_member)
    <369>   DW_AT_name        : (indirect string, offset: 0xff035): clust
    <36d>   DW_AT_decl_file   : 9
    <36d>   DW_AT_decl_line   : 181
    <36e>   DW_AT_decl_column : 8
    <36f>   DW_AT_type        : <0x78>
    <373>   DW_AT_data_member_location: 24
 <2><374>: Abbrev Number: 1 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0xfe242): sect
    <379>   DW_AT_decl_file   : 9
    <379>   DW_AT_decl_line   : 182
    <37a>   DW_AT_decl_column : 8
    <37b>   DW_AT_type        : <0x78>
    <37f>   DW_AT_data_member_location: 28
 <2><380>: Abbrev Number: 8 (DW_TAG_member)
    <381>   DW_AT_name        : dir
    <385>   DW_AT_decl_file   : 9
    <385>   DW_AT_decl_line   : 183
    <386>   DW_AT_decl_column : 8
    <387>   DW_AT_type        : <0x335>
    <38b>   DW_AT_data_member_location: 32
 <2><38c>: Abbrev Number: 8 (DW_TAG_member)
    <38d>   DW_AT_name        : fn
    <390>   DW_AT_decl_file   : 9
    <390>   DW_AT_decl_line   : 184
    <391>   DW_AT_decl_column : 7
    <392>   DW_AT_type        : <0x398>
    <396>   DW_AT_data_member_location: 36
 <2><397>: Abbrev Number: 0
 <1><398>: Abbrev Number: 12 (DW_TAG_array_type)
    <399>   DW_AT_type        : <0x44>
    <39d>   DW_AT_sibling     : <0x3a8>
 <2><3a1>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <3a2>   DW_AT_type        : <0x3d>
    <3a6>   DW_AT_upper_bound : 11
 <2><3a7>: Abbrev Number: 0
 <1><3a8>: Abbrev Number: 17 (DW_TAG_typedef)
    <3a9>   DW_AT_name        : DIR
    <3ad>   DW_AT_decl_file   : 9
    <3ad>   DW_AT_decl_line   : 191
    <3ae>   DW_AT_decl_column : 3
    <3ae>   DW_AT_type        : <0x349>
 <1><3b2>: Abbrev Number: 13 (DW_TAG_structure_type)
    <3b3>   DW_AT_byte_size   : 24
    <3b4>   DW_AT_decl_file   : 9
    <3b4>   DW_AT_decl_line   : 197
    <3b5>   DW_AT_decl_column : 9
    <3b5>   DW_AT_sibling     : <0x3f6>
 <2><3b9>: Abbrev Number: 1 (DW_TAG_member)
    <3ba>   DW_AT_name        : (indirect string, offset: 0xf6835): fsize
    <3be>   DW_AT_decl_file   : 9
    <3be>   DW_AT_decl_line   : 198
    <3bf>   DW_AT_decl_column : 10
    <3c0>   DW_AT_type        : <0x128>
    <3c4>   DW_AT_data_member_location: 0
 <2><3c5>: Abbrev Number: 1 (DW_TAG_member)
    <3c6>   DW_AT_name        : (indirect string, offset: 0xe89c7): fdate
    <3ca>   DW_AT_decl_file   : 9
    <3ca>   DW_AT_decl_line   : 199
    <3cb>   DW_AT_decl_column : 7
    <3cc>   DW_AT_type        : <0x5e>
    <3d0>   DW_AT_data_member_location: 4
 <2><3d1>: Abbrev Number: 1 (DW_TAG_member)
    <3d2>   DW_AT_name        : (indirect string, offset: 0xee52c): ftime
    <3d6>   DW_AT_decl_file   : 9
    <3d6>   DW_AT_decl_line   : 200
    <3d7>   DW_AT_decl_column : 7
    <3d8>   DW_AT_type        : <0x5e>
    <3dc>   DW_AT_data_member_location: 6
 <2><3dd>: Abbrev Number: 1 (DW_TAG_member)
    <3de>   DW_AT_name        : (indirect string, offset: 0x69c4): fattrib
    <3e2>   DW_AT_decl_file   : 9
    <3e2>   DW_AT_decl_line   : 201
    <3e3>   DW_AT_decl_column : 7
    <3e4>   DW_AT_type        : <0x44>
    <3e8>   DW_AT_data_member_location: 8
 <2><3e9>: Abbrev Number: 1 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xbde8a): fname
    <3ee>   DW_AT_decl_file   : 9
    <3ee>   DW_AT_decl_line   : 206
    <3ef>   DW_AT_decl_column : 8
    <3f0>   DW_AT_type        : <0x3f6>
    <3f4>   DW_AT_data_member_location: 9
 <2><3f5>: Abbrev Number: 0
 <1><3f6>: Abbrev Number: 12 (DW_TAG_array_type)
    <3f7>   DW_AT_type        : <0x117>
    <3fb>   DW_AT_sibling     : <0x406>
 <2><3ff>: Abbrev Number: 18 (DW_TAG_subrange_type)
    <400>   DW_AT_type        : <0x3d>
    <404>   DW_AT_upper_bound : 12
 <2><405>: Abbrev Number: 0
 <1><406>: Abbrev Number: 4 (DW_TAG_typedef)
    <407>   DW_AT_name        : (indirect string, offset: 0xacf35): FILINFO
    <40b>   DW_AT_decl_file   : 9
    <40c>   DW_AT_decl_line   : 208
    <40d>   DW_AT_decl_column : 3
    <40e>   DW_AT_type        : <0x3b2>
 <1><412>: Abbrev Number: 29 (DW_TAG_enumeration_type)
    <413>   DW_AT_encoding    : 7	(unsigned)
    <414>   DW_AT_byte_size   : 1
    <415>   DW_AT_type        : <0x50>
    <419>   DW_AT_decl_file   : 9
    <41a>   DW_AT_decl_line   : 214
    <41b>   DW_AT_decl_column : 14
    <41c>   DW_AT_sibling     : <0x499>
 <2><420>: Abbrev Number: 3 (DW_TAG_enumerator)
    <421>   DW_AT_name        : (indirect string, offset: 0x967e): FR_OK
    <425>   DW_AT_const_value : 0
 <2><426>: Abbrev Number: 3 (DW_TAG_enumerator)
    <427>   DW_AT_name        : (indirect string, offset: 0x84162): FR_DISK_ERR
    <42b>   DW_AT_const_value : 1
 <2><42c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <42d>   DW_AT_name        : (indirect string, offset: 0xa587c): FR_INT_ERR
    <431>   DW_AT_const_value : 2
 <2><432>: Abbrev Number: 3 (DW_TAG_enumerator)
    <433>   DW_AT_name        : (indirect string, offset: 0x4a4c4): FR_NOT_READY
    <437>   DW_AT_const_value : 3
 <2><438>: Abbrev Number: 3 (DW_TAG_enumerator)
    <439>   DW_AT_name        : (indirect string, offset: 0x81705): FR_NO_FILE
    <43d>   DW_AT_const_value : 4
 <2><43e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <43f>   DW_AT_name        : (indirect string, offset: 0x46bc0): FR_NO_PATH
    <443>   DW_AT_const_value : 5
 <2><444>: Abbrev Number: 3 (DW_TAG_enumerator)
    <445>   DW_AT_name        : (indirect string, offset: 0xaaacd): FR_INVALID_NAME
    <449>   DW_AT_const_value : 6
 <2><44a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <44b>   DW_AT_name        : (indirect string, offset: 0xd9620): FR_DENIED
    <44f>   DW_AT_const_value : 7
 <2><450>: Abbrev Number: 3 (DW_TAG_enumerator)
    <451>   DW_AT_name        : (indirect string, offset: 0xb1f13): FR_EXIST
    <455>   DW_AT_const_value : 8
 <2><456>: Abbrev Number: 3 (DW_TAG_enumerator)
    <457>   DW_AT_name        : (indirect string, offset: 0x832cb): FR_INVALID_OBJECT
    <45b>   DW_AT_const_value : 9
 <2><45c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <45d>   DW_AT_name        : (indirect string, offset: 0x6bfe9): FR_WRITE_PROTECTED
    <461>   DW_AT_const_value : 10
 <2><462>: Abbrev Number: 3 (DW_TAG_enumerator)
    <463>   DW_AT_name        : (indirect string, offset: 0x8de4e): FR_INVALID_DRIVE
    <467>   DW_AT_const_value : 11
 <2><468>: Abbrev Number: 3 (DW_TAG_enumerator)
    <469>   DW_AT_name        : (indirect string, offset: 0x9e7c4): FR_NOT_ENABLED
    <46d>   DW_AT_const_value : 12
 <2><46e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <46f>   DW_AT_name        : (indirect string, offset: 0x872f9): FR_NO_FILESYSTEM
    <473>   DW_AT_const_value : 13
 <2><474>: Abbrev Number: 3 (DW_TAG_enumerator)
    <475>   DW_AT_name        : (indirect string, offset: 0x3d940): FR_MKFS_ABORTED
    <479>   DW_AT_const_value : 14
 <2><47a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <47b>   DW_AT_name        : (indirect string, offset: 0x42bc9): FR_TIMEOUT
    <47f>   DW_AT_const_value : 15
 <2><480>: Abbrev Number: 3 (DW_TAG_enumerator)
    <481>   DW_AT_name        : (indirect string, offset: 0xcbed1): FR_LOCKED
    <485>   DW_AT_const_value : 16
 <2><486>: Abbrev Number: 3 (DW_TAG_enumerator)
    <487>   DW_AT_name        : (indirect string, offset: 0x8cb8b): FR_NOT_ENOUGH_CORE
    <48b>   DW_AT_const_value : 17
 <2><48c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <48d>   DW_AT_name        : (indirect string, offset: 0xaef2b): FR_TOO_MANY_OPEN_FILES
    <491>   DW_AT_const_value : 18
 <2><492>: Abbrev Number: 3 (DW_TAG_enumerator)
    <493>   DW_AT_name        : (indirect string, offset: 0x726fd): FR_INVALID_PARAMETER
    <497>   DW_AT_const_value : 19
 <2><498>: Abbrev Number: 0
 <1><499>: Abbrev Number: 4 (DW_TAG_typedef)
    <49a>   DW_AT_name        : (indirect string, offset: 0xe6fee): FRESULT
    <49e>   DW_AT_decl_file   : 9
    <49f>   DW_AT_decl_line   : 235
    <4a0>   DW_AT_decl_column : 3
    <4a1>   DW_AT_type        : <0x412>
 <1><4a5>: Abbrev Number: 10 (DW_TAG_variable)
    <4a6>   DW_AT_name        : fs
    <4a9>   DW_AT_decl_file   : 1
    <4a9>   DW_AT_decl_line   : 5
    <4aa>   DW_AT_decl_column : 7
    <4ab>   DW_AT_type        : <0x23d>
    <4af>   DW_AT_external    : 1
    <4af>   DW_AT_location    : 5 byte block: 3 88 0 0 20 	(DW_OP_addr: 20000088)
 <1><4b5>: Abbrev Number: 10 (DW_TAG_variable)
    <4b6>   DW_AT_name        : fil
    <4ba>   DW_AT_decl_file   : 1
    <4ba>   DW_AT_decl_line   : 6
    <4bb>   DW_AT_decl_column : 5
    <4bc>   DW_AT_type        : <0x33f>
    <4c0>   DW_AT_external    : 1
    <4c0>   DW_AT_location    : 5 byte block: 3 c0 10 0 20 	(DW_OP_addr: 200010c0)
 <1><4c6>: Abbrev Number: 10 (DW_TAG_variable)
    <4c7>   DW_AT_name        : fno
    <4cb>   DW_AT_decl_file   : 1
    <4cb>   DW_AT_decl_line   : 7
    <4cc>   DW_AT_decl_column : 9
    <4cd>   DW_AT_type        : <0x406>
    <4d1>   DW_AT_external    : 1
    <4d1>   DW_AT_location    : 5 byte block: 3 f0 20 0 20 	(DW_OP_addr: 200020f0)
 <1><4d7>: Abbrev Number: 19 (DW_TAG_variable)
    <4d8>   DW_AT_name        : (indirect string, offset: 0xe6b6c): fresult
    <4dc>   DW_AT_decl_file   : 1
    <4dc>   DW_AT_decl_line   : 8
    <4dd>   DW_AT_decl_column : 9
    <4de>   DW_AT_type        : <0x499>
    <4e2>   DW_AT_external    : 1
    <4e2>   DW_AT_location    : 5 byte block: 3 8 21 0 20 	(DW_OP_addr: 20002108)
 <1><4e8>: Abbrev Number: 10 (DW_TAG_variable)
    <4e9>   DW_AT_name        : br
    <4ec>   DW_AT_decl_file   : 1
    <4ec>   DW_AT_decl_line   : 9
    <4ed>   DW_AT_decl_column : 6
    <4ee>   DW_AT_type        : <0x31>
    <4f2>   DW_AT_external    : 1
    <4f2>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><4f8>: Abbrev Number: 10 (DW_TAG_variable)
    <4f9>   DW_AT_name        : bw
    <4fc>   DW_AT_decl_file   : 1
    <4fc>   DW_AT_decl_line   : 9
    <4fd>   DW_AT_decl_column : 10
    <4fe>   DW_AT_type        : <0x31>
    <502>   DW_AT_external    : 1
    <502>   DW_AT_location    : 5 byte block: 3 c 21 0 20 	(DW_OP_addr: 2000210c)
 <1><508>: Abbrev Number: 10 (DW_TAG_variable)
    <509>   DW_AT_name        : pfs
    <50d>   DW_AT_decl_file   : 1
    <50d>   DW_AT_decl_line   : 12
    <50e>   DW_AT_decl_column : 8
    <50f>   DW_AT_type        : <0x2a3>
    <513>   DW_AT_external    : 1
    <513>   DW_AT_location    : 5 byte block: 3 10 21 0 20 	(DW_OP_addr: 20002110)
 <1><519>: Abbrev Number: 19 (DW_TAG_variable)
    <51a>   DW_AT_name        : (indirect string, offset: 0xb1716): fre_clust
    <51e>   DW_AT_decl_file   : 1
    <51e>   DW_AT_decl_line   : 13
    <51f>   DW_AT_decl_column : 7
    <520>   DW_AT_type        : <0x78>
    <524>   DW_AT_external    : 1
    <524>   DW_AT_location    : 5 byte block: 3 14 21 0 20 	(DW_OP_addr: 20002114)
 <1><52a>: Abbrev Number: 14 (DW_TAG_subprogram)
    <52b>   DW_AT_external    : 1
    <52b>   DW_AT_name        : (indirect string, offset: 0x676fb): f_getfree
    <52f>   DW_AT_decl_file   : 9
    <52f>   DW_AT_decl_line   : 263
    <531>   DW_AT_decl_column : 9
    <531>   DW_AT_prototyped  : 1
    <531>   DW_AT_type        : <0x499>
    <535>   DW_AT_declaration : 1
    <535>   DW_AT_sibling     : <0x549>
 <2><539>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <53a>   DW_AT_type        : <0x549>
 <2><53e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <53f>   DW_AT_type        : <0x33a>
 <2><543>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <544>   DW_AT_type        : <0x54e>
 <2><548>: Abbrev Number: 0
 <1><549>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <54a>   DW_AT_byte_size   : 4
    <54a>   DW_AT_type        : <0x123>
 <1><54e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <54f>   DW_AT_byte_size   : 4
    <54f>   DW_AT_type        : <0x2a3>
 <1><553>: Abbrev Number: 5 (DW_TAG_subprogram)
    <554>   DW_AT_external    : 1
    <554>   DW_AT_name        : (indirect string, offset: 0x5582b): f_mkdir
    <558>   DW_AT_decl_file   : 9
    <559>   DW_AT_decl_line   : 254
    <55a>   DW_AT_decl_column : 9
    <55b>   DW_AT_prototyped  : 1
    <55b>   DW_AT_type        : <0x499>
    <55f>   DW_AT_declaration : 1
    <55f>   DW_AT_sibling     : <0x569>
 <2><563>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <564>   DW_AT_type        : <0x549>
 <2><568>: Abbrev Number: 0
 <1><569>: Abbrev Number: 5 (DW_TAG_subprogram)
    <56a>   DW_AT_external    : 1
    <56a>   DW_AT_name        : (indirect string, offset: 0xe6ad8): f_read
    <56e>   DW_AT_decl_file   : 9
    <56f>   DW_AT_decl_line   : 244
    <570>   DW_AT_decl_column : 9
    <571>   DW_AT_prototyped  : 1
    <571>   DW_AT_type        : <0x499>
    <575>   DW_AT_declaration : 1
    <575>   DW_AT_sibling     : <0x58e>
 <2><579>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <57a>   DW_AT_type        : <0x58e>
 <2><57e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <57f>   DW_AT_type        : <0xcb>
 <2><583>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <584>   DW_AT_type        : <0x31>
 <2><588>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <589>   DW_AT_type        : <0x593>
 <2><58d>: Abbrev Number: 0
 <1><58e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <58f>   DW_AT_byte_size   : 4
    <58f>   DW_AT_type        : <0x33f>
 <1><593>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <594>   DW_AT_byte_size   : 4
    <594>   DW_AT_type        : <0x31>
 <1><598>: Abbrev Number: 5 (DW_TAG_subprogram)
    <599>   DW_AT_external    : 1
    <599>   DW_AT_name        : (indirect string, offset: 0x85ac9): f_write
    <59d>   DW_AT_decl_file   : 9
    <59e>   DW_AT_decl_line   : 245
    <59f>   DW_AT_decl_column : 9
    <5a0>   DW_AT_prototyped  : 1
    <5a0>   DW_AT_type        : <0x499>
    <5a4>   DW_AT_declaration : 1
    <5a4>   DW_AT_sibling     : <0x5bd>
 <2><5a8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5a9>   DW_AT_type        : <0x58e>
 <2><5ad>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5ae>   DW_AT_type        : <0x105>
 <2><5b2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5b3>   DW_AT_type        : <0x31>
 <2><5b7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5b8>   DW_AT_type        : <0x593>
 <2><5bc>: Abbrev Number: 0
 <1><5bd>: Abbrev Number: 5 (DW_TAG_subprogram)
    <5be>   DW_AT_external    : 1
    <5be>   DW_AT_name        : (indirect string, offset: 0x538cd): strlen
    <5c2>   DW_AT_decl_file   : 10
    <5c3>   DW_AT_decl_line   : 41
    <5c4>   DW_AT_decl_column : 9
    <5c5>   DW_AT_prototyped  : 1
    <5c5>   DW_AT_type        : <0xb8>
    <5c9>   DW_AT_declaration : 1
    <5c9>   DW_AT_sibling     : <0x5d3>
 <2><5cd>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5ce>   DW_AT_type        : <0xde>
 <2><5d2>: Abbrev Number: 0
 <1><5d3>: Abbrev Number: 5 (DW_TAG_subprogram)
    <5d4>   DW_AT_external    : 1
    <5d4>   DW_AT_name        : (indirect string, offset: 0xd3b0c): f_close
    <5d8>   DW_AT_decl_file   : 9
    <5d9>   DW_AT_decl_line   : 243
    <5da>   DW_AT_decl_column : 9
    <5db>   DW_AT_prototyped  : 1
    <5db>   DW_AT_type        : <0x499>
    <5df>   DW_AT_declaration : 1
    <5df>   DW_AT_sibling     : <0x5e9>
 <2><5e3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5e4>   DW_AT_type        : <0x58e>
 <2><5e8>: Abbrev Number: 0
 <1><5e9>: Abbrev Number: 5 (DW_TAG_subprogram)
    <5ea>   DW_AT_external    : 1
    <5ea>   DW_AT_name        : (indirect string, offset: 0xde3af): f_open
    <5ee>   DW_AT_decl_file   : 9
    <5ef>   DW_AT_decl_line   : 242
    <5f0>   DW_AT_decl_column : 9
    <5f1>   DW_AT_prototyped  : 1
    <5f1>   DW_AT_type        : <0x499>
    <5f5>   DW_AT_declaration : 1
    <5f5>   DW_AT_sibling     : <0x609>
 <2><5f9>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5fa>   DW_AT_type        : <0x58e>
 <2><5fe>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5ff>   DW_AT_type        : <0x549>
 <2><603>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <604>   DW_AT_type        : <0x44>
 <2><608>: Abbrev Number: 0
 <1><609>: Abbrev Number: 14 (DW_TAG_subprogram)
    <60a>   DW_AT_external    : 1
    <60a>   DW_AT_name        : (indirect string, offset: 0x2badb): f_stat
    <60e>   DW_AT_decl_file   : 9
    <60e>   DW_AT_decl_line   : 257
    <610>   DW_AT_decl_column : 9
    <610>   DW_AT_prototyped  : 1
    <610>   DW_AT_type        : <0x499>
    <614>   DW_AT_declaration : 1
    <614>   DW_AT_sibling     : <0x623>
 <2><618>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <619>   DW_AT_type        : <0x549>
 <2><61d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <61e>   DW_AT_type        : <0x623>
 <2><622>: Abbrev Number: 0
 <1><623>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <624>   DW_AT_byte_size   : 4
    <624>   DW_AT_type        : <0x406>
 <1><628>: Abbrev Number: 30 (DW_TAG_subprogram)
    <629>   DW_AT_external    : 1
    <629>   DW_AT_name        : (indirect string, offset: 0xfe34d): free
    <62d>   DW_AT_decl_file   : 12
    <62e>   DW_AT_decl_line   : 94
    <62f>   DW_AT_decl_column : 6
    <630>   DW_AT_prototyped  : 1
    <630>   DW_AT_declaration : 1
    <630>   DW_AT_sibling     : <0x63a>
 <2><634>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <635>   DW_AT_type        : <0xcb>
 <2><639>: Abbrev Number: 0
 <1><63a>: Abbrev Number: 5 (DW_TAG_subprogram)
    <63b>   DW_AT_external    : 1
    <63b>   DW_AT_name        : (indirect string, offset: 0x38f38): f_closedir
    <63f>   DW_AT_decl_file   : 9
    <640>   DW_AT_decl_line   : 250
    <641>   DW_AT_decl_column : 9
    <642>   DW_AT_prototyped  : 1
    <642>   DW_AT_type        : <0x499>
    <646>   DW_AT_declaration : 1
    <646>   DW_AT_sibling     : <0x650>
 <2><64a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <64b>   DW_AT_type        : <0x650>
 <2><64f>: Abbrev Number: 0
 <1><650>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <651>   DW_AT_byte_size   : 4
    <651>   DW_AT_type        : <0x3a8>
 <1><655>: Abbrev Number: 5 (DW_TAG_subprogram)
    <656>   DW_AT_external    : 1
    <656>   DW_AT_name        : (indirect string, offset: 0x791d7): f_unlink
    <65a>   DW_AT_decl_file   : 9
    <65b>   DW_AT_decl_line   : 255
    <65c>   DW_AT_decl_column : 9
    <65d>   DW_AT_prototyped  : 1
    <65d>   DW_AT_type        : <0x499>
    <661>   DW_AT_declaration : 1
    <661>   DW_AT_sibling     : <0x66b>
 <2><665>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <666>   DW_AT_type        : <0x549>
 <2><66a>: Abbrev Number: 0
 <1><66b>: Abbrev Number: 5 (DW_TAG_subprogram)
    <66c>   DW_AT_external    : 1
    <66c>   DW_AT_name        : (indirect string, offset: 0x1e942): strcmp
    <670>   DW_AT_decl_file   : 10
    <671>   DW_AT_decl_line   : 36
    <672>   DW_AT_decl_column : 6
    <673>   DW_AT_prototyped  : 1
    <673>   DW_AT_type        : <0x2a>
    <677>   DW_AT_declaration : 1
    <677>   DW_AT_sibling     : <0x686>
 <2><67b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <67c>   DW_AT_type        : <0xde>
 <2><680>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <681>   DW_AT_type        : <0xde>
 <2><685>: Abbrev Number: 0
 <1><686>: Abbrev Number: 5 (DW_TAG_subprogram)
    <687>   DW_AT_external    : 1
    <687>   DW_AT_name        : (indirect string, offset: 0x9de26): f_readdir
    <68b>   DW_AT_decl_file   : 9
    <68c>   DW_AT_decl_line   : 251
    <68d>   DW_AT_decl_column : 9
    <68e>   DW_AT_prototyped  : 1
    <68e>   DW_AT_type        : <0x499>
    <692>   DW_AT_declaration : 1
    <692>   DW_AT_sibling     : <0x6a1>
 <2><696>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <697>   DW_AT_type        : <0x650>
 <2><69b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <69c>   DW_AT_type        : <0x623>
 <2><6a0>: Abbrev Number: 0
 <1><6a1>: Abbrev Number: 5 (DW_TAG_subprogram)
    <6a2>   DW_AT_external    : 1
    <6a2>   DW_AT_name        : (indirect string, offset: 0x55133): f_opendir
    <6a6>   DW_AT_decl_file   : 9
    <6a7>   DW_AT_decl_line   : 249
    <6a8>   DW_AT_decl_column : 9
    <6a9>   DW_AT_prototyped  : 1
    <6a9>   DW_AT_type        : <0x499>
    <6ad>   DW_AT_declaration : 1
    <6ad>   DW_AT_sibling     : <0x6bc>
 <2><6b1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6b2>   DW_AT_type        : <0x650>
 <2><6b6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6b7>   DW_AT_type        : <0x549>
 <2><6bb>: Abbrev Number: 0
 <1><6bc>: Abbrev Number: 5 (DW_TAG_subprogram)
    <6bd>   DW_AT_external    : 1
    <6bd>   DW_AT_name        : (indirect string, offset: 0x40263): sprintf
    <6c1>   DW_AT_decl_file   : 11
    <6c2>   DW_AT_decl_line   : 250
    <6c3>   DW_AT_decl_column : 5
    <6c4>   DW_AT_prototyped  : 1
    <6c4>   DW_AT_type        : <0x2a>
    <6c8>   DW_AT_declaration : 1
    <6c8>   DW_AT_sibling     : <0x6d8>
 <2><6cc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6cd>   DW_AT_type        : <0xcd>
 <2><6d1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6d2>   DW_AT_type        : <0xde>
 <2><6d6>: Abbrev Number: 20 (DW_TAG_unspecified_parameters)
 <2><6d7>: Abbrev Number: 0
 <1><6d8>: Abbrev Number: 5 (DW_TAG_subprogram)
    <6d9>   DW_AT_external    : 1
    <6d9>   DW_AT_name        : (indirect string, offset: 0x8529c): malloc
    <6dd>   DW_AT_decl_file   : 12
    <6de>   DW_AT_decl_line   : 108
    <6df>   DW_AT_decl_column : 7
    <6e0>   DW_AT_prototyped  : 1
    <6e0>   DW_AT_type        : <0xcb>
    <6e4>   DW_AT_declaration : 1
    <6e4>   DW_AT_sibling     : <0x6ee>
 <2><6e8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6e9>   DW_AT_type        : <0xb8>
 <2><6ed>: Abbrev Number: 0
 <1><6ee>: Abbrev Number: 31 (DW_TAG_subprogram)
    <6ef>   DW_AT_external    : 1
    <6ef>   DW_AT_name        : (indirect string, offset: 0x579e2): Error_Handler
    <6f3>   DW_AT_decl_file   : 13
    <6f4>   DW_AT_decl_line   : 53
    <6f5>   DW_AT_decl_column : 6
    <6f6>   DW_AT_prototyped  : 1
    <6f6>   DW_AT_declaration : 1
 <1><6f6>: Abbrev Number: 5 (DW_TAG_subprogram)
    <6f7>   DW_AT_external    : 1
    <6f7>   DW_AT_name        : (indirect string, offset: 0xfece0): printf
    <6fb>   DW_AT_decl_file   : 11
    <6fc>   DW_AT_decl_line   : 206
    <6fd>   DW_AT_decl_column : 5
    <6fe>   DW_AT_prototyped  : 1
    <6fe>   DW_AT_type        : <0x2a>
    <702>   DW_AT_declaration : 1
    <702>   DW_AT_sibling     : <0x70d>
 <2><706>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <707>   DW_AT_type        : <0xde>
 <2><70b>: Abbrev Number: 20 (DW_TAG_unspecified_parameters)
 <2><70c>: Abbrev Number: 0
 <1><70d>: Abbrev Number: 14 (DW_TAG_subprogram)
    <70e>   DW_AT_external    : 1
    <70e>   DW_AT_name        : (indirect string, offset: 0x686a1): f_mount
    <712>   DW_AT_decl_file   : 9
    <712>   DW_AT_decl_line   : 268
    <714>   DW_AT_decl_column : 9
    <714>   DW_AT_prototyped  : 1
    <714>   DW_AT_type        : <0x499>
    <718>   DW_AT_declaration : 1
    <718>   DW_AT_sibling     : <0x72c>
 <2><71c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <71d>   DW_AT_type        : <0x2a3>
 <2><721>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <722>   DW_AT_type        : <0x549>
 <2><726>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <727>   DW_AT_type        : <0x44>
 <2><72b>: Abbrev Number: 0
 <1><72c>: Abbrev Number: 32 (DW_TAG_subprogram)
    <72d>   DW_AT_external    : 1
    <72d>   DW_AT_name        : (indirect string, offset: 0x6ce56): Check_SD_Space
    <731>   DW_AT_decl_file   : 1
    <732>   DW_AT_decl_line   : 277
    <734>   DW_AT_decl_column : 6
    <735>   DW_AT_prototyped  : 1
    <735>   DW_AT_low_pc      : 0x8000fa4
    <739>   DW_AT_high_pc     : 0xa4
    <73d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <73f>   DW_AT_call_all_tail_calls: 1
    <73f>   DW_AT_sibling     : <0x75e>
 <2><743>: Abbrev Number: 21 (DW_TAG_variable)
    <744>   DW_AT_name        : (indirect string, offset: 0xd5ef): total
    <748>   DW_AT_decl_file   : 1
    <748>   DW_AT_decl_line   : 279
    <748>   DW_AT_decl_column : 11
    <749>   DW_AT_type        : <0xac>
    <74d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><750>: Abbrev Number: 21 (DW_TAG_variable)
    <751>   DW_AT_name        : (indirect string, offset: 0x8d81b): free_space
    <755>   DW_AT_decl_file   : 1
    <755>   DW_AT_decl_line   : 279
    <755>   DW_AT_decl_column : 18
    <756>   DW_AT_type        : <0xac>
    <75a>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><75d>: Abbrev Number: 0
 <1><75e>: Abbrev Number: 33 (DW_TAG_subprogram)
    <75f>   DW_AT_external    : 1
    <75f>   DW_AT_name        : (indirect string, offset: 0x5c473): Create_Dir
    <763>   DW_AT_decl_file   : 1
    <764>   DW_AT_decl_line   : 263
    <766>   DW_AT_decl_column : 9
    <767>   DW_AT_prototyped  : 1
    <767>   DW_AT_type        : <0x499>
    <76b>   DW_AT_low_pc      : 0
    <76f>   DW_AT_high_pc     : 0x60
    <773>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <775>   DW_AT_call_all_tail_calls: 1
    <775>   DW_AT_sibling     : <0x78a>
 <2><779>: Abbrev Number: 34 (DW_TAG_formal_parameter)
    <77a>   DW_AT_name        : (indirect string, offset: 0x1ca3e): name
    <77e>   DW_AT_decl_file   : 1
    <77f>   DW_AT_decl_line   : 263
    <781>   DW_AT_decl_column : 26
    <782>   DW_AT_type        : <0xcd>
    <786>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><789>: Abbrev Number: 0
 <1><78a>: Abbrev Number: 11 (DW_TAG_subprogram)
    <78b>   DW_AT_external    : 1
    <78b>   DW_AT_name        : (indirect string, offset: 0x4e0ed): Remove_File
    <78f>   DW_AT_decl_file   : 1
    <78f>   DW_AT_decl_line   : 239
    <790>   DW_AT_decl_column : 9
    <790>   DW_AT_prototyped  : 1
    <790>   DW_AT_type        : <0x499>
    <794>   DW_AT_low_pc      : 0
    <798>   DW_AT_high_pc     : 0xa0
    <79c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <79e>   DW_AT_call_all_tail_calls: 1
    <79e>   DW_AT_sibling     : <0x7b1>
 <2><7a2>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <7a3>   DW_AT_name        : (indirect string, offset: 0x1ca3e): name
    <7a7>   DW_AT_decl_file   : 1
    <7a7>   DW_AT_decl_line   : 239
    <7a8>   DW_AT_decl_column : 27
    <7a9>   DW_AT_type        : <0xcd>
    <7ad>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7b0>: Abbrev Number: 0
 <1><7b1>: Abbrev Number: 11 (DW_TAG_subprogram)
    <7b2>   DW_AT_external    : 1
    <7b2>   DW_AT_name        : (indirect string, offset: 0x693f): Read_File
    <7b6>   DW_AT_decl_file   : 1
    <7b6>   DW_AT_decl_line   : 193
    <7b7>   DW_AT_decl_column : 9
    <7b7>   DW_AT_prototyped  : 1
    <7b7>   DW_AT_type        : <0x499>
    <7bb>   DW_AT_low_pc      : 0
    <7bf>   DW_AT_high_pc     : 0x13c
    <7c3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7c5>   DW_AT_call_all_tail_calls: 1
    <7c5>   DW_AT_sibling     : <0x7f0>
 <2><7c9>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <7ca>   DW_AT_name        : (indirect string, offset: 0x1ca3e): name
    <7ce>   DW_AT_decl_file   : 1
    <7ce>   DW_AT_decl_line   : 193
    <7cf>   DW_AT_decl_column : 25
    <7d0>   DW_AT_type        : <0xcd>
    <7d4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7d7>: Abbrev Number: 35 (DW_TAG_lexical_block)
    <7d8>   DW_AT_low_pc      : 0
    <7dc>   DW_AT_high_pc     : 0xc6
 <3><7e0>: Abbrev Number: 22 (DW_TAG_variable)
    <7e1>   DW_AT_name        : (indirect string, offset: 0xf72e1): buffer
    <7e5>   DW_AT_decl_file   : 1
    <7e5>   DW_AT_decl_line   : 209
    <7e6>   DW_AT_decl_column : 9
    <7e7>   DW_AT_type        : <0xcd>
    <7eb>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><7ee>: Abbrev Number: 0
 <2><7ef>: Abbrev Number: 0
 <1><7f0>: Abbrev Number: 11 (DW_TAG_subprogram)
    <7f1>   DW_AT_external    : 1
    <7f1>   DW_AT_name        : (indirect string, offset: 0xbb7d0): Write_File
    <7f5>   DW_AT_decl_file   : 1
    <7f5>   DW_AT_decl_line   : 154
    <7f6>   DW_AT_decl_column : 9
    <7f6>   DW_AT_prototyped  : 1
    <7f6>   DW_AT_type        : <0x499>
    <7fa>   DW_AT_low_pc      : 0
    <7fe>   DW_AT_high_pc     : 0x120
    <802>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <804>   DW_AT_call_all_tail_calls: 1
    <804>   DW_AT_sibling     : <0x825>
 <2><808>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <809>   DW_AT_name        : (indirect string, offset: 0x1ca3e): name
    <80d>   DW_AT_decl_file   : 1
    <80d>   DW_AT_decl_line   : 154
    <80e>   DW_AT_decl_column : 26
    <80f>   DW_AT_type        : <0xcd>
    <813>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><816>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <817>   DW_AT_name        : (indirect string, offset: 0xfe25b): data
    <81b>   DW_AT_decl_file   : 1
    <81b>   DW_AT_decl_line   : 154
    <81c>   DW_AT_decl_column : 38
    <81d>   DW_AT_type        : <0xcd>
    <821>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><824>: Abbrev Number: 0
 <1><825>: Abbrev Number: 11 (DW_TAG_subprogram)
    <826>   DW_AT_external    : 1
    <826>   DW_AT_name        : (indirect string, offset: 0x51f97): Update_File
    <82a>   DW_AT_decl_file   : 1
    <82a>   DW_AT_decl_line   : 115
    <82b>   DW_AT_decl_column : 9
    <82b>   DW_AT_prototyped  : 1
    <82b>   DW_AT_type        : <0x499>
    <82f>   DW_AT_low_pc      : 0x8000e78
    <833>   DW_AT_high_pc     : 0x12c
    <837>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <839>   DW_AT_call_all_tail_calls: 1
    <839>   DW_AT_sibling     : <0x85a>
 <2><83d>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <83e>   DW_AT_name        : (indirect string, offset: 0x1ca3e): name
    <842>   DW_AT_decl_file   : 1
    <842>   DW_AT_decl_line   : 115
    <843>   DW_AT_decl_column : 27
    <844>   DW_AT_type        : <0xcd>
    <848>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><84b>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <84c>   DW_AT_name        : (indirect string, offset: 0xfe25b): data
    <850>   DW_AT_decl_file   : 1
    <850>   DW_AT_decl_line   : 115
    <851>   DW_AT_decl_column : 39
    <852>   DW_AT_type        : <0xcd>
    <856>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><859>: Abbrev Number: 0
 <1><85a>: Abbrev Number: 11 (DW_TAG_subprogram)
    <85b>   DW_AT_external    : 1
    <85b>   DW_AT_name        : (indirect string, offset: 0x6dfcc): Create_File
    <85f>   DW_AT_decl_file   : 1
    <85f>   DW_AT_decl_line   : 84
    <860>   DW_AT_decl_column : 9
    <860>   DW_AT_prototyped  : 1
    <860>   DW_AT_type        : <0x499>
    <864>   DW_AT_low_pc      : 0x8000da8
    <868>   DW_AT_high_pc     : 0xd0
    <86c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <86e>   DW_AT_call_all_tail_calls: 1
    <86e>   DW_AT_sibling     : <0x881>
 <2><872>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <873>   DW_AT_name        : (indirect string, offset: 0x1ca3e): name
    <877>   DW_AT_decl_file   : 1
    <877>   DW_AT_decl_line   : 84
    <878>   DW_AT_decl_column : 27
    <879>   DW_AT_type        : <0xcd>
    <87d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><880>: Abbrev Number: 0
 <1><881>: Abbrev Number: 11 (DW_TAG_subprogram)
    <882>   DW_AT_external    : 1
    <882>   DW_AT_name        : (indirect string, offset: 0xdcb38): Format_SD
    <886>   DW_AT_decl_file   : 1
    <886>   DW_AT_decl_line   : 46
    <887>   DW_AT_decl_column : 9
    <887>   DW_AT_prototyped  : 1
    <887>   DW_AT_type        : <0x499>
    <88b>   DW_AT_low_pc      : 0x8000ccc
    <88f>   DW_AT_high_pc     : 0xdc
    <893>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <895>   DW_AT_call_all_tail_calls: 1
    <895>   DW_AT_sibling     : <0x8b7>
 <2><899>: Abbrev Number: 36 (DW_TAG_variable)
    <89a>   DW_AT_name        : dir
    <89e>   DW_AT_decl_file   : 1
    <89f>   DW_AT_decl_line   : 48
    <8a0>   DW_AT_decl_column : 9
    <8a1>   DW_AT_type        : <0x3a8>
    <8a5>   DW_AT_location    : 2 byte block: 91 44 	(DW_OP_fbreg: -60)
 <2><8a8>: Abbrev Number: 22 (DW_TAG_variable)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xfe0d0): path
    <8ad>   DW_AT_decl_file   : 1
    <8ad>   DW_AT_decl_line   : 49
    <8ae>   DW_AT_decl_column : 11
    <8af>   DW_AT_type        : <0xcd>
    <8b3>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8b6>: Abbrev Number: 0
 <1><8b7>: Abbrev Number: 37 (DW_TAG_subprogram)
    <8b8>   DW_AT_external    : 1
    <8b8>   DW_AT_name        : (indirect string, offset: 0x5c7f3): Unmount_SD
    <8bc>   DW_AT_decl_file   : 1
    <8bd>   DW_AT_decl_line   : 31
    <8be>   DW_AT_decl_column : 6
    <8bf>   DW_AT_prototyped  : 1
    <8bf>   DW_AT_low_pc      : 0x8000c74
    <8c3>   DW_AT_high_pc     : 0x58
    <8c7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8c9>   DW_AT_call_all_tail_calls: 1
    <8c9>   DW_AT_sibling     : <0x8dc>
 <2><8cd>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <8ce>   DW_AT_name        : (indirect string, offset: 0xfe0d0): path
    <8d2>   DW_AT_decl_file   : 1
    <8d2>   DW_AT_decl_line   : 31
    <8d3>   DW_AT_decl_column : 30
    <8d4>   DW_AT_type        : <0x549>
    <8d8>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8db>: Abbrev Number: 0
 <1><8dc>: Abbrev Number: 38 (DW_TAG_subprogram)
    <8dd>   DW_AT_external    : 1
    <8dd>   DW_AT_name        : (indirect string, offset: 0xa75b9): Mount_SD
    <8e1>   DW_AT_decl_file   : 1
    <8e2>   DW_AT_decl_line   : 16
    <8e3>   DW_AT_decl_column : 6
    <8e4>   DW_AT_prototyped  : 1
    <8e4>   DW_AT_low_pc      : 0x8000c18
    <8e8>   DW_AT_high_pc     : 0x5c
    <8ec>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8ee>   DW_AT_call_all_tail_calls: 1
 <2><8ee>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <8ef>   DW_AT_name        : (indirect string, offset: 0xfe0d0): path
    <8f3>   DW_AT_decl_file   : 1
    <8f3>   DW_AT_decl_line   : 16
    <8f4>   DW_AT_decl_column : 28
    <8f5>   DW_AT_type        : <0x549>
    <8f9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8fc>: Abbrev Number: 0
 <1><8fd>: Abbrev Number: 0
  Compilation Unit @ offset 0x8fe:
   Length:        0x915 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x269
   Pointer Size:  4
 <0><90a>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <90b>   DW_AT_producer    : (indirect string, offset: 0x7022f): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <90f>   DW_AT_language    : 29	(C11)
    <910>   DW_AT_name        : (indirect string, offset: 0xf6ac3): ../Core/Src/freertos.c
    <914>   DW_AT_comp_dir    : (indirect string, offset: 0x353b9): C:/Users/Bazar/Desktop/My-STM32_Discoveries/STM32F746_Discovery/STM32F746Discovery_VCP_SDcard_DMA_FreeRTOS/VCP_SDcard_DMA_FreeRTOS/Debug
    <918>   DW_AT_ranges      : 0x5c
    <91c>   DW_AT_low_pc      : 0
    <920>   DW_AT_stmt_list   : 0xf09
    <924>   DW_AT_macros      : 0x25f1c
 <1><928>: Abbrev Number: 20 (DW_TAG_base_type)
    <929>   DW_AT_byte_size   : 4
    <92a>   DW_AT_encoding    : 5	(signed)
    <92b>   DW_AT_name        : int
 <1><92f>: Abbrev Number: 6 (DW_TAG_base_type)
    <930>   DW_AT_byte_size   : 4
    <931>   DW_AT_encoding    : 7	(unsigned)
    <932>   DW_AT_name        : (indirect string, offset: 0x140ec): unsigned int
 <1><936>: Abbrev Number: 6 (DW_TAG_base_type)
    <937>   DW_AT_byte_size   : 8
    <938>   DW_AT_encoding    : 5	(signed)
    <939>   DW_AT_name        : (indirect string, offset: 0x6fc4c): long long int
 <1><93d>: Abbrev Number: 6 (DW_TAG_base_type)
    <93e>   DW_AT_byte_size   : 8
    <93f>   DW_AT_encoding    : 4	(float)
    <940>   DW_AT_name        : (indirect string, offset: 0x16b6a): long double
 <1><944>: Abbrev Number: 6 (DW_TAG_base_type)
    <945>   DW_AT_byte_size   : 1
    <946>   DW_AT_encoding    : 6	(signed char)
    <947>   DW_AT_name        : (indirect string, offset: 0x7ac23): signed char
 <1><94b>: Abbrev Number: 5 (DW_TAG_typedef)
    <94c>   DW_AT_name        : (indirect string, offset: 0xf67a4): __uint8_t
    <950>   DW_AT_decl_file   : 2
    <951>   DW_AT_decl_line   : 43
    <952>   DW_AT_decl_column : 24
    <953>   DW_AT_type        : <0x957>
 <1><957>: Abbrev Number: 6 (DW_TAG_base_type)
    <958>   DW_AT_byte_size   : 1
    <959>   DW_AT_encoding    : 8	(unsigned char)
    <95a>   DW_AT_name        : (indirect string, offset: 0xece1a): unsigned char
 <1><95e>: Abbrev Number: 6 (DW_TAG_base_type)
    <95f>   DW_AT_byte_size   : 2
    <960>   DW_AT_encoding    : 5	(signed)
    <961>   DW_AT_name        : (indirect string, offset: 0xb79bc): short int
 <1><965>: Abbrev Number: 5 (DW_TAG_typedef)
    <966>   DW_AT_name        : (indirect string, offset: 0xf69fd): __uint16_t
    <96a>   DW_AT_decl_file   : 2
    <96b>   DW_AT_decl_line   : 57
    <96c>   DW_AT_decl_column : 25
    <96d>   DW_AT_type        : <0x971>
 <1><971>: Abbrev Number: 6 (DW_TAG_base_type)
    <972>   DW_AT_byte_size   : 2
    <973>   DW_AT_encoding    : 7	(unsigned)
    <974>   DW_AT_name        : (indirect string, offset: 0xeb460): short unsigned int
 <1><978>: Abbrev Number: 6 (DW_TAG_base_type)
    <979>   DW_AT_byte_size   : 4
    <97a>   DW_AT_encoding    : 5	(signed)
    <97b>   DW_AT_name        : (indirect string, offset: 0x14de2): long int
 <1><97f>: Abbrev Number: 5 (DW_TAG_typedef)
    <980>   DW_AT_name        : (indirect string, offset: 0x9ccdb): __uint32_t
    <984>   DW_AT_decl_file   : 2
    <985>   DW_AT_decl_line   : 79
    <986>   DW_AT_decl_column : 25
    <987>   DW_AT_type        : <0x98b>
 <1><98b>: Abbrev Number: 6 (DW_TAG_base_type)
    <98c>   DW_AT_byte_size   : 4
    <98d>   DW_AT_encoding    : 7	(unsigned)
    <98e>   DW_AT_name        : (indirect string, offset: 0x5dbc4): long unsigned int
 <1><992>: Abbrev Number: 6 (DW_TAG_base_type)
    <993>   DW_AT_byte_size   : 8
    <994>   DW_AT_encoding    : 7	(unsigned)
    <995>   DW_AT_name        : (indirect string, offset: 0x3373f): long long unsigned int
 <1><999>: Abbrev Number: 5 (DW_TAG_typedef)
    <99a>   DW_AT_name        : (indirect string, offset: 0xf67a6): uint8_t
    <99e>   DW_AT_decl_file   : 3
    <99f>   DW_AT_decl_line   : 24
    <9a0>   DW_AT_decl_column : 19
    <9a1>   DW_AT_type        : <0x94b>
 <1><9a5>: Abbrev Number: 5 (DW_TAG_typedef)
    <9a6>   DW_AT_name        : (indirect string, offset: 0xb4647): uint16_t
    <9aa>   DW_AT_decl_file   : 3
    <9ab>   DW_AT_decl_line   : 36
    <9ac>   DW_AT_decl_column : 20
    <9ad>   DW_AT_type        : <0x965>
 <1><9b1>: Abbrev Number: 5 (DW_TAG_typedef)
    <9b2>   DW_AT_name        : (indirect string, offset: 0xeb0bb): uint32_t
    <9b6>   DW_AT_decl_file   : 3
    <9b7>   DW_AT_decl_line   : 48
    <9b8>   DW_AT_decl_column : 20
    <9b9>   DW_AT_type        : <0x97f>
 <1><9bd>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <9be>   DW_AT_byte_size   : 4
 <1><9bf>: Abbrev Number: 5 (DW_TAG_typedef)
    <9c0>   DW_AT_name        : (indirect string, offset: 0xf697a): StackType_t
    <9c4>   DW_AT_decl_file   : 4
    <9c5>   DW_AT_decl_line   : 55
    <9c6>   DW_AT_decl_column : 24
    <9c7>   DW_AT_type        : <0x9b1>
 <1><9cb>: Abbrev Number: 5 (DW_TAG_typedef)
    <9cc>   DW_AT_name        : (indirect string, offset: 0xf66d7): UBaseType_t
    <9d0>   DW_AT_decl_file   : 4
    <9d1>   DW_AT_decl_line   : 57
    <9d2>   DW_AT_decl_column : 23
    <9d3>   DW_AT_type        : <0x98b>
 <1><9d7>: Abbrev Number: 5 (DW_TAG_typedef)
    <9d8>   DW_AT_name        : (indirect string, offset: 0x2faeb): TickType_t
    <9dc>   DW_AT_decl_file   : 4
    <9dd>   DW_AT_decl_line   : 63
    <9de>   DW_AT_decl_column : 19
    <9df>   DW_AT_type        : <0x9b1>
 <1><9e3>: Abbrev Number: 11 (DW_TAG_typedef)
    <9e4>   DW_AT_name        : (indirect string, offset: 0xf5529): wint_t
    <9e8>   DW_AT_decl_file   : 5
    <9e9>   DW_AT_decl_line   : 359
    <9eb>   DW_AT_decl_column : 23
    <9ec>   DW_AT_type        : <0x92f>
 <1><9f0>: Abbrev Number: 5 (DW_TAG_typedef)
    <9f1>   DW_AT_name        : (indirect string, offset: 0xf91c7): _off_t
    <9f5>   DW_AT_decl_file   : 6
    <9f6>   DW_AT_decl_line   : 46
    <9f7>   DW_AT_decl_column : 14
    <9f8>   DW_AT_type        : <0x978>
 <1><9fc>: Abbrev Number: 5 (DW_TAG_typedef)
    <9fd>   DW_AT_name        : (indirect string, offset: 0xf6753): _fpos_t
    <a01>   DW_AT_decl_file   : 6
    <a02>   DW_AT_decl_line   : 116
    <a03>   DW_AT_decl_column : 14
    <a04>   DW_AT_type        : <0x978>
 <1><a08>: Abbrev Number: 22 (DW_TAG_union_type)
    <a09>   DW_AT_byte_size   : 4
    <a0a>   DW_AT_decl_file   : 6
    <a0b>   DW_AT_decl_line   : 165
    <a0c>   DW_AT_decl_column : 3
    <a0d>   DW_AT_sibling     : <0xa28>
 <2><a11>: Abbrev Number: 15 (DW_TAG_member)
    <a12>   DW_AT_name        : (indirect string, offset: 0xf69ca): __wch
    <a16>   DW_AT_decl_file   : 6
    <a16>   DW_AT_decl_line   : 167
    <a17>   DW_AT_decl_column : 12
    <a18>   DW_AT_type        : <0x9e3>
 <2><a1c>: Abbrev Number: 15 (DW_TAG_member)
    <a1d>   DW_AT_name        : (indirect string, offset: 0xf688c): __wchb
    <a21>   DW_AT_decl_file   : 6
    <a21>   DW_AT_decl_line   : 168
    <a22>   DW_AT_decl_column : 19
    <a23>   DW_AT_type        : <0xa28>
 <2><a27>: Abbrev Number: 0
 <1><a28>: Abbrev Number: 7 (DW_TAG_array_type)
    <a29>   DW_AT_type        : <0x957>
    <a2d>   DW_AT_sibling     : <0xa38>
 <2><a31>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <a32>   DW_AT_type        : <0x92f>
    <a36>   DW_AT_upper_bound : 3
 <2><a37>: Abbrev Number: 0
 <1><a38>: Abbrev Number: 23 (DW_TAG_structure_type)
    <a39>   DW_AT_byte_size   : 8
    <a3a>   DW_AT_decl_file   : 6
    <a3b>   DW_AT_decl_line   : 162
    <a3c>   DW_AT_decl_column : 9
    <a3d>   DW_AT_sibling     : <0xa5c>
 <2><a41>: Abbrev Number: 2 (DW_TAG_member)
    <a42>   DW_AT_name        : (indirect string, offset: 0xf678b): __count
    <a46>   DW_AT_decl_file   : 6
    <a47>   DW_AT_decl_line   : 164
    <a48>   DW_AT_decl_column : 7
    <a49>   DW_AT_type        : <0x928>
    <a4d>   DW_AT_data_member_location: 0
 <2><a4e>: Abbrev Number: 2 (DW_TAG_member)
    <a4f>   DW_AT_name        : (indirect string, offset: 0xf672d): __value
    <a53>   DW_AT_decl_file   : 6
    <a54>   DW_AT_decl_line   : 169
    <a55>   DW_AT_decl_column : 5
    <a56>   DW_AT_type        : <0xa08>
    <a5a>   DW_AT_data_member_location: 4
 <2><a5b>: Abbrev Number: 0
 <1><a5c>: Abbrev Number: 5 (DW_TAG_typedef)
    <a5d>   DW_AT_name        : (indirect string, offset: 0xf6893): _mbstate_t
    <a61>   DW_AT_decl_file   : 6
    <a62>   DW_AT_decl_line   : 170
    <a63>   DW_AT_decl_column : 3
    <a64>   DW_AT_type        : <0xa38>
 <1><a68>: Abbrev Number: 5 (DW_TAG_typedef)
    <a69>   DW_AT_name        : (indirect string, offset: 0xf68be): __ULong
    <a6d>   DW_AT_decl_file   : 7
    <a6e>   DW_AT_decl_line   : 23
    <a6f>   DW_AT_decl_column : 25
    <a70>   DW_AT_type        : <0x98b>
 <1><a74>: Abbrev Number: 5 (DW_TAG_typedef)
    <a75>   DW_AT_name        : (indirect string, offset: 0x87227): _LOCK_T
    <a79>   DW_AT_decl_file   : 8
    <a7a>   DW_AT_decl_line   : 34
    <a7b>   DW_AT_decl_column : 25
    <a7c>   DW_AT_type        : <0xa80>
 <1><a80>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <a81>   DW_AT_byte_size   : 4
    <a81>   DW_AT_type        : <0xa85>
 <1><a85>: Abbrev Number: 16 (DW_TAG_structure_type)
    <a86>   DW_AT_name        : (indirect string, offset: 0xf66f2): __lock
    <a8a>   DW_AT_declaration : 1
 <1><a8a>: Abbrev Number: 5 (DW_TAG_typedef)
    <a8b>   DW_AT_name        : (indirect string, offset: 0xf687c): _flock_t
    <a8f>   DW_AT_decl_file   : 7
    <a90>   DW_AT_decl_line   : 36
    <a91>   DW_AT_decl_column : 27
    <a92>   DW_AT_type        : <0xa74>
 <1><a96>: Abbrev Number: 12 (DW_TAG_structure_type)
    <a97>   DW_AT_name        : (indirect string, offset: 0xf67d7): _Bigint
    <a9b>   DW_AT_byte_size   : 24
    <a9c>   DW_AT_decl_file   : 7
    <a9c>   DW_AT_decl_line   : 53
    <a9d>   DW_AT_decl_column : 8
    <a9d>   DW_AT_sibling     : <0xaec>
 <2><aa1>: Abbrev Number: 2 (DW_TAG_member)
    <aa2>   DW_AT_name        : (indirect string, offset: 0xf6906): _next
    <aa6>   DW_AT_decl_file   : 7
    <aa7>   DW_AT_decl_line   : 55
    <aa8>   DW_AT_decl_column : 19
    <aa9>   DW_AT_type        : <0xaec>
    <aad>   DW_AT_data_member_location: 0
 <2><aae>: Abbrev Number: 9 (DW_TAG_member)
    <aaf>   DW_AT_name        : _k
    <ab2>   DW_AT_decl_file   : 7
    <ab2>   DW_AT_decl_line   : 56
    <ab3>   DW_AT_decl_column : 7
    <ab4>   DW_AT_type        : <0x928>
    <ab8>   DW_AT_data_member_location: 4
 <2><ab9>: Abbrev Number: 2 (DW_TAG_member)
    <aba>   DW_AT_name        : (indirect string, offset: 0xf6972): _maxwds
    <abe>   DW_AT_decl_file   : 7
    <abf>   DW_AT_decl_line   : 56
    <ac0>   DW_AT_decl_column : 11
    <ac1>   DW_AT_type        : <0x928>
    <ac5>   DW_AT_data_member_location: 8
 <2><ac6>: Abbrev Number: 2 (DW_TAG_member)
    <ac7>   DW_AT_name        : (indirect string, offset: 0xf68b8): _sign
    <acb>   DW_AT_decl_file   : 7
    <acc>   DW_AT_decl_line   : 56
    <acd>   DW_AT_decl_column : 20
    <ace>   DW_AT_type        : <0x928>
    <ad2>   DW_AT_data_member_location: 12
 <2><ad3>: Abbrev Number: 2 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0xf68b3): _wds
    <ad8>   DW_AT_decl_file   : 7
    <ad9>   DW_AT_decl_line   : 56
    <ada>   DW_AT_decl_column : 27
    <adb>   DW_AT_type        : <0x928>
    <adf>   DW_AT_data_member_location: 16
 <2><ae0>: Abbrev Number: 9 (DW_TAG_member)
    <ae1>   DW_AT_name        : _x
    <ae4>   DW_AT_decl_file   : 7
    <ae4>   DW_AT_decl_line   : 57
    <ae5>   DW_AT_decl_column : 11
    <ae6>   DW_AT_type        : <0xaf1>
    <aea>   DW_AT_data_member_location: 20
 <2><aeb>: Abbrev Number: 0
 <1><aec>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <aed>   DW_AT_byte_size   : 4
    <aed>   DW_AT_type        : <0xa96>
 <1><af1>: Abbrev Number: 7 (DW_TAG_array_type)
    <af2>   DW_AT_type        : <0xa68>
    <af6>   DW_AT_sibling     : <0xb01>
 <2><afa>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <afb>   DW_AT_type        : <0x92f>
    <aff>   DW_AT_upper_bound : 0
 <2><b00>: Abbrev Number: 0
 <1><b01>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b02>   DW_AT_name        : (indirect string, offset: 0xf6786): __tm
    <b06>   DW_AT_byte_size   : 36
    <b07>   DW_AT_decl_file   : 7
    <b07>   DW_AT_decl_line   : 61
    <b08>   DW_AT_decl_column : 8
    <b08>   DW_AT_sibling     : <0xb82>
 <2><b0c>: Abbrev Number: 2 (DW_TAG_member)
    <b0d>   DW_AT_name        : (indirect string, offset: 0xf6a08): __tm_sec
    <b11>   DW_AT_decl_file   : 7
    <b12>   DW_AT_decl_line   : 63
    <b13>   DW_AT_decl_column : 9
    <b14>   DW_AT_type        : <0x928>
    <b18>   DW_AT_data_member_location: 0
 <2><b19>: Abbrev Number: 2 (DW_TAG_member)
    <b1a>   DW_AT_name        : (indirect string, offset: 0xf66ce): __tm_min
    <b1e>   DW_AT_decl_file   : 7
    <b1f>   DW_AT_decl_line   : 64
    <b20>   DW_AT_decl_column : 9
    <b21>   DW_AT_type        : <0x928>
    <b25>   DW_AT_data_member_location: 4
 <2><b26>: Abbrev Number: 2 (DW_TAG_member)
    <b27>   DW_AT_name        : (indirect string, offset: 0xf673f): __tm_hour
    <b2b>   DW_AT_decl_file   : 7
    <b2c>   DW_AT_decl_line   : 65
    <b2d>   DW_AT_decl_column : 9
    <b2e>   DW_AT_type        : <0x928>
    <b32>   DW_AT_data_member_location: 8
 <2><b33>: Abbrev Number: 2 (DW_TAG_member)
    <b34>   DW_AT_name        : (indirect string, offset: 0xf68f7): __tm_mday
    <b38>   DW_AT_decl_file   : 7
    <b39>   DW_AT_decl_line   : 66
    <b3a>   DW_AT_decl_column : 9
    <b3b>   DW_AT_type        : <0x928>
    <b3f>   DW_AT_data_member_location: 12
 <2><b40>: Abbrev Number: 2 (DW_TAG_member)
    <b41>   DW_AT_name        : (indirect string, offset: 0xf699c): __tm_mon
    <b45>   DW_AT_decl_file   : 7
    <b46>   DW_AT_decl_line   : 67
    <b47>   DW_AT_decl_column : 9
    <b48>   DW_AT_type        : <0x928>
    <b4c>   DW_AT_data_member_location: 16
 <2><b4d>: Abbrev Number: 2 (DW_TAG_member)
    <b4e>   DW_AT_name        : (indirect string, offset: 0xf690c): __tm_year
    <b52>   DW_AT_decl_file   : 7
    <b53>   DW_AT_decl_line   : 68
    <b54>   DW_AT_decl_column : 9
    <b55>   DW_AT_type        : <0x928>
    <b59>   DW_AT_data_member_location: 20
 <2><b5a>: Abbrev Number: 2 (DW_TAG_member)
    <b5b>   DW_AT_name        : (indirect string, offset: 0xf6803): __tm_wday
    <b5f>   DW_AT_decl_file   : 7
    <b60>   DW_AT_decl_line   : 69
    <b61>   DW_AT_decl_column : 9
    <b62>   DW_AT_type        : <0x928>
    <b66>   DW_AT_data_member_location: 24
 <2><b67>: Abbrev Number: 2 (DW_TAG_member)
    <b68>   DW_AT_name        : (indirect string, offset: 0xf69db): __tm_yday
    <b6c>   DW_AT_decl_file   : 7
    <b6d>   DW_AT_decl_line   : 70
    <b6e>   DW_AT_decl_column : 9
    <b6f>   DW_AT_type        : <0x928>
    <b73>   DW_AT_data_member_location: 28
 <2><b74>: Abbrev Number: 2 (DW_TAG_member)
    <b75>   DW_AT_name        : (indirect string, offset: 0xf6a4d): __tm_isdst
    <b79>   DW_AT_decl_file   : 7
    <b7a>   DW_AT_decl_line   : 71
    <b7b>   DW_AT_decl_column : 9
    <b7c>   DW_AT_type        : <0x928>
    <b80>   DW_AT_data_member_location: 32
 <2><b81>: Abbrev Number: 0
 <1><b82>: Abbrev Number: 12 (DW_TAG_structure_type)
    <b83>   DW_AT_name        : (indirect string, offset: 0xf6931): __sbuf
    <b87>   DW_AT_byte_size   : 8
    <b88>   DW_AT_decl_file   : 7
    <b88>   DW_AT_decl_line   : 116
    <b89>   DW_AT_decl_column : 8
    <b89>   DW_AT_sibling     : <0xba8>
 <2><b8d>: Abbrev Number: 2 (DW_TAG_member)
    <b8e>   DW_AT_name        : (indirect string, offset: 0xf6ada): _base
    <b92>   DW_AT_decl_file   : 7
    <b93>   DW_AT_decl_line   : 117
    <b94>   DW_AT_decl_column : 17
    <b95>   DW_AT_type        : <0xba8>
    <b99>   DW_AT_data_member_location: 0
 <2><b9a>: Abbrev Number: 2 (DW_TAG_member)
    <b9b>   DW_AT_name        : (indirect string, offset: 0xf8a41): _size
    <b9f>   DW_AT_decl_file   : 7
    <ba0>   DW_AT_decl_line   : 118
    <ba1>   DW_AT_decl_column : 6
    <ba2>   DW_AT_type        : <0x928>
    <ba6>   DW_AT_data_member_location: 4
 <2><ba7>: Abbrev Number: 0
 <1><ba8>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <ba9>   DW_AT_byte_size   : 4
    <ba9>   DW_AT_type        : <0x957>
 <1><bad>: Abbrev Number: 12 (DW_TAG_structure_type)
    <bae>   DW_AT_name        : (indirect string, offset: 0xf69c2): __sFILE
    <bb2>   DW_AT_byte_size   : 104
    <bb3>   DW_AT_decl_file   : 7
    <bb3>   DW_AT_decl_line   : 153
    <bb4>   DW_AT_decl_column : 8
    <bb4>   DW_AT_sibling     : <0xce6>
 <2><bb8>: Abbrev Number: 9 (DW_TAG_member)
    <bb9>   DW_AT_name        : _p
    <bbc>   DW_AT_decl_file   : 7
    <bbc>   DW_AT_decl_line   : 154
    <bbd>   DW_AT_decl_column : 18
    <bbe>   DW_AT_type        : <0xba8>
    <bc2>   DW_AT_data_member_location: 0
 <2><bc3>: Abbrev Number: 9 (DW_TAG_member)
    <bc4>   DW_AT_name        : _r
    <bc7>   DW_AT_decl_file   : 7
    <bc7>   DW_AT_decl_line   : 155
    <bc8>   DW_AT_decl_column : 7
    <bc9>   DW_AT_type        : <0x928>
    <bcd>   DW_AT_data_member_location: 4
 <2><bce>: Abbrev Number: 9 (DW_TAG_member)
    <bcf>   DW_AT_name        : _w
    <bd2>   DW_AT_decl_file   : 7
    <bd2>   DW_AT_decl_line   : 156
    <bd3>   DW_AT_decl_column : 7
    <bd4>   DW_AT_type        : <0x928>
    <bd8>   DW_AT_data_member_location: 8
 <2><bd9>: Abbrev Number: 2 (DW_TAG_member)
    <bda>   DW_AT_name        : (indirect string, offset: 0xf682b): _flags
    <bde>   DW_AT_decl_file   : 7
    <bdf>   DW_AT_decl_line   : 157
    <be0>   DW_AT_decl_column : 9
    <be1>   DW_AT_type        : <0x95e>
    <be5>   DW_AT_data_member_location: 12
 <2><be6>: Abbrev Number: 2 (DW_TAG_member)
    <be7>   DW_AT_name        : (indirect string, offset: 0xf670c): _file
    <beb>   DW_AT_decl_file   : 7
    <bec>   DW_AT_decl_line   : 158
    <bed>   DW_AT_decl_column : 9
    <bee>   DW_AT_type        : <0x95e>
    <bf2>   DW_AT_data_member_location: 14
 <2><bf3>: Abbrev Number: 9 (DW_TAG_member)
    <bf4>   DW_AT_name        : _bf
    <bf8>   DW_AT_decl_file   : 7
    <bf8>   DW_AT_decl_line   : 159
    <bf9>   DW_AT_decl_column : 17
    <bfa>   DW_AT_type        : <0xb82>
    <bfe>   DW_AT_data_member_location: 16
 <2><bff>: Abbrev Number: 2 (DW_TAG_member)
    <c00>   DW_AT_name        : (indirect string, offset: 0xf6832): _lbfsize
    <c04>   DW_AT_decl_file   : 7
    <c05>   DW_AT_decl_line   : 160
    <c06>   DW_AT_decl_column : 7
    <c07>   DW_AT_type        : <0x928>
    <c0b>   DW_AT_data_member_location: 24
 <2><c0c>: Abbrev Number: 2 (DW_TAG_member)
    <c0d>   DW_AT_name        : (indirect string, offset: 0xfe25a): _data
    <c11>   DW_AT_decl_file   : 7
    <c12>   DW_AT_decl_line   : 163
    <c13>   DW_AT_decl_column : 18
    <c14>   DW_AT_type        : <0xdff>
    <c18>   DW_AT_data_member_location: 28
 <2><c19>: Abbrev Number: 2 (DW_TAG_member)
    <c1a>   DW_AT_name        : (indirect string, offset: 0xf6a45): _cookie
    <c1e>   DW_AT_decl_file   : 7
    <c1f>   DW_AT_decl_line   : 167
    <c20>   DW_AT_decl_column : 10
    <c21>   DW_AT_type        : <0x9bd>
    <c25>   DW_AT_data_member_location: 32
 <2><c26>: Abbrev Number: 2 (DW_TAG_member)
    <c27>   DW_AT_name        : (indirect string, offset: 0xfdf19): _read
    <c2b>   DW_AT_decl_file   : 7
    <c2c>   DW_AT_decl_line   : 169
    <c2d>   DW_AT_decl_column : 29
    <c2e>   DW_AT_type        : <0xe33>
    <c32>   DW_AT_data_member_location: 36
 <2><c33>: Abbrev Number: 2 (DW_TAG_member)
    <c34>   DW_AT_name        : (indirect string, offset: 0xfdfe8): _write
    <c38>   DW_AT_decl_file   : 7
    <c39>   DW_AT_decl_line   : 171
    <c3a>   DW_AT_decl_column : 29
    <c3b>   DW_AT_type        : <0xe5b>
    <c3f>   DW_AT_data_member_location: 40
 <2><c40>: Abbrev Number: 2 (DW_TAG_member)
    <c41>   DW_AT_name        : (indirect string, offset: 0xf6abd): _seek
    <c45>   DW_AT_decl_file   : 7
    <c46>   DW_AT_decl_line   : 174
    <c47>   DW_AT_decl_column : 13
    <c48>   DW_AT_type        : <0xe7e>
    <c4c>   DW_AT_data_member_location: 44
 <2><c4d>: Abbrev Number: 2 (DW_TAG_member)
    <c4e>   DW_AT_name        : (indirect string, offset: 0xd3b0d): _close
    <c52>   DW_AT_decl_file   : 7
    <c53>   DW_AT_decl_line   : 175
    <c54>   DW_AT_decl_column : 9
    <c55>   DW_AT_type        : <0xe97>
    <c59>   DW_AT_data_member_location: 48
 <2><c5a>: Abbrev Number: 9 (DW_TAG_member)
    <c5b>   DW_AT_name        : _ub
    <c5f>   DW_AT_decl_file   : 7
    <c5f>   DW_AT_decl_line   : 178
    <c60>   DW_AT_decl_column : 17
    <c61>   DW_AT_type        : <0xb82>
    <c65>   DW_AT_data_member_location: 52
 <2><c66>: Abbrev Number: 9 (DW_TAG_member)
    <c67>   DW_AT_name        : _up
    <c6b>   DW_AT_decl_file   : 7
    <c6b>   DW_AT_decl_line   : 179
    <c6c>   DW_AT_decl_column : 18
    <c6d>   DW_AT_type        : <0xba8>
    <c71>   DW_AT_data_member_location: 60
 <2><c72>: Abbrev Number: 9 (DW_TAG_member)
    <c73>   DW_AT_name        : _ur
    <c77>   DW_AT_decl_file   : 7
    <c77>   DW_AT_decl_line   : 180
    <c78>   DW_AT_decl_column : 7
    <c79>   DW_AT_type        : <0x928>
    <c7d>   DW_AT_data_member_location: 64
 <2><c7e>: Abbrev Number: 2 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0xf6a93): _ubuf
    <c83>   DW_AT_decl_file   : 7
    <c84>   DW_AT_decl_line   : 183
    <c85>   DW_AT_decl_column : 17
    <c86>   DW_AT_type        : <0xe9c>
    <c8a>   DW_AT_data_member_location: 68
 <2><c8b>: Abbrev Number: 2 (DW_TAG_member)
    <c8c>   DW_AT_name        : (indirect string, offset: 0xf6938): _nbuf
    <c90>   DW_AT_decl_file   : 7
    <c91>   DW_AT_decl_line   : 184
    <c92>   DW_AT_decl_column : 17
    <c93>   DW_AT_type        : <0xeac>
    <c97>   DW_AT_data_member_location: 71
 <2><c98>: Abbrev Number: 9 (DW_TAG_member)
    <c99>   DW_AT_name        : _lb
    <c9d>   DW_AT_decl_file   : 7
    <c9d>   DW_AT_decl_line   : 187
    <c9e>   DW_AT_decl_column : 17
    <c9f>   DW_AT_type        : <0xb82>
    <ca3>   DW_AT_data_member_location: 72
 <2><ca4>: Abbrev Number: 2 (DW_TAG_member)
    <ca5>   DW_AT_name        : (indirect string, offset: 0xf851c): _blksize
    <ca9>   DW_AT_decl_file   : 7
    <caa>   DW_AT_decl_line   : 190
    <cab>   DW_AT_decl_column : 7
    <cac>   DW_AT_type        : <0x928>
    <cb0>   DW_AT_data_member_location: 80
 <2><cb1>: Abbrev Number: 2 (DW_TAG_member)
    <cb2>   DW_AT_name        : (indirect string, offset: 0xf67c7): _offset
    <cb6>   DW_AT_decl_file   : 7
    <cb7>   DW_AT_decl_line   : 191
    <cb8>   DW_AT_decl_column : 10
    <cb9>   DW_AT_type        : <0x9f0>
    <cbd>   DW_AT_data_member_location: 84
 <2><cbe>: Abbrev Number: 2 (DW_TAG_member)
    <cbf>   DW_AT_name        : (indirect string, offset: 0xf66f3): _lock
    <cc3>   DW_AT_decl_file   : 7
    <cc4>   DW_AT_decl_line   : 198
    <cc5>   DW_AT_decl_column : 12
    <cc6>   DW_AT_type        : <0xa8a>
    <cca>   DW_AT_data_member_location: 88
 <2><ccb>: Abbrev Number: 2 (DW_TAG_member)
    <ccc>   DW_AT_name        : (indirect string, offset: 0xf66e9): _mbstate
    <cd0>   DW_AT_decl_file   : 7
    <cd1>   DW_AT_decl_line   : 200
    <cd2>   DW_AT_decl_column : 14
    <cd3>   DW_AT_type        : <0xa5c>
    <cd7>   DW_AT_data_member_location: 92
 <2><cd8>: Abbrev Number: 2 (DW_TAG_member)
    <cd9>   DW_AT_name        : (indirect string, offset: 0xf69f5): _flags2
    <cdd>   DW_AT_decl_file   : 7
    <cde>   DW_AT_decl_line   : 201
    <cdf>   DW_AT_decl_column : 9
    <ce0>   DW_AT_type        : <0x928>
    <ce4>   DW_AT_data_member_location: 100
 <2><ce5>: Abbrev Number: 0
 <1><ce6>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x10122a): _reent
    <ceb>   DW_AT_byte_size   : 76
    <cec>   DW_AT_decl_file   : 7
    <ced>   DW_AT_decl_line   : 379
    <cef>   DW_AT_decl_column : 8
    <cf0>   DW_AT_sibling     : <0xdff>
 <2><cf4>: Abbrev Number: 1 (DW_TAG_member)
    <cf5>   DW_AT_name        : (indirect string, offset: 0xf8c36): _errno
    <cf9>   DW_AT_decl_file   : 7
    <cfa>   DW_AT_decl_line   : 383
    <cfc>   DW_AT_decl_column : 7
    <cfd>   DW_AT_type        : <0x928>
    <d01>   DW_AT_data_member_location: 0
 <2><d02>: Abbrev Number: 1 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0xf6885): _stdin
    <d07>   DW_AT_decl_file   : 7
    <d08>   DW_AT_decl_line   : 388
    <d0a>   DW_AT_decl_column : 11
    <d0b>   DW_AT_type        : <0xec9>
    <d0f>   DW_AT_data_member_location: 4
 <2><d10>: Abbrev Number: 1 (DW_TAG_member)
    <d11>   DW_AT_name        : (indirect string, offset: 0xf6953): _stdout
    <d15>   DW_AT_decl_file   : 7
    <d16>   DW_AT_decl_line   : 388
    <d18>   DW_AT_decl_column : 20
    <d19>   DW_AT_type        : <0xec9>
    <d1d>   DW_AT_data_member_location: 8
 <2><d1e>: Abbrev Number: 1 (DW_TAG_member)
    <d1f>   DW_AT_name        : (indirect string, offset: 0xf6a7e): _stderr
    <d23>   DW_AT_decl_file   : 7
    <d24>   DW_AT_decl_line   : 388
    <d26>   DW_AT_decl_column : 30
    <d27>   DW_AT_type        : <0xec9>
    <d2b>   DW_AT_data_member_location: 12
 <2><d2c>: Abbrev Number: 1 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0xf692c): _inc
    <d31>   DW_AT_decl_file   : 7
    <d32>   DW_AT_decl_line   : 390
    <d34>   DW_AT_decl_column : 8
    <d35>   DW_AT_type        : <0x928>
    <d39>   DW_AT_data_member_location: 16
 <2><d3a>: Abbrev Number: 1 (DW_TAG_member)
    <d3b>   DW_AT_name        : (indirect string, offset: 0xf69d0): _emergency
    <d3f>   DW_AT_decl_file   : 7
    <d40>   DW_AT_decl_line   : 392
    <d42>   DW_AT_decl_column : 9
    <d43>   DW_AT_type        : <0xe22>
    <d47>   DW_AT_data_member_location: 20
 <2><d48>: Abbrev Number: 1 (DW_TAG_member)
    <d49>   DW_AT_name        : (indirect string, offset: 0xf6a3d): _locale
    <d4d>   DW_AT_decl_file   : 7
    <d4e>   DW_AT_decl_line   : 398
    <d50>   DW_AT_decl_column : 22
    <d51>   DW_AT_type        : <0x102f>
    <d55>   DW_AT_data_member_location: 24
 <2><d56>: Abbrev Number: 24 (DW_TAG_member)
    <d57>   DW_AT_name        : _mp
    <d5b>   DW_AT_decl_file   : 7
    <d5c>   DW_AT_decl_line   : 400
    <d5e>   DW_AT_decl_column : 18
    <d5f>   DW_AT_type        : <0x1034>
    <d63>   DW_AT_data_member_location: 28
 <2><d64>: Abbrev Number: 1 (DW_TAG_member)
    <d65>   DW_AT_name        : (indirect string, offset: 0xf6712): __cleanup
    <d69>   DW_AT_decl_file   : 7
    <d6a>   DW_AT_decl_line   : 402
    <d6c>   DW_AT_decl_column : 10
    <d6d>   DW_AT_type        : <0x1044>
    <d71>   DW_AT_data_member_location: 32
 <2><d72>: Abbrev Number: 1 (DW_TAG_member)
    <d73>   DW_AT_name        : (indirect string, offset: 0xf6772): _gamma_signgam
    <d77>   DW_AT_decl_file   : 7
    <d78>   DW_AT_decl_line   : 404
    <d7a>   DW_AT_decl_column : 7
    <d7b>   DW_AT_type        : <0x928>
    <d7f>   DW_AT_data_member_location: 36
 <2><d80>: Abbrev Number: 1 (DW_TAG_member)
    <d81>   DW_AT_name        : (indirect string, offset: 0xf6986): _cvtlen
    <d85>   DW_AT_decl_file   : 7
    <d86>   DW_AT_decl_line   : 407
    <d88>   DW_AT_decl_column : 7
    <d89>   DW_AT_type        : <0x928>
    <d8d>   DW_AT_data_member_location: 40
 <2><d8e>: Abbrev Number: 1 (DW_TAG_member)
    <d8f>   DW_AT_name        : (indirect string, offset: 0xf683b): _cvtbuf
    <d93>   DW_AT_decl_file   : 7
    <d94>   DW_AT_decl_line   : 408
    <d96>   DW_AT_decl_column : 9
    <d97>   DW_AT_type        : <0xe22>
    <d9b>   DW_AT_data_member_location: 44
 <2><d9c>: Abbrev Number: 1 (DW_TAG_member)
    <d9d>   DW_AT_name        : (indirect string, offset: 0xf69a5): _r48
    <da1>   DW_AT_decl_file   : 7
    <da2>   DW_AT_decl_line   : 410
    <da4>   DW_AT_decl_column : 19
    <da5>   DW_AT_type        : <0x1049>
    <da9>   DW_AT_data_member_location: 48
 <2><daa>: Abbrev Number: 1 (DW_TAG_member)
    <dab>   DW_AT_name        : (indirect string, offset: 0xf6a11): _localtime_buf
    <daf>   DW_AT_decl_file   : 7
    <db0>   DW_AT_decl_line   : 411
    <db2>   DW_AT_decl_column : 16
    <db3>   DW_AT_type        : <0x104e>
    <db7>   DW_AT_data_member_location: 52
 <2><db8>: Abbrev Number: 1 (DW_TAG_member)
    <db9>   DW_AT_name        : (indirect string, offset: 0xf675b): _asctime_buf
    <dbd>   DW_AT_decl_file   : 7
    <dbe>   DW_AT_decl_line   : 412
    <dc0>   DW_AT_decl_column : 9
    <dc1>   DW_AT_type        : <0xe22>
    <dc5>   DW_AT_data_member_location: 56
 <2><dc6>: Abbrev Number: 1 (DW_TAG_member)
    <dc7>   DW_AT_name        : (indirect string, offset: 0xf6735): _sig_func
    <dcb>   DW_AT_decl_file   : 7
    <dcc>   DW_AT_decl_line   : 415
    <dce>   DW_AT_decl_column : 12
    <dcf>   DW_AT_type        : <0x105e>
    <dd3>   DW_AT_data_member_location: 60
 <2><dd4>: Abbrev Number: 1 (DW_TAG_member)
    <dd5>   DW_AT_name        : (indirect string, offset: 0xf6781): __sf
    <dd9>   DW_AT_decl_file   : 7
    <dda>   DW_AT_decl_line   : 423
    <ddc>   DW_AT_decl_column : 11
    <ddd>   DW_AT_type        : <0xec9>
    <de1>   DW_AT_data_member_location: 64
 <2><de2>: Abbrev Number: 1 (DW_TAG_member)
    <de3>   DW_AT_name        : (indirect string, offset: 0xf6825): _misc
    <de7>   DW_AT_decl_file   : 7
    <de8>   DW_AT_decl_line   : 424
    <dea>   DW_AT_decl_column : 23
    <deb>   DW_AT_type        : <0x1068>
    <def>   DW_AT_data_member_location: 68
 <2><df0>: Abbrev Number: 1 (DW_TAG_member)
    <df1>   DW_AT_name        : (indirect string, offset: 0xf6916): _signal_buf
    <df5>   DW_AT_decl_file   : 7
    <df6>   DW_AT_decl_line   : 425
    <df8>   DW_AT_decl_column : 9
    <df9>   DW_AT_type        : <0xe22>
    <dfd>   DW_AT_data_member_location: 72
 <2><dfe>: Abbrev Number: 0
 <1><dff>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e00>   DW_AT_byte_size   : 4
    <e00>   DW_AT_type        : <0xce6>
 <1><e04>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <e05>   DW_AT_prototyped  : 1
    <e05>   DW_AT_type        : <0x928>
    <e09>   DW_AT_sibling     : <0xe22>
 <2><e0d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e0e>   DW_AT_type        : <0xdff>
 <2><e12>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e13>   DW_AT_type        : <0x9bd>
 <2><e17>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e18>   DW_AT_type        : <0xe22>
 <2><e1c>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e1d>   DW_AT_type        : <0x928>
 <2><e21>: Abbrev Number: 0
 <1><e22>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e23>   DW_AT_byte_size   : 4
    <e23>   DW_AT_type        : <0xe27>
 <1><e27>: Abbrev Number: 6 (DW_TAG_base_type)
    <e28>   DW_AT_byte_size   : 1
    <e29>   DW_AT_encoding    : 8	(unsigned char)
    <e2a>   DW_AT_name        : (indirect string, offset: 0xcdef9): char
 <1><e2e>: Abbrev Number: 25 (DW_TAG_const_type)
    <e2f>   DW_AT_type        : <0xe27>
 <1><e33>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e34>   DW_AT_byte_size   : 4
    <e34>   DW_AT_type        : <0xe04>
 <1><e38>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <e39>   DW_AT_prototyped  : 1
    <e39>   DW_AT_type        : <0x928>
    <e3d>   DW_AT_sibling     : <0xe56>
 <2><e41>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e42>   DW_AT_type        : <0xdff>
 <2><e46>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e47>   DW_AT_type        : <0x9bd>
 <2><e4b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e4c>   DW_AT_type        : <0xe56>
 <2><e50>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e51>   DW_AT_type        : <0x928>
 <2><e55>: Abbrev Number: 0
 <1><e56>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e57>   DW_AT_byte_size   : 4
    <e57>   DW_AT_type        : <0xe2e>
 <1><e5b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e5c>   DW_AT_byte_size   : 4
    <e5c>   DW_AT_type        : <0xe38>
 <1><e60>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <e61>   DW_AT_prototyped  : 1
    <e61>   DW_AT_type        : <0x9fc>
    <e65>   DW_AT_sibling     : <0xe7e>
 <2><e69>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e6a>   DW_AT_type        : <0xdff>
 <2><e6e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e6f>   DW_AT_type        : <0x9bd>
 <2><e73>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e74>   DW_AT_type        : <0x9fc>
 <2><e78>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e79>   DW_AT_type        : <0x928>
 <2><e7d>: Abbrev Number: 0
 <1><e7e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e7f>   DW_AT_byte_size   : 4
    <e7f>   DW_AT_type        : <0xe60>
 <1><e83>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <e84>   DW_AT_prototyped  : 1
    <e84>   DW_AT_type        : <0x928>
    <e88>   DW_AT_sibling     : <0xe97>
 <2><e8c>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e8d>   DW_AT_type        : <0xdff>
 <2><e91>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <e92>   DW_AT_type        : <0x9bd>
 <2><e96>: Abbrev Number: 0
 <1><e97>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <e98>   DW_AT_byte_size   : 4
    <e98>   DW_AT_type        : <0xe83>
 <1><e9c>: Abbrev Number: 7 (DW_TAG_array_type)
    <e9d>   DW_AT_type        : <0x957>
    <ea1>   DW_AT_sibling     : <0xeac>
 <2><ea5>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <ea6>   DW_AT_type        : <0x92f>
    <eaa>   DW_AT_upper_bound : 2
 <2><eab>: Abbrev Number: 0
 <1><eac>: Abbrev Number: 7 (DW_TAG_array_type)
    <ead>   DW_AT_type        : <0x957>
    <eb1>   DW_AT_sibling     : <0xebc>
 <2><eb5>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <eb6>   DW_AT_type        : <0x92f>
    <eba>   DW_AT_upper_bound : 0
 <2><ebb>: Abbrev Number: 0
 <1><ebc>: Abbrev Number: 11 (DW_TAG_typedef)
    <ebd>   DW_AT_name        : (indirect string, offset: 0xf69ee): __FILE
    <ec1>   DW_AT_decl_file   : 7
    <ec2>   DW_AT_decl_line   : 270
    <ec4>   DW_AT_decl_column : 26
    <ec5>   DW_AT_type        : <0xbad>
 <1><ec9>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <eca>   DW_AT_byte_size   : 4
    <eca>   DW_AT_type        : <0xebc>
 <1><ece>: Abbrev Number: 10 (DW_TAG_structure_type)
    <ecf>   DW_AT_name        : (indirect string, offset: 0xf67cf): _rand48
    <ed3>   DW_AT_byte_size   : 24
    <ed4>   DW_AT_decl_file   : 7
    <ed5>   DW_AT_decl_line   : 306
    <ed7>   DW_AT_decl_column : 8
    <ed8>   DW_AT_sibling     : <0xf15>
 <2><edc>: Abbrev Number: 1 (DW_TAG_member)
    <edd>   DW_AT_name        : (indirect string, offset: 0xf6ab7): _seed
    <ee1>   DW_AT_decl_file   : 7
    <ee2>   DW_AT_decl_line   : 307
    <ee4>   DW_AT_decl_column : 18
    <ee5>   DW_AT_type        : <0xf15>
    <ee9>   DW_AT_data_member_location: 0
 <2><eea>: Abbrev Number: 1 (DW_TAG_member)
    <eeb>   DW_AT_name        : (indirect string, offset: 0xf66e3): _mult
    <eef>   DW_AT_decl_file   : 7
    <ef0>   DW_AT_decl_line   : 308
    <ef2>   DW_AT_decl_column : 18
    <ef3>   DW_AT_type        : <0xf15>
    <ef7>   DW_AT_data_member_location: 6
 <2><ef8>: Abbrev Number: 1 (DW_TAG_member)
    <ef9>   DW_AT_name        : (indirect string, offset: 0xfbcf6): _add
    <efd>   DW_AT_decl_file   : 7
    <efe>   DW_AT_decl_line   : 309
    <f00>   DW_AT_decl_column : 18
    <f01>   DW_AT_type        : <0x971>
    <f05>   DW_AT_data_member_location: 12
 <2><f06>: Abbrev Number: 1 (DW_TAG_member)
    <f07>   DW_AT_name        : (indirect string, offset: 0xf6901): _rand_next
    <f0b>   DW_AT_decl_file   : 7
    <f0c>   DW_AT_decl_line   : 312
    <f0e>   DW_AT_decl_column : 36
    <f0f>   DW_AT_type        : <0x992>
    <f13>   DW_AT_data_member_location: 16
 <2><f14>: Abbrev Number: 0
 <1><f15>: Abbrev Number: 7 (DW_TAG_array_type)
    <f16>   DW_AT_type        : <0x971>
    <f1a>   DW_AT_sibling     : <0xf25>
 <2><f1e>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <f1f>   DW_AT_type        : <0x92f>
    <f23>   DW_AT_upper_bound : 2
 <2><f24>: Abbrev Number: 0
 <1><f25>: Abbrev Number: 10 (DW_TAG_structure_type)
    <f26>   DW_AT_name        : (indirect string, offset: 0xf69bb): _mprec
    <f2a>   DW_AT_byte_size   : 16
    <f2b>   DW_AT_decl_file   : 7
    <f2c>   DW_AT_decl_line   : 348
    <f2e>   DW_AT_decl_column : 8
    <f2f>   DW_AT_sibling     : <0xf6c>
 <2><f33>: Abbrev Number: 1 (DW_TAG_member)
    <f34>   DW_AT_name        : (indirect string, offset: 0xf6ae0): _result
    <f38>   DW_AT_decl_file   : 7
    <f39>   DW_AT_decl_line   : 351
    <f3b>   DW_AT_decl_column : 19
    <f3c>   DW_AT_type        : <0xaec>
    <f40>   DW_AT_data_member_location: 0
 <2><f41>: Abbrev Number: 1 (DW_TAG_member)
    <f42>   DW_AT_name        : (indirect string, offset: 0xf6922): _result_k
    <f46>   DW_AT_decl_file   : 7
    <f47>   DW_AT_decl_line   : 352
    <f49>   DW_AT_decl_column : 7
    <f4a>   DW_AT_type        : <0x928>
    <f4e>   DW_AT_data_member_location: 4
 <2><f4f>: Abbrev Number: 1 (DW_TAG_member)
    <f50>   DW_AT_name        : (indirect string, offset: 0xf6869): _p5s
    <f54>   DW_AT_decl_file   : 7
    <f55>   DW_AT_decl_line   : 353
    <f57>   DW_AT_decl_column : 19
    <f58>   DW_AT_type        : <0xaec>
    <f5c>   DW_AT_data_member_location: 8
 <2><f5d>: Abbrev Number: 1 (DW_TAG_member)
    <f5e>   DW_AT_name        : (indirect string, offset: 0xf695b): _freelist
    <f62>   DW_AT_decl_file   : 7
    <f63>   DW_AT_decl_line   : 354
    <f65>   DW_AT_decl_column : 20
    <f66>   DW_AT_type        : <0xf6c>
    <f6a>   DW_AT_data_member_location: 12
 <2><f6b>: Abbrev Number: 0
 <1><f6c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <f6d>   DW_AT_byte_size   : 4
    <f6d>   DW_AT_type        : <0xaec>
 <1><f71>: Abbrev Number: 10 (DW_TAG_structure_type)
    <f72>   DW_AT_name        : (indirect string, offset: 0xf685d): _misc_reent
    <f76>   DW_AT_byte_size   : 80
    <f77>   DW_AT_decl_file   : 7
    <f78>   DW_AT_decl_line   : 358
    <f7a>   DW_AT_decl_column : 8
    <f7b>   DW_AT_sibling     : <0x101a>
 <2><f7f>: Abbrev Number: 1 (DW_TAG_member)
    <f80>   DW_AT_name        : (indirect string, offset: 0xf6a86): _strtok_last
    <f84>   DW_AT_decl_file   : 7
    <f85>   DW_AT_decl_line   : 361
    <f87>   DW_AT_decl_column : 9
    <f88>   DW_AT_type        : <0xe22>
    <f8c>   DW_AT_data_member_location: 0
 <2><f8d>: Abbrev Number: 1 (DW_TAG_member)
    <f8e>   DW_AT_name        : (indirect string, offset: 0xf680d): _mblen_state
    <f92>   DW_AT_decl_file   : 7
    <f93>   DW_AT_decl_line   : 362
    <f95>   DW_AT_decl_column : 14
    <f96>   DW_AT_type        : <0xa5c>
    <f9a>   DW_AT_data_member_location: 4
 <2><f9b>: Abbrev Number: 1 (DW_TAG_member)
    <f9c>   DW_AT_name        : (indirect string, offset: 0xf698e): _wctomb_state
    <fa0>   DW_AT_decl_file   : 7
    <fa1>   DW_AT_decl_line   : 363
    <fa3>   DW_AT_decl_column : 14
    <fa4>   DW_AT_type        : <0xa5c>
    <fa8>   DW_AT_data_member_location: 12
 <2><fa9>: Abbrev Number: 1 (DW_TAG_member)
    <faa>   DW_AT_name        : (indirect string, offset: 0xf6843): _mbtowc_state
    <fae>   DW_AT_decl_file   : 7
    <faf>   DW_AT_decl_line   : 364
    <fb1>   DW_AT_decl_column : 14
    <fb2>   DW_AT_type        : <0xa5c>
    <fb6>   DW_AT_data_member_location: 20
 <2><fb7>: Abbrev Number: 1 (DW_TAG_member)
    <fb8>   DW_AT_name        : (indirect string, offset: 0xf6768): _l64a_buf
    <fbc>   DW_AT_decl_file   : 7
    <fbd>   DW_AT_decl_line   : 365
    <fbf>   DW_AT_decl_column : 8
    <fc0>   DW_AT_type        : <0x101a>
    <fc4>   DW_AT_data_member_location: 28
 <2><fc5>: Abbrev Number: 1 (DW_TAG_member)
    <fc6>   DW_AT_name        : (indirect string, offset: 0xf6a62): _getdate_err
    <fca>   DW_AT_decl_file   : 7
    <fcb>   DW_AT_decl_line   : 366
    <fcd>   DW_AT_decl_column : 7
    <fce>   DW_AT_type        : <0x928>
    <fd2>   DW_AT_data_member_location: 36
 <2><fd3>: Abbrev Number: 1 (DW_TAG_member)
    <fd4>   DW_AT_name        : (indirect string, offset: 0xf686e): _mbrlen_state
    <fd8>   DW_AT_decl_file   : 7
    <fd9>   DW_AT_decl_line   : 367
    <fdb>   DW_AT_decl_column : 14
    <fdc>   DW_AT_type        : <0xa5c>
    <fe0>   DW_AT_data_member_location: 40
 <2><fe1>: Abbrev Number: 1 (DW_TAG_member)
    <fe2>   DW_AT_name        : (indirect string, offset: 0xf6a6f): _mbrtowc_state
    <fe6>   DW_AT_decl_file   : 7
    <fe7>   DW_AT_decl_line   : 368
    <fe9>   DW_AT_decl_column : 14
    <fea>   DW_AT_type        : <0xa5c>
    <fee>   DW_AT_data_member_location: 48
 <2><fef>: Abbrev Number: 1 (DW_TAG_member)
    <ff0>   DW_AT_name        : (indirect string, offset: 0xf6793): _mbsrtowcs_state
    <ff4>   DW_AT_decl_file   : 7
    <ff5>   DW_AT_decl_line   : 369
    <ff7>   DW_AT_decl_column : 14
    <ff8>   DW_AT_type        : <0xa5c>
    <ffc>   DW_AT_data_member_location: 56
 <2><ffd>: Abbrev Number: 1 (DW_TAG_member)
    <ffe>   DW_AT_name        : (indirect string, offset: 0xf67b8): _wcrtomb_state
    <1002>   DW_AT_decl_file   : 7
    <1003>   DW_AT_decl_line   : 370
    <1005>   DW_AT_decl_column : 14
    <1006>   DW_AT_type        : <0xa5c>
    <100a>   DW_AT_data_member_location: 64
 <2><100b>: Abbrev Number: 1 (DW_TAG_member)
    <100c>   DW_AT_name        : (indirect string, offset: 0xf68cf): _wcsrtombs_state
    <1010>   DW_AT_decl_file   : 7
    <1011>   DW_AT_decl_line   : 371
    <1013>   DW_AT_decl_column : 14
    <1014>   DW_AT_type        : <0xa5c>
    <1018>   DW_AT_data_member_location: 72
 <2><1019>: Abbrev Number: 0
 <1><101a>: Abbrev Number: 7 (DW_TAG_array_type)
    <101b>   DW_AT_type        : <0xe27>
    <101f>   DW_AT_sibling     : <0x102a>
 <2><1023>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1024>   DW_AT_type        : <0x92f>
    <1028>   DW_AT_upper_bound : 7
 <2><1029>: Abbrev Number: 0
 <1><102a>: Abbrev Number: 16 (DW_TAG_structure_type)
    <102b>   DW_AT_name        : (indirect string, offset: 0xf6a32): __locale_t
    <102f>   DW_AT_declaration : 1
 <1><102f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1030>   DW_AT_byte_size   : 4
    <1030>   DW_AT_type        : <0x102a>
 <1><1034>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1035>   DW_AT_byte_size   : 4
    <1035>   DW_AT_type        : <0xf25>
 <1><1039>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <103a>   DW_AT_prototyped  : 1
    <103a>   DW_AT_sibling     : <0x1044>
 <2><103e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <103f>   DW_AT_type        : <0xdff>
 <2><1043>: Abbrev Number: 0
 <1><1044>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1045>   DW_AT_byte_size   : 4
    <1045>   DW_AT_type        : <0x1039>
 <1><1049>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <104a>   DW_AT_byte_size   : 4
    <104a>   DW_AT_type        : <0xece>
 <1><104e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <104f>   DW_AT_byte_size   : 4
    <104f>   DW_AT_type        : <0xb01>
 <1><1053>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <1054>   DW_AT_prototyped  : 1
    <1054>   DW_AT_sibling     : <0x105e>
 <2><1058>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <1059>   DW_AT_type        : <0x928>
 <2><105d>: Abbrev Number: 0
 <1><105e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <105f>   DW_AT_byte_size   : 4
    <105f>   DW_AT_type        : <0x1063>
 <1><1063>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1064>   DW_AT_byte_size   : 4
    <1064>   DW_AT_type        : <0x1053>
 <1><1068>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1069>   DW_AT_byte_size   : 4
    <1069>   DW_AT_type        : <0xf71>
 <1><106d>: Abbrev Number: 10 (DW_TAG_structure_type)
    <106e>   DW_AT_name        : (indirect string, offset: 0xf6a20): xSTATIC_LIST_ITEM
    <1072>   DW_AT_byte_size   : 20
    <1073>   DW_AT_decl_file   : 9
    <1074>   DW_AT_decl_line   : 1044
    <1076>   DW_AT_decl_column : 8
    <1077>   DW_AT_sibling     : <0x1098>
 <2><107b>: Abbrev Number: 1 (DW_TAG_member)
    <107c>   DW_AT_name        : (indirect string, offset: 0xfde55): xDummy2
    <1080>   DW_AT_decl_file   : 9
    <1081>   DW_AT_decl_line   : 1049
    <1083>   DW_AT_decl_column : 13
    <1084>   DW_AT_type        : <0x9d7>
    <1088>   DW_AT_data_member_location: 0
 <2><1089>: Abbrev Number: 1 (DW_TAG_member)
    <108a>   DW_AT_name        : (indirect string, offset: 0xf67e8): pvDummy3
    <108e>   DW_AT_decl_file   : 9
    <108f>   DW_AT_decl_line   : 1050
    <1091>   DW_AT_decl_column : 8
    <1092>   DW_AT_type        : <0x1098>
    <1096>   DW_AT_data_member_location: 4
 <2><1097>: Abbrev Number: 0
 <1><1098>: Abbrev Number: 7 (DW_TAG_array_type)
    <1099>   DW_AT_type        : <0x9bd>
    <109d>   DW_AT_sibling     : <0x10a8>
 <2><10a1>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <10a2>   DW_AT_type        : <0x92f>
    <10a6>   DW_AT_upper_bound : 3
 <2><10a7>: Abbrev Number: 0
 <1><10a8>: Abbrev Number: 11 (DW_TAG_typedef)
