Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x915 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x33b81): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x8bd16): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x851dd): E:/sbzrgn/My-STM32_Discoveries/STM32F411_Discovery/STM32F411Discovery_CubeAI_GestureRecognition_MPU9250_AHRS_FreeRTOS/CubeAI_GestureRecognition_MPU9250_AHRS_FreeRTOS/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 20 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 6 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xb37f): unsigned int
 <1><38>: Abbrev Number: 6 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)

 <1><4d>: Abbrev Number: 5 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x2887f): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0x1ccf7): unsigned char
 <1><60>: Abbrev Number: 6 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x69366): short int
 <1><67>: Abbrev Number: 5 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x732e9): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 6 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x87ab7): short unsigned int
 <1><7a>: Abbrev Number: 6 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0xb8e3): long int
 <1><81>: Abbrev Number: 5 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x5964a): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x2b36a): long unsigned int
 <1><94>: Abbrev Number: 6 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x1d61c): long long unsigned int
 <1><9b>: Abbrev Number: 5 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x28881): uint8_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 24
    <a2>   DW_AT_decl_column : 19
    <a3>   DW_AT_type        : <0x4d>
 <1><a7>: Abbrev Number: 5 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x66b70): uint16_t
    <ac>   DW_AT_decl_file   : 3
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 5 (DW_TAG_typedef)
    <b4>   DW_AT_name        : (indirect string, offset: 0x6642d): uint32_t
    <b8>   DW_AT_decl_file   : 3
    <b9>   DW_AT_decl_line   : 48
    <ba>   DW_AT_decl_column : 20
    <bb>   DW_AT_type        : <0x81>
 <1><bf>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <c0>   DW_AT_byte_size   : 4
 <1><c1>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x66f00): StackType_t
    <c6>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 55
    <c8>   DW_AT_decl_column : 24
    <c9>   DW_AT_type        : <0xb3>
 <1><cd>: Abbrev Number: 5 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x82716): UBaseType_t
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 57
    <d4>   DW_AT_decl_column : 23
    <d5>   DW_AT_type        : <0x8d>
 <1><d9>: Abbrev Number: 5 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0x4dbff): TickType_t
    <de>   DW_AT_decl_file   : 4
    <df>   DW_AT_decl_line   : 63
    <e0>   DW_AT_decl_column : 19
    <e1>   DW_AT_type        : <0xb3>
 <1><e5>: Abbrev Number: 11 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0x67c58): wint_t
    <ea>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 359
    <ed>   DW_AT_decl_column : 23
    <ee>   DW_AT_type        : <0x31>
 <1><f2>: Abbrev Number: 5 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x80735): _off_t
    <f7>   DW_AT_decl_file   : 6
    <f8>   DW_AT_decl_line   : 46
    <f9>   DW_AT_decl_column : 14
    <fa>   DW_AT_type        : <0x7a>
 <1><fe>: Abbrev Number: 5 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x1f5ba): _fpos_t
    <103>   DW_AT_decl_file   : 6
    <104>   DW_AT_decl_line   : 116
    <105>   DW_AT_decl_column : 14
    <106>   DW_AT_type        : <0x7a>
 <1><10a>: Abbrev Number: 22 (DW_TAG_union_type)
    <10b>   DW_AT_byte_size   : 4
    <10c>   DW_AT_decl_file   : 6
    <10d>   DW_AT_decl_line   : 165
    <10e>   DW_AT_decl_column : 3
    <10f>   DW_AT_sibling     : <0x12a>
 <2><113>: Abbrev Number: 15 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x6c459): __wch
    <118>   DW_AT_decl_file   : 6
    <118>   DW_AT_decl_line   : 167
    <119>   DW_AT_decl_column : 12
    <11a>   DW_AT_type        : <0xe5>
 <2><11e>: Abbrev Number: 15 (DW_TAG_member)
    <11f>   DW_AT_name        : (indirect string, offset: 0x4878d): __wchb
    <123>   DW_AT_decl_file   : 6
    <123>   DW_AT_decl_line   : 168
    <124>   DW_AT_decl_column : 19
    <125>   DW_AT_type        : <0x12a>
 <2><129>: Abbrev Number: 0
 <1><12a>: Abbrev Number: 7 (DW_TAG_array_type)
    <12b>   DW_AT_type        : <0x59>
    <12f>   DW_AT_sibling     : <0x13a>
 <2><133>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <134>   DW_AT_type        : <0x31>
    <138>   DW_AT_upper_bound : 3
 <2><139>: Abbrev Number: 0
 <1><13a>: Abbrev Number: 23 (DW_TAG_structure_type)
    <13b>   DW_AT_byte_size   : 8
    <13c>   DW_AT_decl_file   : 6
    <13d>   DW_AT_decl_line   : 162
    <13e>   DW_AT_decl_column : 9
    <13f>   DW_AT_sibling     : <0x15e>
 <2><143>: Abbrev Number: 2 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x27582): __count
    <148>   DW_AT_decl_file   : 6
    <149>   DW_AT_decl_line   : 164
    <14a>   DW_AT_decl_column : 7
    <14b>   DW_AT_type        : <0x2a>
    <14f>   DW_AT_data_member_location: 0
 <2><150>: Abbrev Number: 2 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x50d38): __value
    <155>   DW_AT_decl_file   : 6
    <156>   DW_AT_decl_line   : 169
    <157>   DW_AT_decl_column : 5
    <158>   DW_AT_type        : <0x10a>
    <15c>   DW_AT_data_member_location: 4
 <2><15d>: Abbrev Number: 0
 <1><15e>: Abbrev Number: 5 (DW_TAG_typedef)
    <15f>   DW_AT_name        : (indirect string, offset: 0x499b1): _mbstate_t
    <163>   DW_AT_decl_file   : 6
    <164>   DW_AT_decl_line   : 170
    <165>   DW_AT_decl_column : 3
    <166>   DW_AT_type        : <0x13a>
 <1><16a>: Abbrev Number: 5 (DW_TAG_typedef)
    <16b>   DW_AT_name        : (indirect string, offset: 0x4c223): __ULong
    <16f>   DW_AT_decl_file   : 7
    <170>   DW_AT_decl_line   : 22
    <171>   DW_AT_decl_column : 25
    <172>   DW_AT_type        : <0x8d>
 <1><176>: Abbrev Number: 5 (DW_TAG_typedef)
    <177>   DW_AT_name        : (indirect string, offset: 0x4d839): _LOCK_T
    <17b>   DW_AT_decl_file   : 8
    <17c>   DW_AT_decl_line   : 34
    <17d>   DW_AT_decl_column : 25
    <17e>   DW_AT_type        : <0x182>
 <1><182>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <183>   DW_AT_byte_size   : 4
    <183>   DW_AT_type        : <0x187>
 <1><187>: Abbrev Number: 16 (DW_TAG_structure_type)
    <188>   DW_AT_name        : (indirect string, offset: 0x2b59c): __lock
    <18c>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 5 (DW_TAG_typedef)
    <18d>   DW_AT_name        : (indirect string, offset: 0x456a4): _flock_t
    <191>   DW_AT_decl_file   : 7
    <192>   DW_AT_decl_line   : 35
    <193>   DW_AT_decl_column : 27
    <194>   DW_AT_type        : <0x176>
 <1><198>: Abbrev Number: 12 (DW_TAG_structure_type)
    <199>   DW_AT_name        : (indirect string, offset: 0x30b39): _Bigint
    <19d>   DW_AT_byte_size   : 24
    <19e>   DW_AT_decl_file   : 7
    <19e>   DW_AT_decl_line   : 52
    <19f>   DW_AT_decl_column : 8
    <19f>   DW_AT_sibling     : <0x1ee>
 <2><1a3>: Abbrev Number: 2 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x53c36): _next
    <1a8>   DW_AT_decl_file   : 7
    <1a9>   DW_AT_decl_line   : 54
    <1aa>   DW_AT_decl_column : 19
    <1ab>   DW_AT_type        : <0x1ee>
    <1af>   DW_AT_data_member_location: 0
 <2><1b0>: Abbrev Number: 9 (DW_TAG_member)
    <1b1>   DW_AT_name        : _k
    <1b4>   DW_AT_decl_file   : 7
    <1b4>   DW_AT_decl_line   : 55
    <1b5>   DW_AT_decl_column : 7
    <1b6>   DW_AT_type        : <0x2a>
    <1ba>   DW_AT_data_member_location: 4
 <2><1bb>: Abbrev Number: 2 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x64bb5): _maxwds
    <1c0>   DW_AT_decl_file   : 7
    <1c1>   DW_AT_decl_line   : 55
    <1c2>   DW_AT_decl_column : 11
    <1c3>   DW_AT_type        : <0x2a>
    <1c7>   DW_AT_data_member_location: 8
 <2><1c8>: Abbrev Number: 2 (DW_TAG_member)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x4acb8): _sign
    <1cd>   DW_AT_decl_file   : 7
    <1ce>   DW_AT_decl_line   : 55
    <1cf>   DW_AT_decl_column : 20
    <1d0>   DW_AT_type        : <0x2a>
    <1d4>   DW_AT_data_member_location: 12
 <2><1d5>: Abbrev Number: 2 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x4a8c3): _wds
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 55
    <1dc>   DW_AT_decl_column : 27
    <1dd>   DW_AT_type        : <0x2a>
    <1e1>   DW_AT_data_member_location: 16
 <2><1e2>: Abbrev Number: 9 (DW_TAG_member)
    <1e3>   DW_AT_name        : _x
    <1e6>   DW_AT_decl_file   : 7
    <1e6>   DW_AT_decl_line   : 56
    <1e7>   DW_AT_decl_column : 11
    <1e8>   DW_AT_type        : <0x1f3>
    <1ec>   DW_AT_data_member_location: 20
 <2><1ed>: Abbrev Number: 0
 <1><1ee>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1ef>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_type        : <0x198>
 <1><1f3>: Abbrev Number: 7 (DW_TAG_array_type)
    <1f4>   DW_AT_type        : <0x16a>
    <1f8>   DW_AT_sibling     : <0x203>
 <2><1fc>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1fd>   DW_AT_type        : <0x31>
    <201>   DW_AT_upper_bound : 0
 <2><202>: Abbrev Number: 0
 <1><203>: Abbrev Number: 12 (DW_TAG_structure_type)
    <204>   DW_AT_name        : (indirect string, offset: 0x26425): __tm
    <208>   DW_AT_byte_size   : 36
    <209>   DW_AT_decl_file   : 7
    <209>   DW_AT_decl_line   : 60
    <20a>   DW_AT_decl_column : 8
    <20a>   DW_AT_sibling     : <0x284>
 <2><20e>: Abbrev Number: 2 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x7380d): __tm_sec
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 62
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0x2a>
    <21a>   DW_AT_data_member_location: 0
 <2><21b>: Abbrev Number: 2 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0x9b0): __tm_min
    <220>   DW_AT_decl_file   : 7
    <221>   DW_AT_decl_line   : 63
    <222>   DW_AT_decl_column : 9
    <223>   DW_AT_type        : <0x2a>
    <227>   DW_AT_data_member_location: 4
 <2><228>: Abbrev Number: 2 (DW_TAG_member)
    <229>   DW_AT_name        : (indirect string, offset: 0x1e2b7): __tm_hour
    <22d>   DW_AT_decl_file   : 7
    <22e>   DW_AT_decl_line   : 64
    <22f>   DW_AT_decl_column : 9
    <230>   DW_AT_type        : <0x2a>
    <234>   DW_AT_data_member_location: 8
 <2><235>: Abbrev Number: 2 (DW_TAG_member)
    <236>   DW_AT_name        : (indirect string, offset: 0x52790): __tm_mday
    <23a>   DW_AT_decl_file   : 7
    <23b>   DW_AT_decl_line   : 65
    <23c>   DW_AT_decl_column : 9
    <23d>   DW_AT_type        : <0x2a>
    <241>   DW_AT_data_member_location: 12
 <2><242>: Abbrev Number: 2 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x24e9): __tm_mon
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 66
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0x2a>
    <24e>   DW_AT_data_member_location: 16
 <2><24f>: Abbrev Number: 2 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x83d7a): __tm_year
    <254>   DW_AT_decl_file   : 7
    <255>   DW_AT_decl_line   : 67
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_type        : <0x2a>
    <25b>   DW_AT_data_member_location: 20
 <2><25c>: Abbrev Number: 2 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0x3ade3): __tm_wday
    <261>   DW_AT_decl_file   : 7
    <262>   DW_AT_decl_line   : 68
    <263>   DW_AT_decl_column : 9
    <264>   DW_AT_type        : <0x2a>
    <268>   DW_AT_data_member_location: 24
 <2><269>: Abbrev Number: 2 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x6fc26): __tm_yday
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 69
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0x2a>
    <275>   DW_AT_data_member_location: 28
 <2><276>: Abbrev Number: 2 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x7f422): __tm_isdst
    <27b>   DW_AT_decl_file   : 7
    <27c>   DW_AT_decl_line   : 70
    <27d>   DW_AT_decl_column : 9
    <27e>   DW_AT_type        : <0x2a>
    <282>   DW_AT_data_member_location: 32
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 12 (DW_TAG_structure_type)
    <285>   DW_AT_name        : (indirect string, offset: 0x5dac8): __sbuf
    <289>   DW_AT_byte_size   : 8
    <28a>   DW_AT_decl_file   : 7
    <28a>   DW_AT_decl_line   : 115
    <28b>   DW_AT_decl_column : 8
    <28b>   DW_AT_sibling     : <0x2aa>
 <2><28f>: Abbrev Number: 2 (DW_TAG_member)
    <290>   DW_AT_name        : (indirect string, offset: 0xa2889): _base
    <294>   DW_AT_decl_file   : 7
    <295>   DW_AT_decl_line   : 116
    <296>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x2aa>
    <29b>   DW_AT_data_member_location: 0
 <2><29c>: Abbrev Number: 2 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x9f828): _size
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 117
    <2a3>   DW_AT_decl_column : 6
    <2a4>   DW_AT_type        : <0x2a>
    <2a8>   DW_AT_data_member_location: 4
 <2><2a9>: Abbrev Number: 0
 <1><2aa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <2ab>   DW_AT_byte_size   : 4
    <2ab>   DW_AT_type        : <0x59>
 <1><2af>: Abbrev Number: 12 (DW_TAG_structure_type)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x6c1c1): __sFILE
    <2b4>   DW_AT_byte_size   : 104
    <2b5>   DW_AT_decl_file   : 7
    <2b5>   DW_AT_decl_line   : 152
    <2b6>   DW_AT_decl_column : 8
    <2b6>   DW_AT_sibling     : <0x3e8>
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : _p
    <2be>   DW_AT_decl_file   : 7
    <2be>   DW_AT_decl_line   : 153
    <2bf>   DW_AT_decl_column : 18
    <2c0>   DW_AT_type        : <0x2aa>
    <2c4>   DW_AT_data_member_location: 0
 <2><2c5>: Abbrev Number: 9 (DW_TAG_member)
    <2c6>   DW_AT_name        : _r
    <2c9>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 154
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x2a>
    <2cf>   DW_AT_data_member_location: 4
 <2><2d0>: Abbrev Number: 9 (DW_TAG_member)
    <2d1>   DW_AT_name        : _w
    <2d4>   DW_AT_decl_file   : 7
    <2d4>   DW_AT_decl_line   : 155
    <2d5>   DW_AT_decl_column : 7
    <2d6>   DW_AT_type        : <0x2a>
    <2da>   DW_AT_data_member_location: 8
 <2><2db>: Abbrev Number: 2 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x9241c): _flags
    <2e0>   DW_AT_decl_file   : 7
    <2e1>   DW_AT_decl_line   : 156
    <2e2>   DW_AT_decl_column : 9
    <2e3>   DW_AT_type        : <0x60>
    <2e7>   DW_AT_data_member_location: 12
 <2><2e8>: Abbrev Number: 2 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x15cb9): _file
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 157
    <2ef>   DW_AT_decl_column : 9
    <2f0>   DW_AT_type        : <0x60>
    <2f4>   DW_AT_data_member_location: 14
 <2><2f5>: Abbrev Number: 9 (DW_TAG_member)
    <2f6>   DW_AT_name        : _bf
    <2fa>   DW_AT_decl_file   : 7
    <2fa>   DW_AT_decl_line   : 158
    <2fb>   DW_AT_decl_column : 17
    <2fc>   DW_AT_type        : <0x284>
    <300>   DW_AT_data_member_location: 16
 <2><301>: Abbrev Number: 2 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0x40510): _lbfsize
    <306>   DW_AT_decl_file   : 7
    <307>   DW_AT_decl_line   : 159
    <308>   DW_AT_decl_column : 7
    <309>   DW_AT_type        : <0x2a>
    <30d>   DW_AT_data_member_location: 24
 <2><30e>: Abbrev Number: 2 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x8e599): _data
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 162
    <315>   DW_AT_decl_column : 18
    <316>   DW_AT_type        : <0x501>
    <31a>   DW_AT_data_member_location: 28
 <2><31b>: Abbrev Number: 2 (DW_TAG_member)
    <31c>   DW_AT_name        : (indirect string, offset: 0x7e0ed): _cookie
    <320>   DW_AT_decl_file   : 7
    <321>   DW_AT_decl_line   : 166
    <322>   DW_AT_decl_column : 10
    <323>   DW_AT_type        : <0xbf>
    <327>   DW_AT_data_member_location: 32
 <2><328>: Abbrev Number: 2 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x6f62a): _read
    <32d>   DW_AT_decl_file   : 7
    <32e>   DW_AT_decl_line   : 168
    <32f>   DW_AT_decl_column : 29
    <330>   DW_AT_type        : <0x535>
    <334>   DW_AT_data_member_location: 36
 <2><335>: Abbrev Number: 2 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x11850): _write
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 170
    <33c>   DW_AT_decl_column : 29
    <33d>   DW_AT_type        : <0x55d>
    <341>   DW_AT_data_member_location: 40
 <2><342>: Abbrev Number: 2 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0x8b1df): _seek
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 173
    <349>   DW_AT_decl_column : 13
    <34a>   DW_AT_type        : <0x580>
    <34e>   DW_AT_data_member_location: 44
 <2><34f>: Abbrev Number: 2 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0x3d59d): _close
    <354>   DW_AT_decl_file   : 7
    <355>   DW_AT_decl_line   : 174
    <356>   DW_AT_decl_column : 9
    <357>   DW_AT_type        : <0x599>
    <35b>   DW_AT_data_member_location: 48
 <2><35c>: Abbrev Number: 9 (DW_TAG_member)
    <35d>   DW_AT_name        : _ub
    <361>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 177
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x284>
    <367>   DW_AT_data_member_location: 52
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : _up
    <36d>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 178
    <36e>   DW_AT_decl_column : 18
    <36f>   DW_AT_type        : <0x2aa>
    <373>   DW_AT_data_member_location: 60
 <2><374>: Abbrev Number: 9 (DW_TAG_member)
    <375>   DW_AT_name        : _ur
    <379>   DW_AT_decl_file   : 7
    <379>   DW_AT_decl_line   : 179
    <37a>   DW_AT_decl_column : 7
    <37b>   DW_AT_type        : <0x2a>
    <37f>   DW_AT_data_member_location: 64
 <2><380>: Abbrev Number: 2 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x26054): _ubuf
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 182
    <387>   DW_AT_decl_column : 17
    <388>   DW_AT_type        : <0x59e>
    <38c>   DW_AT_data_member_location: 68
 <2><38d>: Abbrev Number: 2 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x5f7d6): _nbuf
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 183
    <394>   DW_AT_decl_column : 17
    <395>   DW_AT_type        : <0x5ae>
    <399>   DW_AT_data_member_location: 71
 <2><39a>: Abbrev Number: 9 (DW_TAG_member)
    <39b>   DW_AT_name        : _lb
    <39f>   DW_AT_decl_file   : 7
    <39f>   DW_AT_decl_line   : 186
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0x284>
    <3a5>   DW_AT_data_member_location: 72
 <2><3a6>: Abbrev Number: 2 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x237a8): _blksize
    <3ab>   DW_AT_decl_file   : 7
    <3ac>   DW_AT_decl_line   : 189
    <3ad>   DW_AT_decl_column : 7
    <3ae>   DW_AT_type        : <0x2a>
    <3b2>   DW_AT_data_member_location: 80
 <2><3b3>: Abbrev Number: 2 (DW_TAG_member)
    <3b4>   DW_AT_name        : (indirect string, offset: 0xa0cc5): _offset
    <3b8>   DW_AT_decl_file   : 7
    <3b9>   DW_AT_decl_line   : 190
    <3ba>   DW_AT_decl_column : 10
    <3bb>   DW_AT_type        : <0xf2>
    <3bf>   DW_AT_data_member_location: 84
 <2><3c0>: Abbrev Number: 2 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x2b59d): _lock
    <3c5>   DW_AT_decl_file   : 7
    <3c6>   DW_AT_decl_line   : 197
    <3c7>   DW_AT_decl_column : 12
    <3c8>   DW_AT_type        : <0x18c>
    <3cc>   DW_AT_data_member_location: 88
 <2><3cd>: Abbrev Number: 2 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0xff70): _mbstate
    <3d2>   DW_AT_decl_file   : 7
    <3d3>   DW_AT_decl_line   : 199
    <3d4>   DW_AT_decl_column : 14
    <3d5>   DW_AT_type        : <0x15e>
    <3d9>   DW_AT_data_member_location: 92
 <2><3da>: Abbrev Number: 2 (DW_TAG_member)
    <3db>   DW_AT_name        : (indirect string, offset: 0x72b48): _flags2
    <3df>   DW_AT_decl_file   : 7
    <3e0>   DW_AT_decl_line   : 200
    <3e1>   DW_AT_decl_column : 9
    <3e2>   DW_AT_type        : <0x2a>
    <3e6>   DW_AT_data_member_location: 100
 <2><3e7>: Abbrev Number: 0
 <1><3e8>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x9dbf7): _reent
    <3ed>   DW_AT_byte_size   : 76
    <3ee>   DW_AT_decl_file   : 7
    <3ef>   DW_AT_decl_line   : 375
    <3f1>   DW_AT_decl_column : 8
    <3f2>   DW_AT_sibling     : <0x501>
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x98a09): _errno
    <3fb>   DW_AT_decl_file   : 7
    <3fc>   DW_AT_decl_line   : 379
    <3fe>   DW_AT_decl_column : 7
    <3ff>   DW_AT_type        : <0x2a>
    <403>   DW_AT_data_member_location: 0
 <2><404>: Abbrev Number: 1 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0x473df): _stdin
    <409>   DW_AT_decl_file   : 7
    <40a>   DW_AT_decl_line   : 384
    <40c>   DW_AT_decl_column : 11
    <40d>   DW_AT_type        : <0x5cb>
    <411>   DW_AT_data_member_location: 4
 <2><412>: Abbrev Number: 1 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0x60aa6): _stdout
    <417>   DW_AT_decl_file   : 7
    <418>   DW_AT_decl_line   : 384
    <41a>   DW_AT_decl_column : 20
    <41b>   DW_AT_type        : <0x5cb>
    <41f>   DW_AT_data_member_location: 8
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0x80ef1): _stderr
    <425>   DW_AT_decl_file   : 7
    <426>   DW_AT_decl_line   : 384
    <428>   DW_AT_decl_column : 30
    <429>   DW_AT_type        : <0x5cb>
    <42d>   DW_AT_data_member_location: 12
 <2><42e>: Abbrev Number: 1 (DW_TAG_member)
    <42f>   DW_AT_name        : (indirect string, offset: 0x58fbf): _inc
    <433>   DW_AT_decl_file   : 7
    <434>   DW_AT_decl_line   : 386
    <436>   DW_AT_decl_column : 8
    <437>   DW_AT_type        : <0x2a>
    <43b>   DW_AT_data_member_location: 16
 <2><43c>: Abbrev Number: 1 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x6f876): _emergency
    <441>   DW_AT_decl_file   : 7
    <442>   DW_AT_decl_line   : 388
    <444>   DW_AT_decl_column : 9
    <445>   DW_AT_type        : <0x524>
    <449>   DW_AT_data_member_location: 20
 <2><44a>: Abbrev Number: 1 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0x7d5a5): _locale
    <44f>   DW_AT_decl_file   : 7
    <450>   DW_AT_decl_line   : 394
    <452>   DW_AT_decl_column : 22
    <453>   DW_AT_type        : <0x731>
    <457>   DW_AT_data_member_location: 24
 <2><458>: Abbrev Number: 24 (DW_TAG_member)
    <459>   DW_AT_name        : _mp
    <45d>   DW_AT_decl_file   : 7
    <45e>   DW_AT_decl_line   : 396
    <460>   DW_AT_decl_column : 18
    <461>   DW_AT_type        : <0x736>
    <465>   DW_AT_data_member_location: 28
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x163b8): __cleanup
    <46b>   DW_AT_decl_file   : 7
    <46c>   DW_AT_decl_line   : 398
    <46e>   DW_AT_decl_column : 10
    <46f>   DW_AT_type        : <0x746>
    <473>   DW_AT_data_member_location: 32
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0x975a): _gamma_signgam
    <479>   DW_AT_decl_file   : 7
    <47a>   DW_AT_decl_line   : 400
    <47c>   DW_AT_decl_column : 7
    <47d>   DW_AT_type        : <0x2a>
    <481>   DW_AT_data_member_location: 36
 <2><482>: Abbrev Number: 1 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x67904): _cvtlen
    <487>   DW_AT_decl_file   : 7
    <488>   DW_AT_decl_line   : 403
    <48a>   DW_AT_decl_column : 7
    <48b>   DW_AT_type        : <0x2a>
    <48f>   DW_AT_data_member_location: 40
 <2><490>: Abbrev Number: 1 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x40d88): _cvtbuf
    <495>   DW_AT_decl_file   : 7
    <496>   DW_AT_decl_line   : 404
    <498>   DW_AT_decl_column : 9
    <499>   DW_AT_type        : <0x524>
    <49d>   DW_AT_data_member_location: 44
 <2><49e>: Abbrev Number: 1 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x697b3): _r48
    <4a3>   DW_AT_decl_file   : 7
    <4a4>   DW_AT_decl_line   : 406
    <4a6>   DW_AT_decl_column : 19
    <4a7>   DW_AT_type        : <0x74b>
    <4ab>   DW_AT_data_member_location: 48
 <2><4ac>: Abbrev Number: 1 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x7562a): _localtime_buf
    <4b1>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 407
    <4b4>   DW_AT_decl_column : 16
    <4b5>   DW_AT_type        : <0x750>
    <4b9>   DW_AT_data_member_location: 52
 <2><4ba>: Abbrev Number: 1 (DW_TAG_member)
    <4bb>   DW_AT_name        : (indirect string, offset: 0x21379): _asctime_buf
    <4bf>   DW_AT_decl_file   : 7
    <4c0>   DW_AT_decl_line   : 408
    <4c2>   DW_AT_decl_column : 9
    <4c3>   DW_AT_type        : <0x524>
    <4c7>   DW_AT_data_member_location: 56
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x6ec5): _sig_func
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 411
    <4d0>   DW_AT_decl_column : 12
    <4d1>   DW_AT_type        : <0x760>
    <4d5>   DW_AT_data_member_location: 60
 <2><4d6>: Abbrev Number: 1 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x25e54): __sf
    <4db>   DW_AT_decl_file   : 7
    <4dc>   DW_AT_decl_line   : 419
    <4de>   DW_AT_decl_column : 11
    <4df>   DW_AT_type        : <0x5cb>
    <4e3>   DW_AT_data_member_location: 64
 <2><4e4>: Abbrev Number: 1 (DW_TAG_member)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x3f335): _misc
    <4e9>   DW_AT_decl_file   : 7
    <4ea>   DW_AT_decl_line   : 420
    <4ec>   DW_AT_decl_column : 23
    <4ed>   DW_AT_type        : <0x76a>
    <4f1>   DW_AT_data_member_location: 68
 <2><4f2>: Abbrev Number: 1 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x57802): _signal_buf
    <4f7>   DW_AT_decl_file   : 7
    <4f8>   DW_AT_decl_line   : 421
    <4fa>   DW_AT_decl_column : 9
    <4fb>   DW_AT_type        : <0x524>
    <4ff>   DW_AT_data_member_location: 72
 <2><500>: Abbrev Number: 0
 <1><501>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <502>   DW_AT_byte_size   : 4
    <502>   DW_AT_type        : <0x3e8>
 <1><506>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <507>   DW_AT_prototyped  : 1
    <507>   DW_AT_type        : <0x2a>
    <50b>   DW_AT_sibling     : <0x524>
 <2><50f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <510>   DW_AT_type        : <0x501>
 <2><514>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <515>   DW_AT_type        : <0xbf>
 <2><519>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <51a>   DW_AT_type        : <0x524>
 <2><51e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <51f>   DW_AT_type        : <0x2a>
 <2><523>: Abbrev Number: 0
 <1><524>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <525>   DW_AT_byte_size   : 4
    <525>   DW_AT_type        : <0x529>
 <1><529>: Abbrev Number: 6 (DW_TAG_base_type)
    <52a>   DW_AT_byte_size   : 1
    <52b>   DW_AT_encoding    : 8	(unsigned char)
    <52c>   DW_AT_name        : (indirect string, offset: 0x2d5fa): char
 <1><530>: Abbrev Number: 25 (DW_TAG_const_type)
    <531>   DW_AT_type        : <0x529>
 <1><535>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <536>   DW_AT_byte_size   : 4
    <536>   DW_AT_type        : <0x506>
 <1><53a>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <53b>   DW_AT_prototyped  : 1
    <53b>   DW_AT_type        : <0x2a>
    <53f>   DW_AT_sibling     : <0x558>
 <2><543>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <544>   DW_AT_type        : <0x501>
 <2><548>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <549>   DW_AT_type        : <0xbf>
 <2><54d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <54e>   DW_AT_type        : <0x558>
 <2><552>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <553>   DW_AT_type        : <0x2a>
 <2><557>: Abbrev Number: 0
 <1><558>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <559>   DW_AT_byte_size   : 4
    <559>   DW_AT_type        : <0x530>
 <1><55d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <55e>   DW_AT_byte_size   : 4
    <55e>   DW_AT_type        : <0x53a>
 <1><562>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <563>   DW_AT_prototyped  : 1
    <563>   DW_AT_type        : <0xfe>
    <567>   DW_AT_sibling     : <0x580>
 <2><56b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <56c>   DW_AT_type        : <0x501>
 <2><570>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <571>   DW_AT_type        : <0xbf>
 <2><575>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <576>   DW_AT_type        : <0xfe>
 <2><57a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <57b>   DW_AT_type        : <0x2a>
 <2><57f>: Abbrev Number: 0
 <1><580>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <581>   DW_AT_byte_size   : 4
    <581>   DW_AT_type        : <0x562>
 <1><585>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <586>   DW_AT_prototyped  : 1
    <586>   DW_AT_type        : <0x2a>
    <58a>   DW_AT_sibling     : <0x599>
 <2><58e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <58f>   DW_AT_type        : <0x501>
 <2><593>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <594>   DW_AT_type        : <0xbf>
 <2><598>: Abbrev Number: 0
 <1><599>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <59a>   DW_AT_byte_size   : 4
    <59a>   DW_AT_type        : <0x585>
 <1><59e>: Abbrev Number: 7 (DW_TAG_array_type)
    <59f>   DW_AT_type        : <0x59>
    <5a3>   DW_AT_sibling     : <0x5ae>
 <2><5a7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5a8>   DW_AT_type        : <0x31>
    <5ac>   DW_AT_upper_bound : 2
 <2><5ad>: Abbrev Number: 0
 <1><5ae>: Abbrev Number: 7 (DW_TAG_array_type)
    <5af>   DW_AT_type        : <0x59>
    <5b3>   DW_AT_sibling     : <0x5be>
 <2><5b7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5b8>   DW_AT_type        : <0x31>
    <5bc>   DW_AT_upper_bound : 0
 <2><5bd>: Abbrev Number: 0
 <1><5be>: Abbrev Number: 11 (DW_TAG_typedef)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x593f1): __FILE
    <5c3>   DW_AT_decl_file   : 7
    <5c4>   DW_AT_decl_line   : 269
    <5c6>   DW_AT_decl_column : 26
    <5c7>   DW_AT_type        : <0x2af>
 <1><5cb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <5cc>   DW_AT_byte_size   : 4
    <5cc>   DW_AT_type        : <0x5be>
 <1><5d0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x3089b): _rand48
    <5d5>   DW_AT_byte_size   : 24
    <5d6>   DW_AT_decl_file   : 7
    <5d7>   DW_AT_decl_line   : 305
    <5d9>   DW_AT_decl_column : 8
    <5da>   DW_AT_sibling     : <0x617>
 <2><5de>: Abbrev Number: 1 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x28a25): _seed
    <5e3>   DW_AT_decl_file   : 7
    <5e4>   DW_AT_decl_line   : 306
    <5e6>   DW_AT_decl_column : 18
    <5e7>   DW_AT_type        : <0x617>
    <5eb>   DW_AT_data_member_location: 0
 <2><5ec>: Abbrev Number: 1 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xb720): _mult
    <5f1>   DW_AT_decl_file   : 7
    <5f2>   DW_AT_decl_line   : 307
    <5f4>   DW_AT_decl_column : 18
    <5f5>   DW_AT_type        : <0x617>
    <5f9>   DW_AT_data_member_location: 6
 <2><5fa>: Abbrev Number: 1 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x48841): _add
    <5ff>   DW_AT_decl_file   : 7
    <600>   DW_AT_decl_line   : 308
    <602>   DW_AT_decl_column : 18
    <603>   DW_AT_type        : <0x73>
    <607>   DW_AT_data_member_location: 12
 <2><608>: Abbrev Number: 1 (DW_TAG_member)
    <609>   DW_AT_name        : (indirect string, offset: 0x53c31): _rand_next
    <60d>   DW_AT_decl_file   : 7
    <60e>   DW_AT_decl_line   : 311
    <610>   DW_AT_decl_column : 36
    <611>   DW_AT_type        : <0x94>
    <615>   DW_AT_data_member_location: 16
 <2><616>: Abbrev Number: 0
 <1><617>: Abbrev Number: 7 (DW_TAG_array_type)
    <618>   DW_AT_type        : <0x73>
    <61c>   DW_AT_sibling     : <0x627>
 <2><620>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <621>   DW_AT_type        : <0x31>
    <625>   DW_AT_upper_bound : 2
 <2><626>: Abbrev Number: 0
 <1><627>: Abbrev Number: 10 (DW_TAG_structure_type)
    <628>   DW_AT_name        : (indirect string, offset: 0x6b702): _mprec
    <62c>   DW_AT_byte_size   : 16
    <62d>   DW_AT_decl_file   : 7
    <62e>   DW_AT_decl_line   : 347
    <630>   DW_AT_decl_column : 8
    <631>   DW_AT_sibling     : <0x66e>
 <2><635>: Abbrev Number: 1 (DW_TAG_member)
    <636>   DW_AT_name        : (indirect string, offset: 0x8d2c1): _result
    <63a>   DW_AT_decl_file   : 7
    <63b>   DW_AT_decl_line   : 350
    <63d>   DW_AT_decl_column : 19
    <63e>   DW_AT_type        : <0x1ee>
    <642>   DW_AT_data_member_location: 0
 <2><643>: Abbrev Number: 1 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x6b289): _result_k
    <648>   DW_AT_decl_file   : 7
    <649>   DW_AT_decl_line   : 351
    <64b>   DW_AT_decl_column : 7
    <64c>   DW_AT_type        : <0x2a>
    <650>   DW_AT_data_member_location: 4
 <2><651>: Abbrev Number: 1 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x42f56): _p5s
    <656>   DW_AT_decl_file   : 7
    <657>   DW_AT_decl_line   : 352
    <659>   DW_AT_decl_column : 19
    <65a>   DW_AT_type        : <0x1ee>
    <65e>   DW_AT_data_member_location: 8
 <2><65f>: Abbrev Number: 1 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x5172e): _freelist
    <664>   DW_AT_decl_file   : 7
    <665>   DW_AT_decl_line   : 353
    <667>   DW_AT_decl_column : 20
    <668>   DW_AT_type        : <0x66e>
    <66c>   DW_AT_data_member_location: 12
 <2><66d>: Abbrev Number: 0
 <1><66e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <66f>   DW_AT_byte_size   : 4
    <66f>   DW_AT_type        : <0x1ee>
 <1><673>: Abbrev Number: 10 (DW_TAG_structure_type)
    <674>   DW_AT_name        : (indirect string, offset: 0x42efa): _misc_reent
    <678>   DW_AT_byte_size   : 80
    <679>   DW_AT_decl_file   : 7
    <67a>   DW_AT_decl_line   : 357
    <67c>   DW_AT_decl_column : 8
    <67d>   DW_AT_sibling     : <0x71c>
 <2><681>: Abbrev Number: 1 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x816bf): _strtok_last
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 360
    <689>   DW_AT_decl_column : 9
    <68a>   DW_AT_type        : <0x524>
    <68e>   DW_AT_data_member_location: 0
 <2><68f>: Abbrev Number: 1 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x3cf59): _mblen_state
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 361
    <697>   DW_AT_decl_column : 14
    <698>   DW_AT_type        : <0x15e>
    <69c>   DW_AT_data_member_location: 4
 <2><69d>: Abbrev Number: 1 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x816ee): _wctomb_state
    <6a2>   DW_AT_decl_file   : 7
    <6a3>   DW_AT_decl_line   : 362
    <6a5>   DW_AT_decl_column : 14
    <6a6>   DW_AT_type        : <0x15e>
    <6aa>   DW_AT_data_member_location: 12
 <2><6ab>: Abbrev Number: 1 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x7868b): _mbtowc_state
    <6b0>   DW_AT_decl_file   : 7
    <6b1>   DW_AT_decl_line   : 363
    <6b3>   DW_AT_decl_column : 14
    <6b4>   DW_AT_type        : <0x15e>
    <6b8>   DW_AT_data_member_location: 20
 <2><6b9>: Abbrev Number: 1 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x47685): _l64a_buf
    <6be>   DW_AT_decl_file   : 7
    <6bf>   DW_AT_decl_line   : 364
    <6c1>   DW_AT_decl_column : 8
    <6c2>   DW_AT_type        : <0x71c>
    <6c6>   DW_AT_data_member_location: 28
 <2><6c7>: Abbrev Number: 1 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x80728): _getdate_err
    <6cc>   DW_AT_decl_file   : 7
    <6cd>   DW_AT_decl_line   : 365
    <6cf>   DW_AT_decl_column : 7
    <6d0>   DW_AT_type        : <0x2a>
    <6d4>   DW_AT_data_member_location: 36
 <2><6d5>: Abbrev Number: 1 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x43e6a): _mbrlen_state
    <6da>   DW_AT_decl_file   : 7
    <6db>   DW_AT_decl_line   : 366
    <6dd>   DW_AT_decl_column : 14
    <6de>   DW_AT_type        : <0x15e>
    <6e2>   DW_AT_data_member_location: 40
 <2><6e3>: Abbrev Number: 1 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x1ee04): _mbrtowc_state
    <6e8>   DW_AT_decl_file   : 7
    <6e9>   DW_AT_decl_line   : 367
    <6eb>   DW_AT_decl_column : 14
    <6ec>   DW_AT_type        : <0x15e>
    <6f0>   DW_AT_data_member_location: 48
 <2><6f1>: Abbrev Number: 1 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x5cdba): _mbsrtowcs_state
    <6f6>   DW_AT_decl_file   : 7
    <6f7>   DW_AT_decl_line   : 368
    <6f9>   DW_AT_decl_column : 14
    <6fa>   DW_AT_type        : <0x15e>
    <6fe>   DW_AT_data_member_location: 56
 <2><6ff>: Abbrev Number: 1 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0x2b29e): _wcrtomb_state
    <704>   DW_AT_decl_file   : 7
    <705>   DW_AT_decl_line   : 369
    <707>   DW_AT_decl_column : 14
    <708>   DW_AT_type        : <0x15e>
    <70c>   DW_AT_data_member_location: 64
 <2><70d>: Abbrev Number: 1 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0x502f9): _wcsrtombs_state
    <712>   DW_AT_decl_file   : 7
    <713>   DW_AT_decl_line   : 370
    <715>   DW_AT_decl_column : 14
    <716>   DW_AT_type        : <0x15e>
    <71a>   DW_AT_data_member_location: 72
 <2><71b>: Abbrev Number: 0
 <1><71c>: Abbrev Number: 7 (DW_TAG_array_type)
    <71d>   DW_AT_type        : <0x529>
    <721>   DW_AT_sibling     : <0x72c>
 <2><725>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <726>   DW_AT_type        : <0x31>
    <72a>   DW_AT_upper_bound : 7
 <2><72b>: Abbrev Number: 0
 <1><72c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <72d>   DW_AT_name        : (indirect string, offset: 0x78f9f): __locale_t
    <731>   DW_AT_declaration : 1
 <1><731>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <732>   DW_AT_byte_size   : 4
    <732>   DW_AT_type        : <0x72c>
 <1><736>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <737>   DW_AT_byte_size   : 4
    <737>   DW_AT_type        : <0x627>
 <1><73b>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <73c>   DW_AT_prototyped  : 1
    <73c>   DW_AT_sibling     : <0x746>
 <2><740>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <741>   DW_AT_type        : <0x501>
 <2><745>: Abbrev Number: 0
 <1><746>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <747>   DW_AT_byte_size   : 4
    <747>   DW_AT_type        : <0x73b>
 <1><74b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <74c>   DW_AT_byte_size   : 4
    <74c>   DW_AT_type        : <0x5d0>
 <1><750>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <751>   DW_AT_byte_size   : 4
    <751>   DW_AT_type        : <0x203>
 <1><755>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <756>   DW_AT_prototyped  : 1
    <756>   DW_AT_sibling     : <0x760>
 <2><75a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <75b>   DW_AT_type        : <0x2a>
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <761>   DW_AT_byte_size   : 4
    <761>   DW_AT_type        : <0x765>
 <1><765>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <766>   DW_AT_byte_size   : 4
    <766>   DW_AT_type        : <0x755>
 <1><76a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <76b>   DW_AT_byte_size   : 4
    <76b>   DW_AT_type        : <0x673>
 <1><76f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <770>   DW_AT_name        : (indirect string, offset: 0x76045): xSTATIC_LIST_ITEM
    <774>   DW_AT_byte_size   : 20
    <775>   DW_AT_decl_file   : 9
    <776>   DW_AT_decl_line   : 1061
    <778>   DW_AT_decl_column : 8
    <779>   DW_AT_sibling     : <0x79a>
 <2><77d>: Abbrev Number: 1 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0x8f66e): xDummy2
    <782>   DW_AT_decl_file   : 9
    <783>   DW_AT_decl_line   : 1066
    <785>   DW_AT_decl_column : 13
    <786>   DW_AT_type        : <0xd9>
    <78a>   DW_AT_data_member_location: 0
 <2><78b>: Abbrev Number: 1 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x323ea): pvDummy3
    <790>   DW_AT_decl_file   : 9
    <791>   DW_AT_decl_line   : 1067
    <793>   DW_AT_decl_column : 8
    <794>   DW_AT_type        : <0x79a>
    <798>   DW_AT_data_member_location: 4
 <2><799>: Abbrev Number: 0
 <1><79a>: Abbrev Number: 7 (DW_TAG_array_type)
    <79b>   DW_AT_type        : <0xbf>
    <79f>   DW_AT_sibling     : <0x7aa>
 <2><7a3>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <7a4>   DW_AT_type        : <0x31>
    <7a8>   DW_AT_upper_bound : 3
 <2><7a9>: Abbrev Number: 0
 <1><7aa>: Abbrev Number: 11 (DW_TAG_typedef)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x32657): StaticListItem_t
    <7af>   DW_AT_decl_file   : 9
    <7b0>   DW_AT_decl_line   : 1072
    <7b2>   DW_AT_decl_column : 34
    <7b3>   DW_AT_type        : <0x76f>
 <1><7b7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7b8>   DW_AT_name        : (indirect string, offset: 0x50b85): xSTATIC_TCB
    <7bc>   DW_AT_byte_size   : 160
    <7bd>   DW_AT_decl_file   : 9
    <7be>   DW_AT_decl_line   : 1112
    <7c0>   DW_AT_decl_column : 16
    <7c1>   DW_AT_sibling     : <0x852>
 <2><7c5>: Abbrev Number: 1 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x1cd05): pxDummy1
    <7ca>   DW_AT_decl_file   : 9
    <7cb>   DW_AT_decl_line   : 1114
    <7cd>   DW_AT_decl_column : 11
    <7ce>   DW_AT_type        : <0xbf>
    <7d2>   DW_AT_data_member_location: 0
 <2><7d3>: Abbrev Number: 1 (DW_TAG_member)
    <7d4>   DW_AT_name        : (indirect string, offset: 0x1b14d): xDummy3
    <7d8>   DW_AT_decl_file   : 9
    <7d9>   DW_AT_decl_line   : 1118
    <7db>   DW_AT_decl_column : 19
    <7dc>   DW_AT_type        : <0x852>
    <7e0>   DW_AT_data_member_location: 4
 <2><7e1>: Abbrev Number: 1 (DW_TAG_member)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x139a3): uxDummy5
    <7e6>   DW_AT_decl_file   : 9
    <7e7>   DW_AT_decl_line   : 1119
    <7e9>   DW_AT_decl_column : 16
    <7ea>   DW_AT_type        : <0xcd>
    <7ee>   DW_AT_data_member_location: 44
 <2><7ef>: Abbrev Number: 1 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x1cd28): pxDummy6
    <7f4>   DW_AT_decl_file   : 9
    <7f5>   DW_AT_decl_line   : 1120
    <7f7>   DW_AT_decl_column : 11
    <7f8>   DW_AT_type        : <0xbf>
    <7fc>   DW_AT_data_member_location: 48
 <2><7fd>: Abbrev Number: 1 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x31509): ucDummy7
    <802>   DW_AT_decl_file   : 9
    <803>   DW_AT_decl_line   : 1121
    <805>   DW_AT_decl_column : 13
    <806>   DW_AT_type        : <0x862>
    <80a>   DW_AT_data_member_location: 52
 <2><80b>: Abbrev Number: 1 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x7fbe4): uxDummy12
    <810>   DW_AT_decl_file   : 9
    <811>   DW_AT_decl_line   : 1132
    <813>   DW_AT_decl_column : 16
    <814>   DW_AT_type        : <0x872>
    <818>   DW_AT_data_member_location: 68
 <2><819>: Abbrev Number: 1 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0x709ba): xDummy17
    <81e>   DW_AT_decl_file   : 9
    <81f>   DW_AT_decl_line   : 1144
    <821>   DW_AT_decl_column : 17
    <822>   DW_AT_type        : <0x3e8>
    <826>   DW_AT_data_member_location: 76
 <2><827>: Abbrev Number: 1 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x149db): ulDummy18
    <82c>   DW_AT_decl_file   : 9
    <82d>   DW_AT_decl_line   : 1147
    <82f>   DW_AT_decl_column : 14
    <830>   DW_AT_type        : <0xb3>
    <834>   DW_AT_data_member_location: 152
 <2><835>: Abbrev Number: 1 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x8b31c): ucDummy19
    <83a>   DW_AT_decl_file   : 9
    <83b>   DW_AT_decl_line   : 1148
    <83d>   DW_AT_decl_column : 13
    <83e>   DW_AT_type        : <0x9b>
    <842>   DW_AT_data_member_location: 156
 <2><843>: Abbrev Number: 1 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x7ff66): uxDummy20
    <848>   DW_AT_decl_file   : 9
    <849>   DW_AT_decl_line   : 1151
    <84b>   DW_AT_decl_column : 13
    <84c>   DW_AT_type        : <0x9b>
    <850>   DW_AT_data_member_location: 157
 <2><851>: Abbrev Number: 0
 <1><852>: Abbrev Number: 7 (DW_TAG_array_type)
    <853>   DW_AT_type        : <0x7aa>
    <857>   DW_AT_sibling     : <0x862>
 <2><85b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <85c>   DW_AT_type        : <0x31>
    <860>   DW_AT_upper_bound : 1
 <2><861>: Abbrev Number: 0
 <1><862>: Abbrev Number: 7 (DW_TAG_array_type)
    <863>   DW_AT_type        : <0x9b>
    <867>   DW_AT_sibling     : <0x872>
 <2><86b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <86c>   DW_AT_type        : <0x31>
    <870>   DW_AT_upper_bound : 15
 <2><871>: Abbrev Number: 0
 <1><872>: Abbrev Number: 7 (DW_TAG_array_type)
    <873>   DW_AT_type        : <0xcd>
    <877>   DW_AT_sibling     : <0x882>
 <2><87b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <87c>   DW_AT_type        : <0x31>
    <880>   DW_AT_upper_bound : 1
 <2><881>: Abbrev Number: 0
 <1><882>: Abbrev Number: 11 (DW_TAG_typedef)
    <883>   DW_AT_name        : (indirect string, offset: 0x458af): StaticTask_t
    <887>   DW_AT_decl_file   : 9
    <888>   DW_AT_decl_line   : 1160
    <88a>   DW_AT_decl_column : 3
    <88b>   DW_AT_type        : <0x7b7>
 <1><88f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <890>   DW_AT_byte_size   : 4
    <890>   DW_AT_type        : <0xc1>
 <1><894>: Abbrev Number: 18 (DW_TAG_variable)
    <895>   DW_AT_name        : (indirect string, offset: 0x4a39b): xIdleTaskTCBBuffer
    <899>   DW_AT_decl_file   : 1
    <899>   DW_AT_decl_line   : 59
    <89a>   DW_AT_decl_column : 21
    <89b>   DW_AT_type        : <0x882>
    <89f>   DW_AT_location    : 5 byte block: 3 b0 7 0 20 	(DW_OP_addr: 200007b0)
 <1><8a5>: Abbrev Number: 7 (DW_TAG_array_type)
    <8a6>   DW_AT_type        : <0xc1>
    <8aa>   DW_AT_sibling     : <0x8b5>
 <2><8ae>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <8af>   DW_AT_type        : <0x31>
    <8b3>   DW_AT_upper_bound : 127
 <2><8b4>: Abbrev Number: 0
 <1><8b5>: Abbrev Number: 18 (DW_TAG_variable)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x3442a): xIdleStack
    <8ba>   DW_AT_decl_file   : 1
    <8ba>   DW_AT_decl_line   : 60
    <8bb>   DW_AT_decl_column : 20
    <8bc>   DW_AT_type        : <0x8a5>
    <8c0>   DW_AT_location    : 5 byte block: 3 50 8 0 20 	(DW_OP_addr: 20000850)
 <1><8c6>: Abbrev Number: 26 (DW_TAG_subprogram)
    <8c7>   DW_AT_external    : 1
    <8c7>   DW_AT_name        : (indirect string, offset: 0xe809): vApplicationGetIdleTaskMemory
    <8cb>   DW_AT_decl_file   : 1
    <8cc>   DW_AT_decl_line   : 62
    <8cd>   DW_AT_decl_column : 6
    <8ce>   DW_AT_prototyped  : 1
    <8ce>   DW_AT_low_pc      : 0x8000dac
    <8d2>   DW_AT_high_pc     : 0x34
    <8d6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8d8>   DW_AT_call_all_calls: 1
    <8d8>   DW_AT_sibling     : <0x904>
 <2><8dc>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x4a399): ppxIdleTaskTCBBuffer
    <8e1>   DW_AT_decl_file   : 1
    <8e1>   DW_AT_decl_line   : 62
    <8e1>   DW_AT_decl_column : 52
    <8e2>   DW_AT_type        : <0x904>
    <8e6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8e9>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x51991): ppxIdleTaskStackBuffer
    <8ee>   DW_AT_decl_file   : 1
    <8ee>   DW_AT_decl_line   : 62
    <8ee>   DW_AT_decl_column : 88
    <8ef>   DW_AT_type        : <0x90e>
    <8f3>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><8f6>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x56a36): pulIdleTaskStackSize
    <8fb>   DW_AT_decl_file   : 1
    <8fb>   DW_AT_decl_line   : 62
    <8fb>   DW_AT_decl_column : 122
    <8fc>   DW_AT_type        : <0x913>
    <900>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><903>: Abbrev Number: 0
 <1><904>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <905>   DW_AT_byte_size   : 4
    <905>   DW_AT_type        : <0x909>
 <1><909>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <90a>   DW_AT_byte_size   : 4
    <90a>   DW_AT_type        : <0x882>
 <1><90e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <90f>   DW_AT_byte_size   : 4
    <90f>   DW_AT_type        : <0x88f>
 <1><913>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <914>   DW_AT_byte_size   : 4
    <914>   DW_AT_type        : <0xb3>
 <1><918>: Abbrev Number: 0
  Compilation Unit @ offset 0x919:
   Length:        0x30c7 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x16f
   Pointer Size:  4
 <0><925>: Abbrev Number: 55 (DW_TAG_compile_unit)
    <926>   DW_AT_producer    : (indirect string, offset: 0x33b81): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <92a>   DW_AT_language    : 29	(C11)
    <92b>   DW_AT_name        : (indirect string, offset: 0x96d1e): ../Core/Src/main.c
    <92f>   DW_AT_comp_dir    : (indirect string, offset: 0x851dd): E:/sbzrgn/My-STM32_Discoveries/STM32F411_Discovery/STM32F411Discovery_CubeAI_GestureRecognition_MPU9250_AHRS_FreeRTOS/CubeAI_GestureRecognition_MPU9250_AHRS_FreeRTOS/Debug
    <933>   DW_AT_ranges      : 0x1f
    <937>   DW_AT_low_pc      : 0
    <93b>   DW_AT_stmt_list   : 0x9a2
    <93f>   DW_AT_macros      : 0x154c2
 <1><943>: Abbrev Number: 18 (DW_TAG_base_type)
    <944>   DW_AT_byte_size   : 1
    <945>   DW_AT_encoding    : 6	(signed char)
    <946>   DW_AT_name        : (indirect string, offset: 0x46862): signed char
 <1><94a>: Abbrev Number: 6 (DW_TAG_typedef)
    <94b>   DW_AT_name        : (indirect string, offset: 0x2887f): __uint8_t
    <94f>   DW_AT_decl_file   : 4
    <950>   DW_AT_decl_line   : 43
    <951>   DW_AT_decl_column : 24
    <952>   DW_AT_type        : <0x956>
 <1><956>: Abbrev Number: 18 (DW_TAG_base_type)
    <957>   DW_AT_byte_size   : 1
    <958>   DW_AT_encoding    : 8	(unsigned char)
    <959>   DW_AT_name        : (indirect string, offset: 0x1ccf7): unsigned char
 <1><95d>: Abbrev Number: 6 (DW_TAG_typedef)
    <95e>   DW_AT_name        : (indirect string, offset: 0x95f32): __int16_t
    <962>   DW_AT_decl_file   : 4
    <963>   DW_AT_decl_line   : 55
    <964>   DW_AT_decl_column : 24
    <965>   DW_AT_type        : <0x969>
 <1><969>: Abbrev Number: 18 (DW_TAG_base_type)
    <96a>   DW_AT_byte_size   : 2
    <96b>   DW_AT_encoding    : 5	(signed)
    <96c>   DW_AT_name        : (indirect string, offset: 0x69366): short int
 <1><970>: Abbrev Number: 6 (DW_TAG_typedef)
    <971>   DW_AT_name        : (indirect string, offset: 0x732e9): __uint16_t
    <975>   DW_AT_decl_file   : 4
    <976>   DW_AT_decl_line   : 57
    <977>   DW_AT_decl_column : 25
    <978>   DW_AT_type        : <0x97c>
 <1><97c>: Abbrev Number: 18 (DW_TAG_base_type)
    <97d>   DW_AT_byte_size   : 2
    <97e>   DW_AT_encoding    : 7	(unsigned)
    <97f>   DW_AT_name        : (indirect string, offset: 0x87ab7): short unsigned int
 <1><983>: Abbrev Number: 6 (DW_TAG_typedef)
    <984>   DW_AT_name        : (indirect string, offset: 0x941be): __int32_t
    <988>   DW_AT_decl_file   : 4
    <989>   DW_AT_decl_line   : 77
    <98a>   DW_AT_decl_column : 24
    <98b>   DW_AT_type        : <0x98f>
 <1><98f>: Abbrev Number: 18 (DW_TAG_base_type)
    <990>   DW_AT_byte_size   : 4
    <991>   DW_AT_encoding    : 5	(signed)
    <992>   DW_AT_name        : (indirect string, offset: 0xb8e3): long int
 <1><996>: Abbrev Number: 6 (DW_TAG_typedef)
    <997>   DW_AT_name        : (indirect string, offset: 0x5964a): __uint32_t
    <99b>   DW_AT_decl_file   : 4
    <99c>   DW_AT_decl_line   : 79
    <99d>   DW_AT_decl_column : 25
    <99e>   DW_AT_type        : <0x9a2>
 <1><9a2>: Abbrev Number: 18 (DW_TAG_base_type)
    <9a3>   DW_AT_byte_size   : 4
    <9a4>   DW_AT_encoding    : 7	(unsigned)
    <9a5>   DW_AT_name        : (indirect string, offset: 0x2b36a): long unsigned int
 <1><9a9>: Abbrev Number: 18 (DW_TAG_base_type)
    <9aa>   DW_AT_byte_size   : 8
    <9ab>   DW_AT_encoding    : 5	(signed)
    <9ac>   DW_AT_name        : (indirect string, offset: 0x3fe84): long long int
 <1><9b0>: Abbrev Number: 6 (DW_TAG_typedef)
    <9b1>   DW_AT_name        : (indirect string, offset: 0x92842): __uint64_t
    <9b5>   DW_AT_decl_file   : 4
    <9b6>   DW_AT_decl_line   : 105
    <9b7>   DW_AT_decl_column : 25
    <9b8>   DW_AT_type        : <0x9bc>
 <1><9bc>: Abbrev Number: 18 (DW_TAG_base_type)
    <9bd>   DW_AT_byte_size   : 8
    <9be>   DW_AT_encoding    : 7	(unsigned)
    <9bf>   DW_AT_name        : (indirect string, offset: 0x1d61c): long long unsigned int
 <1><9c3>: Abbrev Number: 56 (DW_TAG_base_type)
    <9c4>   DW_AT_byte_size   : 4
    <9c5>   DW_AT_encoding    : 5	(signed)
    <9c6>   DW_AT_name        : int
 <1><9ca>: Abbrev Number: 18 (DW_TAG_base_type)
    <9cb>   DW_AT_byte_size   : 4
    <9cc>   DW_AT_encoding    : 7	(unsigned)
    <9cd>   DW_AT_name        : (indirect string, offset: 0xb37f): unsigned int
 <1><9d1>: Abbrev Number: 6 (DW_TAG_typedef)
    <9d2>   DW_AT_name        : (indirect string, offset: 0x28881): uint8_t
    <9d6>   DW_AT_decl_file   : 5
    <9d7>   DW_AT_decl_line   : 24
    <9d8>   DW_AT_decl_column : 19
    <9d9>   DW_AT_type        : <0x94a>
 <1><9dd>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <9de>   DW_AT_type        : <0x9d1>
 <1><9e2>: Abbrev Number: 22 (DW_TAG_const_type)
    <9e3>   DW_AT_type        : <0x9d1>
 <1><9e7>: Abbrev Number: 6 (DW_TAG_typedef)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x95f34): int16_t
    <9ec>   DW_AT_decl_file   : 5
    <9ed>   DW_AT_decl_line   : 32
    <9ee>   DW_AT_decl_column : 19
    <9ef>   DW_AT_type        : <0x95d>
 <1><9f3>: Abbrev Number: 6 (DW_TAG_typedef)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x66b70): uint16_t
    <9f8>   DW_AT_decl_file   : 5
    <9f9>   DW_AT_decl_line   : 36
    <9fa>   DW_AT_decl_column : 20
    <9fb>   DW_AT_type        : <0x970>
 <1><9ff>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <a00>   DW_AT_type        : <0x9f3>
 <1><a04>: Abbrev Number: 6 (DW_TAG_typedef)
    <a05>   DW_AT_name        : (indirect string, offset: 0x941c0): int32_t
    <a09>   DW_AT_decl_file   : 5
    <a0a>   DW_AT_decl_line   : 44
    <a0b>   DW_AT_decl_column : 19
    <a0c>   DW_AT_type        : <0x983>
 <1><a10>: Abbrev Number: 6 (DW_TAG_typedef)
    <a11>   DW_AT_name        : (indirect string, offset: 0x6642d): uint32_t
    <a15>   DW_AT_decl_file   : 5
    <a16>   DW_AT_decl_line   : 48
    <a17>   DW_AT_decl_column : 20
    <a18>   DW_AT_type        : <0x996>
 <1><a1c>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <a1d>   DW_AT_type        : <0xa10>
 <1><a21>: Abbrev Number: 22 (DW_TAG_const_type)
    <a22>   DW_AT_type        : <0xa1c>
 <1><a26>: Abbrev Number: 6 (DW_TAG_typedef)
    <a27>   DW_AT_name        : (indirect string, offset: 0x92844): uint64_t
    <a2b>   DW_AT_decl_file   : 5
    <a2c>   DW_AT_decl_line   : 60
    <a2d>   DW_AT_decl_column : 20
    <a2e>   DW_AT_type        : <0x9b0>
 <1><a32>: Abbrev Number: 8 (DW_TAG_array_type)
    <a33>   DW_AT_type        : <0xa10>
    <a37>   DW_AT_sibling     : <0xa42>
 <2><a3b>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <a3c>   DW_AT_type        : <0x9ca>
    <a40>   DW_AT_upper_bound : 0
 <2><a41>: Abbrev Number: 0
 <1><a42>: Abbrev Number: 28 (DW_TAG_union_type)
    <a43>   DW_AT_byte_size   : 4
    <a44>   DW_AT_decl_file   : 2
    <a45>   DW_AT_decl_line   : 818
    <a47>   DW_AT_decl_column : 9
    <a48>   DW_AT_sibling     : <0xa73>
 <2><a4c>: Abbrev Number: 29 (DW_TAG_member)
    <a4d>   DW_AT_name        : u8
    <a50>   DW_AT_decl_file   : 2
    <a51>   DW_AT_decl_line   : 820
    <a53>   DW_AT_decl_column : 22
    <a54>   DW_AT_type        : <0x9dd>
 <2><a58>: Abbrev Number: 29 (DW_TAG_member)
    <a59>   DW_AT_name        : u16
    <a5d>   DW_AT_decl_file   : 2
    <a5e>   DW_AT_decl_line   : 821
    <a60>   DW_AT_decl_column : 22
    <a61>   DW_AT_type        : <0x9ff>
 <2><a65>: Abbrev Number: 29 (DW_TAG_member)
    <a66>   DW_AT_name        : u32
    <a6a>   DW_AT_decl_file   : 2
    <a6b>   DW_AT_decl_line   : 822
    <a6d>   DW_AT_decl_column : 22
    <a6e>   DW_AT_type        : <0xa1c>
 <2><a72>: Abbrev Number: 0
 <1><a73>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <a74>   DW_AT_type        : <0xa42>
 <1><a78>: Abbrev Number: 57 (DW_TAG_structure_type)
    <a79>   DW_AT_byte_size   : 4096
    <a7b>   DW_AT_decl_file   : 2
    <a7c>   DW_AT_decl_line   : 816
    <a7e>   DW_AT_decl_column : 9
    <a7f>   DW_AT_sibling     : <0xbbe>
 <2><a83>: Abbrev Number: 1 (DW_TAG_member)
    <a84>   DW_AT_name        : (indirect string, offset: 0x92d57): PORT
    <a88>   DW_AT_decl_file   : 2
    <a89>   DW_AT_decl_line   : 823
    <a8b>   DW_AT_decl_column : 6
    <a8c>   DW_AT_type        : <0xbce>
    <a90>   DW_AT_data_member_location: 0
 <2><a91>: Abbrev Number: 1 (DW_TAG_member)
    <a92>   DW_AT_name        : (indirect string, offset: 0x976d4): RESERVED0
    <a96>   DW_AT_decl_file   : 2
    <a97>   DW_AT_decl_line   : 824
    <a99>   DW_AT_decl_column : 18
    <a9a>   DW_AT_type        : <0xbd3>
    <a9e>   DW_AT_data_member_location: 128
 <2><a9f>: Abbrev Number: 30 (DW_TAG_member)
    <aa0>   DW_AT_name        : TER
    <aa4>   DW_AT_decl_file   : 2
    <aa4>   DW_AT_decl_line   : 825
    <aa6>   DW_AT_decl_column : 18
    <aa6>   DW_AT_type        : <0xa1c>
    <aaa>   DW_AT_data_member_location: 3584
 <2><aac>: Abbrev Number: 14 (DW_TAG_member)
    <aad>   DW_AT_name        : (indirect string, offset: 0x976de): RESERVED1
    <ab1>   DW_AT_decl_file   : 2
    <ab1>   DW_AT_decl_line   : 826
    <ab3>   DW_AT_decl_column : 18
    <ab3>   DW_AT_type        : <0xbe4>
    <ab7>   DW_AT_data_member_location: 3588
 <2><ab9>: Abbrev Number: 30 (DW_TAG_member)
    <aba>   DW_AT_name        : TPR
    <abe>   DW_AT_decl_file   : 2
    <abe>   DW_AT_decl_line   : 827
    <ac0>   DW_AT_decl_column : 18
    <ac0>   DW_AT_type        : <0xa1c>
    <ac4>   DW_AT_data_member_location: 3648
 <2><ac6>: Abbrev Number: 14 (DW_TAG_member)
    <ac7>   DW_AT_name        : (indirect string, offset: 0x976e8): RESERVED2
    <acb>   DW_AT_decl_file   : 2
    <acb>   DW_AT_decl_line   : 828
    <acd>   DW_AT_decl_column : 18
    <acd>   DW_AT_type        : <0xbe4>
    <ad1>   DW_AT_data_member_location: 3652
 <2><ad3>: Abbrev Number: 30 (DW_TAG_member)
    <ad4>   DW_AT_name        : TCR
    <ad8>   DW_AT_decl_file   : 2
    <ad8>   DW_AT_decl_line   : 829
    <ada>   DW_AT_decl_column : 18
    <ada>   DW_AT_type        : <0xa1c>
    <ade>   DW_AT_data_member_location: 3712
 <2><ae0>: Abbrev Number: 14 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0x976f2): RESERVED3
    <ae5>   DW_AT_decl_file   : 2
    <ae5>   DW_AT_decl_line   : 830
    <ae7>   DW_AT_decl_column : 18
    <ae7>   DW_AT_type        : <0xbf4>
    <aeb>   DW_AT_data_member_location: 3716
 <2><aed>: Abbrev Number: 14 (DW_TAG_member)
    <aee>   DW_AT_name        : (indirect string, offset: 0x976fc): RESERVED4
    <af2>   DW_AT_decl_file   : 2
    <af2>   DW_AT_decl_line   : 831
    <af4>   DW_AT_decl_column : 18
    <af4>   DW_AT_type        : <0xc04>
    <af8>   DW_AT_data_member_location: 3844
 <2><afa>: Abbrev Number: 30 (DW_TAG_member)
    <afb>   DW_AT_name        : LAR
    <aff>   DW_AT_decl_file   : 2
    <aff>   DW_AT_decl_line   : 832
    <b01>   DW_AT_decl_column : 18
    <b01>   DW_AT_type        : <0xa1c>
    <b05>   DW_AT_data_member_location: 4016
 <2><b07>: Abbrev Number: 30 (DW_TAG_member)
    <b08>   DW_AT_name        : LSR
    <b0c>   DW_AT_decl_file   : 2
    <b0c>   DW_AT_decl_line   : 833
    <b0e>   DW_AT_decl_column : 18
    <b0e>   DW_AT_type        : <0xa21>
    <b12>   DW_AT_data_member_location: 4020
 <2><b14>: Abbrev Number: 14 (DW_TAG_member)
    <b15>   DW_AT_name        : (indirect string, offset: 0x97706): RESERVED5
    <b19>   DW_AT_decl_file   : 2
    <b19>   DW_AT_decl_line   : 834
    <b1b>   DW_AT_decl_column : 18
    <b1b>   DW_AT_type        : <0xc14>
    <b1f>   DW_AT_data_member_location: 4024
 <2><b21>: Abbrev Number: 14 (DW_TAG_member)
    <b22>   DW_AT_name        : (indirect string, offset: 0x91d2c): PID4
    <b26>   DW_AT_decl_file   : 2
    <b26>   DW_AT_decl_line   : 835
    <b28>   DW_AT_decl_column : 18
    <b28>   DW_AT_type        : <0xa21>
    <b2c>   DW_AT_data_member_location: 4048
 <2><b2e>: Abbrev Number: 14 (DW_TAG_member)
    <b2f>   DW_AT_name        : (indirect string, offset: 0x8fc98): PID5
    <b33>   DW_AT_decl_file   : 2
    <b33>   DW_AT_decl_line   : 836
    <b35>   DW_AT_decl_column : 18
    <b35>   DW_AT_type        : <0xa21>
    <b39>   DW_AT_data_member_location: 4052
 <2><b3b>: Abbrev Number: 14 (DW_TAG_member)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x91d31): PID6
    <b40>   DW_AT_decl_file   : 2
    <b40>   DW_AT_decl_line   : 837
    <b42>   DW_AT_decl_column : 18
    <b42>   DW_AT_type        : <0xa21>
    <b46>   DW_AT_data_member_location: 4056
 <2><b48>: Abbrev Number: 14 (DW_TAG_member)
    <b49>   DW_AT_name        : (indirect string, offset: 0x91d36): PID7
    <b4d>   DW_AT_decl_file   : 2
    <b4d>   DW_AT_decl_line   : 838
    <b4f>   DW_AT_decl_column : 18
    <b4f>   DW_AT_type        : <0xa21>
    <b53>   DW_AT_data_member_location: 4060
 <2><b55>: Abbrev Number: 14 (DW_TAG_member)
    <b56>   DW_AT_name        : (indirect string, offset: 0x95e89): PID0
    <b5a>   DW_AT_decl_file   : 2
    <b5a>   DW_AT_decl_line   : 839
    <b5c>   DW_AT_decl_column : 18
    <b5c>   DW_AT_type        : <0xa21>
    <b60>   DW_AT_data_member_location: 4064
 <2><b62>: Abbrev Number: 14 (DW_TAG_member)
    <b63>   DW_AT_name        : (indirect string, offset: 0x91d22): PID1
    <b67>   DW_AT_decl_file   : 2
    <b67>   DW_AT_decl_line   : 840
    <b69>   DW_AT_decl_column : 18
    <b69>   DW_AT_type        : <0xa21>
    <b6d>   DW_AT_data_member_location: 4068
 <2><b6f>: Abbrev Number: 14 (DW_TAG_member)
    <b70>   DW_AT_name        : (indirect string, offset: 0x95efb): PID2
    <b74>   DW_AT_decl_file   : 2
    <b74>   DW_AT_decl_line   : 841
    <b76>   DW_AT_decl_column : 18
    <b76>   DW_AT_type        : <0xa21>
    <b7a>   DW_AT_data_member_location: 4072
 <2><b7c>: Abbrev Number: 14 (DW_TAG_member)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x91d27): PID3
    <b81>   DW_AT_decl_file   : 2
    <b81>   DW_AT_decl_line   : 842
    <b83>   DW_AT_decl_column : 18
    <b83>   DW_AT_type        : <0xa21>
    <b87>   DW_AT_data_member_location: 4076
 <2><b89>: Abbrev Number: 14 (DW_TAG_member)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x8e220): CID0
    <b8e>   DW_AT_decl_file   : 2
    <b8e>   DW_AT_decl_line   : 843
    <b90>   DW_AT_decl_column : 18
    <b90>   DW_AT_type        : <0xa21>
    <b94>   DW_AT_data_member_location: 4080
 <2><b96>: Abbrev Number: 14 (DW_TAG_member)
    <b97>   DW_AT_name        : (indirect string, offset: 0x8e225): CID1
    <b9b>   DW_AT_decl_file   : 2
    <b9b>   DW_AT_decl_line   : 844
    <b9d>   DW_AT_decl_column : 18
    <b9d>   DW_AT_type        : <0xa21>
    <ba1>   DW_AT_data_member_location: 4084
 <2><ba3>: Abbrev Number: 14 (DW_TAG_member)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x8e22a): CID2
    <ba8>   DW_AT_decl_file   : 2
    <ba8>   DW_AT_decl_line   : 845
    <baa>   DW_AT_decl_column : 18
    <baa>   DW_AT_type        : <0xa21>
    <bae>   DW_AT_data_member_location: 4088
 <2><bb0>: Abbrev Number: 14 (DW_TAG_member)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x8e22f): CID3
    <bb5>   DW_AT_decl_file   : 2
    <bb5>   DW_AT_decl_line   : 846
    <bb7>   DW_AT_decl_column : 18
    <bb7>   DW_AT_type        : <0xa21>
    <bbb>   DW_AT_data_member_location: 4092
 <2><bbd>: Abbrev Number: 0
 <1><bbe>: Abbrev Number: 8 (DW_TAG_array_type)
    <bbf>   DW_AT_type        : <0xa73>
    <bc3>   DW_AT_sibling     : <0xbce>
 <2><bc7>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <bc8>   DW_AT_type        : <0x9ca>
    <bcc>   DW_AT_upper_bound : 31
 <2><bcd>: Abbrev Number: 0
 <1><bce>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <bcf>   DW_AT_type        : <0xbbe>
 <1><bd3>: Abbrev Number: 8 (DW_TAG_array_type)
    <bd4>   DW_AT_type        : <0xa10>
    <bd8>   DW_AT_sibling     : <0xbe4>
 <2><bdc>: Abbrev Number: 45 (DW_TAG_subrange_type)
    <bdd>   DW_AT_type        : <0x9ca>
    <be1>   DW_AT_upper_bound : 863
 <2><be3>: Abbrev Number: 0
 <1><be4>: Abbrev Number: 8 (DW_TAG_array_type)
    <be5>   DW_AT_type        : <0xa10>
    <be9>   DW_AT_sibling     : <0xbf4>
 <2><bed>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <bee>   DW_AT_type        : <0x9ca>
    <bf2>   DW_AT_upper_bound : 14
 <2><bf3>: Abbrev Number: 0
 <1><bf4>: Abbrev Number: 8 (DW_TAG_array_type)
    <bf5>   DW_AT_type        : <0xa10>
    <bf9>   DW_AT_sibling     : <0xc04>
 <2><bfd>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <bfe>   DW_AT_type        : <0x9ca>
    <c02>   DW_AT_upper_bound : 31
 <2><c03>: Abbrev Number: 0
 <1><c04>: Abbrev Number: 8 (DW_TAG_array_type)
    <c05>   DW_AT_type        : <0xa10>
    <c09>   DW_AT_sibling     : <0xc14>
 <2><c0d>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c0e>   DW_AT_type        : <0x9ca>
    <c12>   DW_AT_upper_bound : 42
 <2><c13>: Abbrev Number: 0
 <1><c14>: Abbrev Number: 8 (DW_TAG_array_type)
    <c15>   DW_AT_type        : <0xa10>
    <c19>   DW_AT_sibling     : <0xc24>
 <2><c1d>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c1e>   DW_AT_type        : <0x9ca>
    <c22>   DW_AT_upper_bound : 5
 <2><c23>: Abbrev Number: 0
 <1><c24>: Abbrev Number: 7 (DW_TAG_typedef)
    <c25>   DW_AT_name        : (indirect string, offset: 0x9619a): ITM_Type
    <c29>   DW_AT_decl_file   : 2
    <c2a>   DW_AT_decl_line   : 847
    <c2c>   DW_AT_decl_column : 3
    <c2d>   DW_AT_type        : <0xa78>
 <1><c31>: Abbrev Number: 8 (DW_TAG_array_type)
    <c32>   DW_AT_type        : <0xa10>
    <c36>   DW_AT_sibling     : <0xc41>
 <2><c3a>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c3b>   DW_AT_type        : <0x9ca>
    <c3f>   DW_AT_upper_bound : 1
 <2><c40>: Abbrev Number: 0
 <1><c41>: Abbrev Number: 19 (DW_TAG_structure_type)
    <c42>   DW_AT_byte_size   : 12
    <c43>   DW_AT_decl_file   : 6
    <c44>   DW_AT_decl_line   : 188
    <c45>   DW_AT_decl_column : 9
    <c45>   DW_AT_sibling     : <0xc89>
 <2><c49>: Abbrev Number: 13 (DW_TAG_member)
    <c4a>   DW_AT_name        : DR
    <c4d>   DW_AT_decl_file   : 6
    <c4e>   DW_AT_decl_line   : 190
    <c4f>   DW_AT_decl_column : 17
    <c50>   DW_AT_type        : <0xa1c>
    <c54>   DW_AT_data_member_location: 0
 <2><c55>: Abbrev Number: 13 (DW_TAG_member)
    <c56>   DW_AT_name        : IDR
    <c5a>   DW_AT_decl_file   : 6
    <c5b>   DW_AT_decl_line   : 191
    <c5c>   DW_AT_decl_column : 17
    <c5d>   DW_AT_type        : <0x9dd>
    <c61>   DW_AT_data_member_location: 4
 <2><c62>: Abbrev Number: 2 (DW_TAG_member)
    <c63>   DW_AT_name        : (indirect string, offset: 0x976d4): RESERVED0
    <c67>   DW_AT_decl_file   : 6
    <c68>   DW_AT_decl_line   : 192
    <c69>   DW_AT_decl_column : 17
    <c6a>   DW_AT_type        : <0x9d1>
    <c6e>   DW_AT_data_member_location: 5
 <2><c6f>: Abbrev Number: 2 (DW_TAG_member)
    <c70>   DW_AT_name        : (indirect string, offset: 0x976de): RESERVED1
    <c74>   DW_AT_decl_file   : 6
    <c75>   DW_AT_decl_line   : 193
    <c76>   DW_AT_decl_column : 17
    <c77>   DW_AT_type        : <0x9f3>
    <c7b>   DW_AT_data_member_location: 6
 <2><c7c>: Abbrev Number: 13 (DW_TAG_member)
    <c7d>   DW_AT_name        : CR
    <c80>   DW_AT_decl_file   : 6
    <c81>   DW_AT_decl_line   : 194
    <c82>   DW_AT_decl_column : 17
    <c83>   DW_AT_type        : <0xa1c>
    <c87>   DW_AT_data_member_location: 8
 <2><c88>: Abbrev Number: 0
 <1><c89>: Abbrev Number: 6 (DW_TAG_typedef)
    <c8a>   DW_AT_name        : (indirect string, offset: 0x91856): CRC_TypeDef
    <c8e>   DW_AT_decl_file   : 6
    <c8f>   DW_AT_decl_line   : 195
    <c90>   DW_AT_decl_column : 3
    <c91>   DW_AT_type        : <0xc41>
 <1><c95>: Abbrev Number: 19 (DW_TAG_structure_type)
    <c96>   DW_AT_byte_size   : 24
    <c97>   DW_AT_decl_file   : 6
    <c98>   DW_AT_decl_line   : 214
    <c99>   DW_AT_decl_column : 9
    <c99>   DW_AT_sibling     : <0xceb>
 <2><c9d>: Abbrev Number: 13 (DW_TAG_member)
    <c9e>   DW_AT_name        : CR
    <ca1>   DW_AT_decl_file   : 6
    <ca2>   DW_AT_decl_line   : 216
    <ca3>   DW_AT_decl_column : 17
    <ca4>   DW_AT_type        : <0xa1c>
    <ca8>   DW_AT_data_member_location: 0
 <2><ca9>: Abbrev Number: 2 (DW_TAG_member)
    <caa>   DW_AT_name        : (indirect string, offset: 0x92cc1): NDTR
    <cae>   DW_AT_decl_file   : 6
    <caf>   DW_AT_decl_line   : 217
    <cb0>   DW_AT_decl_column : 17
    <cb1>   DW_AT_type        : <0xa1c>
    <cb5>   DW_AT_data_member_location: 4
 <2><cb6>: Abbrev Number: 13 (DW_TAG_member)
    <cb7>   DW_AT_name        : PAR
    <cbb>   DW_AT_decl_file   : 6
    <cbc>   DW_AT_decl_line   : 218
    <cbd>   DW_AT_decl_column : 17
    <cbe>   DW_AT_type        : <0xa1c>
    <cc2>   DW_AT_data_member_location: 8
 <2><cc3>: Abbrev Number: 2 (DW_TAG_member)
    <cc4>   DW_AT_name        : (indirect string, offset: 0x921c7): M0AR
    <cc8>   DW_AT_decl_file   : 6
    <cc9>   DW_AT_decl_line   : 219
    <cca>   DW_AT_decl_column : 17
    <ccb>   DW_AT_type        : <0xa1c>
    <ccf>   DW_AT_data_member_location: 12
 <2><cd0>: Abbrev Number: 2 (DW_TAG_member)
    <cd1>   DW_AT_name        : (indirect string, offset: 0x8f1e5): M1AR
    <cd5>   DW_AT_decl_file   : 6
    <cd6>   DW_AT_decl_line   : 220
    <cd7>   DW_AT_decl_column : 17
    <cd8>   DW_AT_type        : <0xa1c>
    <cdc>   DW_AT_data_member_location: 16
 <2><cdd>: Abbrev Number: 13 (DW_TAG_member)
    <cde>   DW_AT_name        : FCR
    <ce2>   DW_AT_decl_file   : 6
    <ce3>   DW_AT_decl_line   : 221
    <ce4>   DW_AT_decl_column : 17
    <ce5>   DW_AT_type        : <0xa1c>
    <ce9>   DW_AT_data_member_location: 20
 <2><cea>: Abbrev Number: 0
 <1><ceb>: Abbrev Number: 6 (DW_TAG_typedef)
    <cec>   DW_AT_name        : (indirect string, offset: 0x96f15): DMA_Stream_TypeDef
    <cf0>   DW_AT_decl_file   : 6
    <cf1>   DW_AT_decl_line   : 222
    <cf2>   DW_AT_decl_column : 3
    <cf3>   DW_AT_type        : <0xc95>
 <1><cf7>: Abbrev Number: 21 (DW_TAG_structure_type)
    <cf8>   DW_AT_byte_size   : 40
    <cf9>   DW_AT_decl_file   : 6
    <cfa>   DW_AT_decl_line   : 265
    <cfc>   DW_AT_decl_column : 9
    <cfd>   DW_AT_sibling     : <0xd80>
 <2><d01>: Abbrev Number: 1 (DW_TAG_member)
    <d02>   DW_AT_name        : (indirect string, offset: 0x8e1e4): MODER
    <d06>   DW_AT_decl_file   : 6
    <d07>   DW_AT_decl_line   : 267
    <d09>   DW_AT_decl_column : 17
    <d0a>   DW_AT_type        : <0xa1c>
    <d0e>   DW_AT_data_member_location: 0
 <2><d0f>: Abbrev Number: 1 (DW_TAG_member)
    <d10>   DW_AT_name        : (indirect string, offset: 0x95b70): OTYPER
    <d14>   DW_AT_decl_file   : 6
    <d15>   DW_AT_decl_line   : 268
    <d17>   DW_AT_decl_column : 17
    <d18>   DW_AT_type        : <0xa1c>
    <d1c>   DW_AT_data_member_location: 4
 <2><d1d>: Abbrev Number: 1 (DW_TAG_member)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x96a12): OSPEEDR
    <d22>   DW_AT_decl_file   : 6
    <d23>   DW_AT_decl_line   : 269
    <d25>   DW_AT_decl_column : 17
    <d26>   DW_AT_type        : <0xa1c>
    <d2a>   DW_AT_data_member_location: 8
 <2><d2b>: Abbrev Number: 1 (DW_TAG_member)
    <d2c>   DW_AT_name        : (indirect string, offset: 0x8fc92): PUPDR
    <d30>   DW_AT_decl_file   : 6
    <d31>   DW_AT_decl_line   : 270
    <d33>   DW_AT_decl_column : 17
    <d34>   DW_AT_type        : <0xa1c>
    <d38>   DW_AT_data_member_location: 12
 <2><d39>: Abbrev Number: 10 (DW_TAG_member)
    <d3a>   DW_AT_name        : IDR
    <d3e>   DW_AT_decl_file   : 6
    <d3f>   DW_AT_decl_line   : 271
    <d41>   DW_AT_decl_column : 17
    <d42>   DW_AT_type        : <0xa1c>
    <d46>   DW_AT_data_member_location: 16
 <2><d47>: Abbrev Number: 10 (DW_TAG_member)
    <d48>   DW_AT_name        : ODR
    <d4c>   DW_AT_decl_file   : 6
    <d4d>   DW_AT_decl_line   : 272
    <d4f>   DW_AT_decl_column : 17
    <d50>   DW_AT_type        : <0xa1c>
    <d54>   DW_AT_data_member_location: 20
 <2><d55>: Abbrev Number: 1 (DW_TAG_member)
    <d56>   DW_AT_name        : (indirect string, offset: 0x903e7): BSRR
    <d5a>   DW_AT_decl_file   : 6
    <d5b>   DW_AT_decl_line   : 273
    <d5d>   DW_AT_decl_column : 17
    <d5e>   DW_AT_type        : <0xa1c>
    <d62>   DW_AT_data_member_location: 24
 <2><d63>: Abbrev Number: 1 (DW_TAG_member)
    <d64>   DW_AT_name        : (indirect string, offset: 0x96828): LCKR
    <d68>   DW_AT_decl_file   : 6
    <d69>   DW_AT_decl_line   : 274
    <d6b>   DW_AT_decl_column : 17
    <d6c>   DW_AT_type        : <0xa1c>
    <d70>   DW_AT_data_member_location: 28
 <2><d71>: Abbrev Number: 10 (DW_TAG_member)
    <d72>   DW_AT_name        : AFR
    <d76>   DW_AT_decl_file   : 6
    <d77>   DW_AT_decl_line   : 275
    <d79>   DW_AT_decl_column : 17
    <d7a>   DW_AT_type        : <0xd90>
    <d7e>   DW_AT_data_member_location: 32
 <2><d7f>: Abbrev Number: 0
 <1><d80>: Abbrev Number: 8 (DW_TAG_array_type)
    <d81>   DW_AT_type        : <0xa1c>
    <d85>   DW_AT_sibling     : <0xd90>
 <2><d89>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <d8a>   DW_AT_type        : <0x9ca>
    <d8e>   DW_AT_upper_bound : 1
 <2><d8f>: Abbrev Number: 0
 <1><d90>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <d91>   DW_AT_type        : <0xd80>
 <1><d95>: Abbrev Number: 7 (DW_TAG_typedef)
    <d96>   DW_AT_name        : (indirect string, offset: 0x97c91): GPIO_TypeDef
    <d9a>   DW_AT_decl_file   : 6
    <d9b>   DW_AT_decl_line   : 276
    <d9d>   DW_AT_decl_column : 3
    <d9e>   DW_AT_type        : <0xcf7>
 <1><da2>: Abbrev Number: 21 (DW_TAG_structure_type)
    <da3>   DW_AT_byte_size   : 8
    <da4>   DW_AT_decl_file   : 6
    <da5>   DW_AT_decl_line   : 326
    <da7>   DW_AT_decl_column : 9
    <da8>   DW_AT_sibling     : <0xdc8>
 <2><dac>: Abbrev Number: 10 (DW_TAG_member)
    <dad>   DW_AT_name        : CR
    <db0>   DW_AT_decl_file   : 6
    <db1>   DW_AT_decl_line   : 328
    <db3>   DW_AT_decl_column : 17
    <db4>   DW_AT_type        : <0xa1c>
    <db8>   DW_AT_data_member_location: 0
 <2><db9>: Abbrev Number: 10 (DW_TAG_member)
    <dba>   DW_AT_name        : CSR
    <dbe>   DW_AT_decl_file   : 6
    <dbf>   DW_AT_decl_line   : 329
    <dc1>   DW_AT_decl_column : 17
    <dc2>   DW_AT_type        : <0xa1c>
    <dc6>   DW_AT_data_member_location: 4
 <2><dc7>: Abbrev Number: 0
 <1><dc8>: Abbrev Number: 7 (DW_TAG_typedef)
    <dc9>   DW_AT_name        : (indirect string, offset: 0x954e6): PWR_TypeDef
    <dcd>   DW_AT_decl_file   : 6
    <dce>   DW_AT_decl_line   : 330
    <dd0>   DW_AT_decl_column : 3
    <dd1>   DW_AT_type        : <0xda2>
 <1><dd5>: Abbrev Number: 21 (DW_TAG_structure_type)
    <dd6>   DW_AT_byte_size   : 144
    <dd7>   DW_AT_decl_file   : 6
    <dd8>   DW_AT_decl_line   : 336
    <dda>   DW_AT_decl_column : 9
    <ddb>   DW_AT_sibling     : <0xf9f>
 <2><ddf>: Abbrev Number: 10 (DW_TAG_member)
    <de0>   DW_AT_name        : CR
    <de3>   DW_AT_decl_file   : 6
    <de4>   DW_AT_decl_line   : 338
    <de6>   DW_AT_decl_column : 17
    <de7>   DW_AT_type        : <0xa1c>
    <deb>   DW_AT_data_member_location: 0
 <2><dec>: Abbrev Number: 1 (DW_TAG_member)
    <ded>   DW_AT_name        : (indirect string, offset: 0x95087): PLLCFGR
    <df1>   DW_AT_decl_file   : 6
    <df2>   DW_AT_decl_line   : 339
    <df4>   DW_AT_decl_column : 17
    <df5>   DW_AT_type        : <0xa1c>
    <df9>   DW_AT_data_member_location: 4
 <2><dfa>: Abbrev Number: 1 (DW_TAG_member)
    <dfb>   DW_AT_name        : (indirect string, offset: 0x92450): CFGR
    <dff>   DW_AT_decl_file   : 6
    <e00>   DW_AT_decl_line   : 340
    <e02>   DW_AT_decl_column : 17
    <e03>   DW_AT_type        : <0xa1c>
    <e07>   DW_AT_data_member_location: 8
 <2><e08>: Abbrev Number: 10 (DW_TAG_member)
    <e09>   DW_AT_name        : CIR
    <e0d>   DW_AT_decl_file   : 6
    <e0e>   DW_AT_decl_line   : 341
    <e10>   DW_AT_decl_column : 17
    <e11>   DW_AT_type        : <0xa1c>
    <e15>   DW_AT_data_member_location: 12
 <2><e16>: Abbrev Number: 1 (DW_TAG_member)
    <e17>   DW_AT_name        : (indirect string, offset: 0x95f46): AHB1RSTR
    <e1b>   DW_AT_decl_file   : 6
    <e1c>   DW_AT_decl_line   : 342
    <e1e>   DW_AT_decl_column : 17
    <e1f>   DW_AT_type        : <0xa1c>
    <e23>   DW_AT_data_member_location: 16
 <2><e24>: Abbrev Number: 1 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0x8f350): AHB2RSTR
    <e29>   DW_AT_decl_file   : 6
    <e2a>   DW_AT_decl_line   : 343
    <e2c>   DW_AT_decl_column : 17
    <e2d>   DW_AT_type        : <0xa1c>
    <e31>   DW_AT_data_member_location: 20
 <2><e32>: Abbrev Number: 1 (DW_TAG_member)
    <e33>   DW_AT_name        : (indirect string, offset: 0x92444): AHB3RSTR
    <e37>   DW_AT_decl_file   : 6
    <e38>   DW_AT_decl_line   : 344
    <e3a>   DW_AT_decl_column : 17
    <e3b>   DW_AT_type        : <0xa1c>
    <e3f>   DW_AT_data_member_location: 24
 <2><e40>: Abbrev Number: 1 (DW_TAG_member)
    <e41>   DW_AT_name        : (indirect string, offset: 0x976d4): RESERVED0
    <e45>   DW_AT_decl_file   : 6
    <e46>   DW_AT_decl_line   : 345
    <e48>   DW_AT_decl_column : 17
    <e49>   DW_AT_type        : <0xa10>
    <e4d>   DW_AT_data_member_location: 28
 <2><e4e>: Abbrev Number: 1 (DW_TAG_member)
    <e4f>   DW_AT_name        : (indirect string, offset: 0x8f32f): APB1RSTR
    <e53>   DW_AT_decl_file   : 6
    <e54>   DW_AT_decl_line   : 346
    <e56>   DW_AT_decl_column : 17
    <e57>   DW_AT_type        : <0xa1c>
    <e5b>   DW_AT_data_member_location: 32
 <2><e5c>: Abbrev Number: 1 (DW_TAG_member)
    <e5d>   DW_AT_name        : (indirect string, offset: 0x92411): APB2RSTR
    <e61>   DW_AT_decl_file   : 6
    <e62>   DW_AT_decl_line   : 347
    <e64>   DW_AT_decl_column : 17
    <e65>   DW_AT_type        : <0xa1c>
    <e69>   DW_AT_data_member_location: 36
 <2><e6a>: Abbrev Number: 1 (DW_TAG_member)
    <e6b>   DW_AT_name        : (indirect string, offset: 0x976de): RESERVED1
    <e6f>   DW_AT_decl_file   : 6
    <e70>   DW_AT_decl_line   : 348
    <e72>   DW_AT_decl_column : 17
    <e73>   DW_AT_type        : <0xc31>
    <e77>   DW_AT_data_member_location: 40
 <2><e78>: Abbrev Number: 1 (DW_TAG_member)
    <e79>   DW_AT_name        : (indirect string, offset: 0x8efca): AHB1ENR
    <e7d>   DW_AT_decl_file   : 6
    <e7e>   DW_AT_decl_line   : 349
    <e80>   DW_AT_decl_column : 17
    <e81>   DW_AT_type        : <0xa1c>
    <e85>   DW_AT_data_member_location: 48
 <2><e86>: Abbrev Number: 1 (DW_TAG_member)
    <e87>   DW_AT_name        : (indirect string, offset: 0x90810): AHB2ENR
    <e8b>   DW_AT_decl_file   : 6
    <e8c>   DW_AT_decl_line   : 350
    <e8e>   DW_AT_decl_column : 17
    <e8f>   DW_AT_type        : <0xa1c>
    <e93>   DW_AT_data_member_location: 52
 <2><e94>: Abbrev Number: 1 (DW_TAG_member)
    <e95>   DW_AT_name        : (indirect string, offset: 0x9268b): AHB3ENR
    <e99>   DW_AT_decl_file   : 6
    <e9a>   DW_AT_decl_line   : 351
    <e9c>   DW_AT_decl_column : 17
    <e9d>   DW_AT_type        : <0xa1c>
    <ea1>   DW_AT_data_member_location: 56
 <2><ea2>: Abbrev Number: 1 (DW_TAG_member)
    <ea3>   DW_AT_name        : (indirect string, offset: 0x976e8): RESERVED2
    <ea7>   DW_AT_decl_file   : 6
    <ea8>   DW_AT_decl_line   : 352
    <eaa>   DW_AT_decl_column : 17
    <eab>   DW_AT_type        : <0xa10>
    <eaf>   DW_AT_data_member_location: 60
 <2><eb0>: Abbrev Number: 1 (DW_TAG_member)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x9585a): APB1ENR
    <eb5>   DW_AT_decl_file   : 6
    <eb6>   DW_AT_decl_line   : 353
    <eb8>   DW_AT_decl_column : 17
    <eb9>   DW_AT_type        : <0xa1c>
    <ebd>   DW_AT_data_member_location: 64
 <2><ebe>: Abbrev Number: 1 (DW_TAG_member)
    <ebf>   DW_AT_name        : (indirect string, offset: 0x8f3a6): APB2ENR
    <ec3>   DW_AT_decl_file   : 6
    <ec4>   DW_AT_decl_line   : 354
    <ec6>   DW_AT_decl_column : 17
    <ec7>   DW_AT_type        : <0xa1c>
    <ecb>   DW_AT_data_member_location: 68
 <2><ecc>: Abbrev Number: 1 (DW_TAG_member)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x976f2): RESERVED3
    <ed1>   DW_AT_decl_file   : 6
    <ed2>   DW_AT_decl_line   : 355
    <ed4>   DW_AT_decl_column : 17
    <ed5>   DW_AT_type        : <0xc31>
    <ed9>   DW_AT_data_member_location: 72
 <2><eda>: Abbrev Number: 1 (DW_TAG_member)
    <edb>   DW_AT_name        : (indirect string, offset: 0x92dcf): AHB1LPENR
    <edf>   DW_AT_decl_file   : 6
    <ee0>   DW_AT_decl_line   : 356
    <ee2>   DW_AT_decl_column : 17
    <ee3>   DW_AT_type        : <0xa1c>
    <ee7>   DW_AT_data_member_location: 80
 <2><ee8>: Abbrev Number: 1 (DW_TAG_member)
    <ee9>   DW_AT_name        : (indirect string, offset: 0x9039b): AHB2LPENR
    <eed>   DW_AT_decl_file   : 6
    <eee>   DW_AT_decl_line   : 357
    <ef0>   DW_AT_decl_column : 17
    <ef1>   DW_AT_type        : <0xa1c>
    <ef5>   DW_AT_data_member_location: 84
 <2><ef6>: Abbrev Number: 1 (DW_TAG_member)
    <ef7>   DW_AT_name        : (indirect string, offset: 0x94aae): AHB3LPENR
    <efb>   DW_AT_decl_file   : 6
    <efc>   DW_AT_decl_line   : 358
    <efe>   DW_AT_decl_column : 17
    <eff>   DW_AT_type        : <0xa1c>
    <f03>   DW_AT_data_member_location: 88
 <2><f04>: Abbrev Number: 1 (DW_TAG_member)
    <f05>   DW_AT_name        : (indirect string, offset: 0x976fc): RESERVED4
    <f09>   DW_AT_decl_file   : 6
    <f0a>   DW_AT_decl_line   : 359
    <f0c>   DW_AT_decl_column : 17
    <f0d>   DW_AT_type        : <0xa10>
    <f11>   DW_AT_data_member_location: 92
 <2><f12>: Abbrev Number: 1 (DW_TAG_member)
    <f13>   DW_AT_name        : (indirect string, offset: 0x94906): APB1LPENR
    <f17>   DW_AT_decl_file   : 6
    <f18>   DW_AT_decl_line   : 360
    <f1a>   DW_AT_decl_column : 17
    <f1b>   DW_AT_type        : <0xa1c>
    <f1f>   DW_AT_data_member_location: 96
 <2><f20>: Abbrev Number: 1 (DW_TAG_member)
    <f21>   DW_AT_name        : (indirect string, offset: 0x8ee08): APB2LPENR
    <f25>   DW_AT_decl_file   : 6
    <f26>   DW_AT_decl_line   : 361
    <f28>   DW_AT_decl_column : 17
    <f29>   DW_AT_type        : <0xa1c>
    <f2d>   DW_AT_data_member_location: 100
 <2><f2e>: Abbrev Number: 1 (DW_TAG_member)
    <f2f>   DW_AT_name        : (indirect string, offset: 0x97706): RESERVED5
    <f33>   DW_AT_decl_file   : 6
    <f34>   DW_AT_decl_line   : 362
    <f36>   DW_AT_decl_column : 17
    <f37>   DW_AT_type        : <0xc31>
    <f3b>   DW_AT_data_member_location: 104
 <2><f3c>: Abbrev Number: 1 (DW_TAG_member)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x8f6b8): BDCR
    <f41>   DW_AT_decl_file   : 6
    <f42>   DW_AT_decl_line   : 363
    <f44>   DW_AT_decl_column : 17
    <f45>   DW_AT_type        : <0xa1c>
    <f49>   DW_AT_data_member_location: 112
 <2><f4a>: Abbrev Number: 10 (DW_TAG_member)
    <f4b>   DW_AT_name        : CSR
    <f4f>   DW_AT_decl_file   : 6
    <f50>   DW_AT_decl_line   : 364
    <f52>   DW_AT_decl_column : 17
    <f53>   DW_AT_type        : <0xa1c>
    <f57>   DW_AT_data_member_location: 116
 <2><f58>: Abbrev Number: 1 (DW_TAG_member)
    <f59>   DW_AT_name        : (indirect string, offset: 0x97710): RESERVED6
    <f5d>   DW_AT_decl_file   : 6
    <f5e>   DW_AT_decl_line   : 365
    <f60>   DW_AT_decl_column : 17
    <f61>   DW_AT_type        : <0xc31>
    <f65>   DW_AT_data_member_location: 120
 <2><f66>: Abbrev Number: 1 (DW_TAG_member)
    <f67>   DW_AT_name        : (indirect string, offset: 0x9324f): SSCGR
    <f6b>   DW_AT_decl_file   : 6
    <f6c>   DW_AT_decl_line   : 366
    <f6e>   DW_AT_decl_column : 17
    <f6f>   DW_AT_type        : <0xa1c>
    <f73>   DW_AT_data_member_location: 128
 <2><f74>: Abbrev Number: 1 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0x91391): PLLI2SCFGR
    <f79>   DW_AT_decl_file   : 6
    <f7a>   DW_AT_decl_line   : 367
    <f7c>   DW_AT_decl_column : 17
    <f7d>   DW_AT_type        : <0xa1c>
    <f81>   DW_AT_data_member_location: 132
 <2><f82>: Abbrev Number: 1 (DW_TAG_member)
    <f83>   DW_AT_name        : (indirect string, offset: 0x9771a): RESERVED7
    <f87>   DW_AT_decl_file   : 6
    <f88>   DW_AT_decl_line   : 368
    <f8a>   DW_AT_decl_column : 17
    <f8b>   DW_AT_type        : <0xa32>
    <f8f>   DW_AT_data_member_location: 136
 <2><f90>: Abbrev Number: 1 (DW_TAG_member)
    <f91>   DW_AT_name        : (indirect string, offset: 0x9244d): DCKCFGR
    <f95>   DW_AT_decl_file   : 6
    <f96>   DW_AT_decl_line   : 369
    <f98>   DW_AT_decl_column : 17
    <f99>   DW_AT_type        : <0xa1c>
    <f9d>   DW_AT_data_member_location: 140
 <2><f9e>: Abbrev Number: 0
 <1><f9f>: Abbrev Number: 7 (DW_TAG_typedef)
    <fa0>   DW_AT_name        : (indirect string, offset: 0x928b2): RCC_TypeDef
    <fa4>   DW_AT_decl_file   : 6
    <fa5>   DW_AT_decl_line   : 370
    <fa7>   DW_AT_decl_column : 3
    <fa8>   DW_AT_type        : <0xdd5>
 <1><fac>: Abbrev Number: 21 (DW_TAG_structure_type)
    <fad>   DW_AT_byte_size   : 36
    <fae>   DW_AT_decl_file   : 6
    <faf>   DW_AT_decl_line   : 452
    <fb1>   DW_AT_decl_column : 9
    <fb2>   DW_AT_sibling     : <0x1033>
 <2><fb6>: Abbrev Number: 10 (DW_TAG_member)
    <fb7>   DW_AT_name        : CR1
    <fbb>   DW_AT_decl_file   : 6
    <fbc>   DW_AT_decl_line   : 454
    <fbe>   DW_AT_decl_column : 17
    <fbf>   DW_AT_type        : <0xa1c>
    <fc3>   DW_AT_data_member_location: 0
 <2><fc4>: Abbrev Number: 10 (DW_TAG_member)
    <fc5>   DW_AT_name        : CR2
    <fc9>   DW_AT_decl_file   : 6
    <fca>   DW_AT_decl_line   : 455
    <fcc>   DW_AT_decl_column : 17
    <fcd>   DW_AT_type        : <0xa1c>
    <fd1>   DW_AT_data_member_location: 4
 <2><fd2>: Abbrev Number: 10 (DW_TAG_member)
    <fd3>   DW_AT_name        : SR
    <fd6>   DW_AT_decl_file   : 6
    <fd7>   DW_AT_decl_line   : 456
    <fd9>   DW_AT_decl_column : 17
    <fda>   DW_AT_type        : <0xa1c>
    <fde>   DW_AT_data_member_location: 8
 <2><fdf>: Abbrev Number: 10 (DW_TAG_member)
    <fe0>   DW_AT_name        : DR
    <fe3>   DW_AT_decl_file   : 6
    <fe4>   DW_AT_decl_line   : 457
    <fe6>   DW_AT_decl_column : 17
    <fe7>   DW_AT_type        : <0xa1c>
    <feb>   DW_AT_data_member_location: 12
 <2><fec>: Abbrev Number: 1 (DW_TAG_member)
    <fed>   DW_AT_name        : (indirect string, offset: 0x90648): CRCPR
    <ff1>   DW_AT_decl_file   : 6
    <ff2>   DW_AT_decl_line   : 458
    <ff4>   DW_AT_decl_column : 17
    <ff5>   DW_AT_type        : <0xa1c>
    <ff9>   DW_AT_data_member_location: 16
 <2><ffa>: Abbrev Number: 1 (DW_TAG_member)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x93d83): RXCRCR
    <fff>   DW_AT_decl_file   : 6
    <1000>   DW_AT_decl_line   : 459
    <1002>   DW_AT_decl_column : 17
    <1003>   DW_AT_type        : <0xa1c>
    <1007>   DW_AT_data_member_location: 20
 <2><1008>: Abbrev Number: 1 (DW_TAG_member)
    <1009>   DW_AT_name        : (indirect string, offset: 0x92e1e): TXCRCR
    <100d>   DW_AT_decl_file   : 6
    <100e>   DW_AT_decl_line   : 460
    <1010>   DW_AT_decl_column : 17
    <1011>   DW_AT_type        : <0xa1c>
    <1015>   DW_AT_data_member_location: 24
 <2><1016>: Abbrev Number: 1 (DW_TAG_member)
    <1017>   DW_AT_name        : (indirect string, offset: 0x91394): I2SCFGR
    <101b>   DW_AT_decl_file   : 6
    <101c>   DW_AT_decl_line   : 461
    <101e>   DW_AT_decl_column : 17
    <101f>   DW_AT_type        : <0xa1c>
    <1023>   DW_AT_data_member_location: 28
 <2><1024>: Abbrev Number: 1 (DW_TAG_member)
    <1025>   DW_AT_name        : (indirect string, offset: 0x9164f): I2SPR
    <1029>   DW_AT_decl_file   : 6
    <102a>   DW_AT_decl_line   : 462
    <102c>   DW_AT_decl_column : 17
    <102d>   DW_AT_type        : <0xa1c>
    <1031>   DW_AT_data_member_location: 32
 <2><1032>: Abbrev Number: 0
 <1><1033>: Abbrev Number: 7 (DW_TAG_typedef)
    <1034>   DW_AT_name        : (indirect string, offset: 0x90482): SPI_TypeDef
    <1038>   DW_AT_decl_file   : 6
    <1039>   DW_AT_decl_line   : 463
    <103b>   DW_AT_decl_column : 3
    <103c>   DW_AT_type        : <0xfac>
 <1><1040>: Abbrev Number: 21 (DW_TAG_structure_type)
    <1041>   DW_AT_byte_size   : 84
    <1042>   DW_AT_decl_file   : 6
    <1043>   DW_AT_decl_line   : 470
    <1045>   DW_AT_decl_column : 9
    <1046>   DW_AT_sibling     : <0x116f>
 <2><104a>: Abbrev Number: 10 (DW_TAG_member)
    <104b>   DW_AT_name        : CR1
    <104f>   DW_AT_decl_file   : 6
    <1050>   DW_AT_decl_line   : 472
    <1052>   DW_AT_decl_column : 17
    <1053>   DW_AT_type        : <0xa1c>
    <1057>   DW_AT_data_member_location: 0
 <2><1058>: Abbrev Number: 10 (DW_TAG_member)
    <1059>   DW_AT_name        : CR2
    <105d>   DW_AT_decl_file   : 6
    <105e>   DW_AT_decl_line   : 473
    <1060>   DW_AT_decl_column : 17
    <1061>   DW_AT_type        : <0xa1c>
    <1065>   DW_AT_data_member_location: 4
 <2><1066>: Abbrev Number: 1 (DW_TAG_member)
    <1067>   DW_AT_name        : (indirect string, offset: 0x28ede): SMCR
    <106b>   DW_AT_decl_file   : 6
    <106c>   DW_AT_decl_line   : 474
    <106e>   DW_AT_decl_column : 17
    <106f>   DW_AT_type        : <0xa1c>
    <1073>   DW_AT_data_member_location: 8
 <2><1074>: Abbrev Number: 1 (DW_TAG_member)
    <1075>   DW_AT_name        : (indirect string, offset: 0x2d413): DIER
    <1079>   DW_AT_decl_file   : 6
    <107a>   DW_AT_decl_line   : 475
    <107c>   DW_AT_decl_column : 17
    <107d>   DW_AT_type        : <0xa1c>
    <1081>   DW_AT_data_member_location: 12
 <2><1082>: Abbrev Number: 10 (DW_TAG_member)
    <1083>   DW_AT_name        : SR
    <1086>   DW_AT_decl_file   : 6
    <1087>   DW_AT_decl_line   : 476
    <1089>   DW_AT_decl_column : 17
    <108a>   DW_AT_type        : <0xa1c>
    <108e>   DW_AT_data_member_location: 16
 <2><108f>: Abbrev Number: 10 (DW_TAG_member)
    <1090>   DW_AT_name        : EGR
    <1094>   DW_AT_decl_file   : 6
    <1095>   DW_AT_decl_line   : 477
    <1097>   DW_AT_decl_column : 17
    <1098>   DW_AT_type        : <0xa1c>
    <109c>   DW_AT_data_member_location: 20
 <2><109d>: Abbrev Number: 1 (DW_TAG_member)
    <109e>   DW_AT_name        : (indirect string, offset: 0x81341): CCMR1
    <10a2>   DW_AT_decl_file   : 6
    <10a3>   DW_AT_decl_line   : 478
    <10a5>   DW_AT_decl_column : 17
    <10a6>   DW_AT_type        : <0xa1c>
    <10aa>   DW_AT_data_member_location: 24
 <2><10ab>: Abbrev Number: 1 (DW_TAG_member)
    <10ac>   DW_AT_name        : (indirect string, offset: 0x37b32): CCMR2
    <10b0>   DW_AT_decl_file   : 6
    <10b1>   DW_AT_decl_line   : 479
    <10b3>   DW_AT_decl_column : 17
    <10b4>   DW_AT_type        : <0xa1c>
    <10b8>   DW_AT_data_member_location: 28
 <2><10b9>: Abbrev Number: 1 (DW_TAG_member)
    <10ba>   DW_AT_name        : (indirect string, offset: 0x1d9d8): CCER
    <10be>   DW_AT_decl_file   : 6
    <10bf>   DW_AT_decl_line   : 480
    <10c1>   DW_AT_decl_column : 17
    <10c2>   DW_AT_type        : <0xa1c>
    <10c6>   DW_AT_data_member_location: 32
 <2><10c7>: Abbrev Number: 10 (DW_TAG_member)
    <10c8>   DW_AT_name        : CNT
    <10cc>   DW_AT_decl_file   : 6
    <10cd>   DW_AT_decl_line   : 481
    <10cf>   DW_AT_decl_column : 17
    <10d0>   DW_AT_type        : <0xa1c>
    <10d4>   DW_AT_data_member_location: 36
 <2><10d5>: Abbrev Number: 10 (DW_TAG_member)
    <10d6>   DW_AT_name        : PSC
    <10da>   DW_AT_decl_file   : 6
    <10db>   DW_AT_decl_line   : 482
    <10dd>   DW_AT_decl_column : 17
    <10de>   DW_AT_type        : <0xa1c>
    <10e2>   DW_AT_data_member_location: 40
 <2><10e3>: Abbrev Number: 10 (DW_TAG_member)
    <10e4>   DW_AT_name        : ARR
    <10e8>   DW_AT_decl_file   : 6
    <10e9>   DW_AT_decl_line   : 483
    <10eb>   DW_AT_decl_column : 17
    <10ec>   DW_AT_type        : <0xa1c>
    <10f0>   DW_AT_data_member_location: 44
 <2><10f1>: Abbrev Number: 10 (DW_TAG_member)
    <10f2>   DW_AT_name        : RCR
    <10f6>   DW_AT_decl_file   : 6
    <10f7>   DW_AT_decl_line   : 484
    <10f9>   DW_AT_decl_column : 17
    <10fa>   DW_AT_type        : <0xa1c>
    <10fe>   DW_AT_data_member_location: 48
 <2><10ff>: Abbrev Number: 1 (DW_TAG_member)
    <1100>   DW_AT_name        : (indirect string, offset: 0x106db): CCR1
    <1104>   DW_AT_decl_file   : 6
    <1105>   DW_AT_decl_line   : 485
    <1107>   DW_AT_decl_column : 17
    <1108>   DW_AT_type        : <0xa1c>
    <110c>   DW_AT_data_member_location: 52
 <2><110d>: Abbrev Number: 1 (DW_TAG_member)
    <110e>   DW_AT_name        : (indirect string, offset: 0x3a7ac): CCR2
    <1112>   DW_AT_decl_file   : 6
    <1113>   DW_AT_decl_line   : 486
    <1115>   DW_AT_decl_column : 17
    <1116>   DW_AT_type        : <0xa1c>
    <111a>   DW_AT_data_member_location: 56
 <2><111b>: Abbrev Number: 1 (DW_TAG_member)
    <111c>   DW_AT_name        : (indirect string, offset: 0x6c0db): CCR3
    <1120>   DW_AT_decl_file   : 6
    <1121>   DW_AT_decl_line   : 487
    <1123>   DW_AT_decl_column : 17
    <1124>   DW_AT_type        : <0xa1c>
    <1128>   DW_AT_data_member_location: 60
 <2><1129>: Abbrev Number: 1 (DW_TAG_member)
    <112a>   DW_AT_name        : (indirect string, offset: 0x8952): CCR4
    <112e>   DW_AT_decl_file   : 6
    <112f>   DW_AT_decl_line   : 488
    <1131>   DW_AT_decl_column : 17
    <1132>   DW_AT_type        : <0xa1c>
    <1136>   DW_AT_data_member_location: 64
 <2><1137>: Abbrev Number: 1 (DW_TAG_member)
    <1138>   DW_AT_name        : (indirect string, offset: 0x40a39): BDTR
    <113c>   DW_AT_decl_file   : 6
    <113d>   DW_AT_decl_line   : 489
    <113f>   DW_AT_decl_column : 17
    <1140>   DW_AT_type        : <0xa1c>
    <1144>   DW_AT_data_member_location: 68
 <2><1145>: Abbrev Number: 10 (DW_TAG_member)
    <1146>   DW_AT_name        : DCR
    <114a>   DW_AT_decl_file   : 6
    <114b>   DW_AT_decl_line   : 490
    <114d>   DW_AT_decl_column : 17
    <114e>   DW_AT_type        : <0xa1c>
    <1152>   DW_AT_data_member_location: 72
 <2><1153>: Abbrev Number: 1 (DW_TAG_member)
    <1154>   DW_AT_name        : (indirect string, offset: 0x793e7): DMAR
    <1158>   DW_AT_decl_file   : 6
    <1159>   DW_AT_decl_line   : 491
    <115b>   DW_AT_decl_column : 17
    <115c>   DW_AT_type        : <0xa1c>
    <1160>   DW_AT_data_member_location: 76
 <2><1161>: Abbrev Number: 10 (DW_TAG_member)
    <1162>   DW_AT_name        : OR
    <1165>   DW_AT_decl_file   : 6
    <1166>   DW_AT_decl_line   : 492
    <1168>   DW_AT_decl_column : 17
    <1169>   DW_AT_type        : <0xa1c>
    <116d>   DW_AT_data_member_location: 80
 <2><116e>: Abbrev Number: 0
 <1><116f>: Abbrev Number: 7 (DW_TAG_typedef)
    <1170>   DW_AT_name        : (indirect string, offset: 0x8e761): TIM_TypeDef
    <1174>   DW_AT_decl_file   : 6
    <1175>   DW_AT_decl_line   : 493
    <1177>   DW_AT_decl_column : 3
    <1178>   DW_AT_type        : <0x1040>
 <1><117c>: Abbrev Number: 21 (DW_TAG_structure_type)
    <117d>   DW_AT_byte_size   : 28
    <117e>   DW_AT_decl_file   : 6
    <117f>   DW_AT_decl_line   : 499
    <1181>   DW_AT_decl_column : 9
    <1182>   DW_AT_sibling     : <0x11e7>
 <2><1186>: Abbrev Number: 10 (DW_TAG_member)
    <1187>   DW_AT_name        : SR
    <118a>   DW_AT_decl_file   : 6
    <118b>   DW_AT_decl_line   : 501
    <118d>   DW_AT_decl_column : 17
    <118e>   DW_AT_type        : <0xa1c>
    <1192>   DW_AT_data_member_location: 0
 <2><1193>: Abbrev Number: 10 (DW_TAG_member)
    <1194>   DW_AT_name        : DR
    <1197>   DW_AT_decl_file   : 6
    <1198>   DW_AT_decl_line   : 502
    <119a>   DW_AT_decl_column : 17
    <119b>   DW_AT_type        : <0xa1c>
    <119f>   DW_AT_data_member_location: 4
 <2><11a0>: Abbrev Number: 10 (DW_TAG_member)
    <11a1>   DW_AT_name        : BRR
    <11a5>   DW_AT_decl_file   : 6
    <11a6>   DW_AT_decl_line   : 503
    <11a8>   DW_AT_decl_column : 17
