Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x915 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x3352a): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x89df3): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x48c21): C:/Users/Bazar/Desktop/sbzrgn/STM32F411Discovery_CubeAI_GestureRecognition_MPU9250_AHRS_FreeRTOS/CubeAI_GestureRecognition_MPU9250_AHRS_FreeRTOS/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 20 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 6 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xb1c6): unsigned int
 <1><38>: Abbrev Number: 6 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)

 <1><4d>: Abbrev Number: 5 (DW_TAG_typedef)
    <4e>   DW_AT_name        : (indirect string, offset: 0x282f0): __uint8_t
    <52>   DW_AT_decl_file   : 2
    <53>   DW_AT_decl_line   : 43
    <54>   DW_AT_decl_column : 24
    <55>   DW_AT_type        : <0x59>
 <1><59>: Abbrev Number: 6 (DW_TAG_base_type)
    <5a>   DW_AT_byte_size   : 1
    <5b>   DW_AT_encoding    : 8	(unsigned char)
    <5c>   DW_AT_name        : (indirect string, offset: 0x1c99e): unsigned char
 <1><60>: Abbrev Number: 6 (DW_TAG_base_type)
    <61>   DW_AT_byte_size   : 2
    <62>   DW_AT_encoding    : 5	(signed)
    <63>   DW_AT_name        : (indirect string, offset: 0x67c68): short int
 <1><67>: Abbrev Number: 5 (DW_TAG_typedef)
    <68>   DW_AT_name        : (indirect string, offset: 0x71ac8): __uint16_t
    <6c>   DW_AT_decl_file   : 2
    <6d>   DW_AT_decl_line   : 57
    <6e>   DW_AT_decl_column : 25
    <6f>   DW_AT_type        : <0x73>
 <1><73>: Abbrev Number: 6 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 2
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x85c30): short unsigned int
 <1><7a>: Abbrev Number: 6 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : (indirect string, offset: 0xb72a): long int
 <1><81>: Abbrev Number: 5 (DW_TAG_typedef)
    <82>   DW_AT_name        : (indirect string, offset: 0x58609): __uint32_t
    <86>   DW_AT_decl_file   : 2
    <87>   DW_AT_decl_line   : 79
    <88>   DW_AT_decl_column : 25
    <89>   DW_AT_type        : <0x8d>
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x2addb): long unsigned int
 <1><94>: Abbrev Number: 6 (DW_TAG_base_type)
    <95>   DW_AT_byte_size   : 8
    <96>   DW_AT_encoding    : 7	(unsigned)
    <97>   DW_AT_name        : (indirect string, offset: 0x1d2a1): long long unsigned int
 <1><9b>: Abbrev Number: 5 (DW_TAG_typedef)
    <9c>   DW_AT_name        : (indirect string, offset: 0x282f2): uint8_t
    <a0>   DW_AT_decl_file   : 3
    <a1>   DW_AT_decl_line   : 24
    <a2>   DW_AT_decl_column : 19
    <a3>   DW_AT_type        : <0x4d>
 <1><a7>: Abbrev Number: 5 (DW_TAG_typedef)
    <a8>   DW_AT_name        : (indirect string, offset: 0x6570d): uint16_t
    <ac>   DW_AT_decl_file   : 3
    <ad>   DW_AT_decl_line   : 36
    <ae>   DW_AT_decl_column : 20
    <af>   DW_AT_type        : <0x67>
 <1><b3>: Abbrev Number: 5 (DW_TAG_typedef)
    <b4>   DW_AT_name        : (indirect string, offset: 0x64fca): uint32_t
    <b8>   DW_AT_decl_file   : 3
    <b9>   DW_AT_decl_line   : 48
    <ba>   DW_AT_decl_column : 20
    <bb>   DW_AT_type        : <0x81>
 <1><bf>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <c0>   DW_AT_byte_size   : 4
 <1><c1>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2>   DW_AT_name        : (indirect string, offset: 0x65a9d): StackType_t
    <c6>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 55
    <c8>   DW_AT_decl_column : 24
    <c9>   DW_AT_type        : <0xb3>
 <1><cd>: Abbrev Number: 5 (DW_TAG_typedef)
    <ce>   DW_AT_name        : (indirect string, offset: 0x809bd): UBaseType_t
    <d2>   DW_AT_decl_file   : 4
    <d3>   DW_AT_decl_line   : 57
    <d4>   DW_AT_decl_column : 23
    <d5>   DW_AT_type        : <0x8d>
 <1><d9>: Abbrev Number: 5 (DW_TAG_typedef)
    <da>   DW_AT_name        : (indirect string, offset: 0x4cfb6): TickType_t
    <de>   DW_AT_decl_file   : 4
    <df>   DW_AT_decl_line   : 63
    <e0>   DW_AT_decl_column : 19
    <e1>   DW_AT_type        : <0xb3>
 <1><e5>: Abbrev Number: 11 (DW_TAG_typedef)
    <e6>   DW_AT_name        : (indirect string, offset: 0x667ca): wint_t
    <ea>   DW_AT_decl_file   : 5
    <eb>   DW_AT_decl_line   : 359
    <ed>   DW_AT_decl_column : 23
    <ee>   DW_AT_type        : <0x31>
 <1><f2>: Abbrev Number: 5 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0x7eb36): _off_t
    <f7>   DW_AT_decl_file   : 6
    <f8>   DW_AT_decl_line   : 46
    <f9>   DW_AT_decl_column : 14
    <fa>   DW_AT_type        : <0x7a>
 <1><fe>: Abbrev Number: 5 (DW_TAG_typedef)
    <ff>   DW_AT_name        : (indirect string, offset: 0x1f1ae): _fpos_t
    <103>   DW_AT_decl_file   : 6
    <104>   DW_AT_decl_line   : 116
    <105>   DW_AT_decl_column : 14
    <106>   DW_AT_type        : <0x7a>
 <1><10a>: Abbrev Number: 22 (DW_TAG_union_type)
    <10b>   DW_AT_byte_size   : 4
    <10c>   DW_AT_decl_file   : 6
    <10d>   DW_AT_decl_line   : 165
    <10e>   DW_AT_decl_column : 3
    <10f>   DW_AT_sibling     : <0x12a>
 <2><113>: Abbrev Number: 15 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x6ad5b): __wch
    <118>   DW_AT_decl_file   : 6
    <118>   DW_AT_decl_line   : 167
    <119>   DW_AT_decl_column : 12
    <11a>   DW_AT_type        : <0xe5>
 <2><11e>: Abbrev Number: 15 (DW_TAG_member)
    <11f>   DW_AT_name        : (indirect string, offset: 0x47bb0): __wchb
    <123>   DW_AT_decl_file   : 6
    <123>   DW_AT_decl_line   : 168
    <124>   DW_AT_decl_column : 19
    <125>   DW_AT_type        : <0x12a>
 <2><129>: Abbrev Number: 0
 <1><12a>: Abbrev Number: 7 (DW_TAG_array_type)
    <12b>   DW_AT_type        : <0x59>
    <12f>   DW_AT_sibling     : <0x13a>
 <2><133>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <134>   DW_AT_type        : <0x31>
    <138>   DW_AT_upper_bound : 3
 <2><139>: Abbrev Number: 0
 <1><13a>: Abbrev Number: 23 (DW_TAG_structure_type)
    <13b>   DW_AT_byte_size   : 8
    <13c>   DW_AT_decl_file   : 6
    <13d>   DW_AT_decl_line   : 162
    <13e>   DW_AT_decl_column : 9
    <13f>   DW_AT_sibling     : <0x15e>
 <2><143>: Abbrev Number: 2 (DW_TAG_member)
    <144>   DW_AT_name        : (indirect string, offset: 0x2704c): __count
    <148>   DW_AT_decl_file   : 6
    <149>   DW_AT_decl_line   : 164
    <14a>   DW_AT_decl_column : 7
    <14b>   DW_AT_type        : <0x2a>
    <14f>   DW_AT_data_member_location: 0
 <2><150>: Abbrev Number: 2 (DW_TAG_member)
    <151>   DW_AT_name        : (indirect string, offset: 0x50038): __value
    <155>   DW_AT_decl_file   : 6
    <156>   DW_AT_decl_line   : 169
    <157>   DW_AT_decl_column : 5
    <158>   DW_AT_type        : <0x10a>
    <15c>   DW_AT_data_member_location: 4
 <2><15d>: Abbrev Number: 0
 <1><15e>: Abbrev Number: 5 (DW_TAG_typedef)
    <15f>   DW_AT_name        : (indirect string, offset: 0x48e6b): _mbstate_t
    <163>   DW_AT_decl_file   : 6
    <164>   DW_AT_decl_line   : 170
    <165>   DW_AT_decl_column : 3
    <166>   DW_AT_type        : <0x13a>
 <1><16a>: Abbrev Number: 5 (DW_TAG_typedef)
    <16b>   DW_AT_name        : (indirect string, offset: 0x4b5fa): __ULong
    <16f>   DW_AT_decl_file   : 7
    <170>   DW_AT_decl_line   : 22
    <171>   DW_AT_decl_column : 25
    <172>   DW_AT_type        : <0x8d>
 <1><176>: Abbrev Number: 5 (DW_TAG_typedef)
    <177>   DW_AT_name        : (indirect string, offset: 0x4cbf0): _LOCK_T
    <17b>   DW_AT_decl_file   : 8
    <17c>   DW_AT_decl_line   : 34
    <17d>   DW_AT_decl_column : 25
    <17e>   DW_AT_type        : <0x182>
 <1><182>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <183>   DW_AT_byte_size   : 4
    <183>   DW_AT_type        : <0x187>
 <1><187>: Abbrev Number: 16 (DW_TAG_structure_type)
    <188>   DW_AT_name        : (indirect string, offset: 0x2b00d): __lock
    <18c>   DW_AT_declaration : 1
 <1><18c>: Abbrev Number: 5 (DW_TAG_typedef)
    <18d>   DW_AT_name        : (indirect string, offset: 0x44be6): _flock_t
    <191>   DW_AT_decl_file   : 7
    <192>   DW_AT_decl_line   : 35
    <193>   DW_AT_decl_column : 27
    <194>   DW_AT_type        : <0x176>
 <1><198>: Abbrev Number: 12 (DW_TAG_structure_type)
    <199>   DW_AT_name        : (indirect string, offset: 0x305b2): _Bigint
    <19d>   DW_AT_byte_size   : 24
    <19e>   DW_AT_decl_file   : 7
    <19e>   DW_AT_decl_line   : 52
    <19f>   DW_AT_decl_column : 8
    <19f>   DW_AT_sibling     : <0x1ee>
 <2><1a3>: Abbrev Number: 2 (DW_TAG_member)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x52e66): _next
    <1a8>   DW_AT_decl_file   : 7
    <1a9>   DW_AT_decl_line   : 54
    <1aa>   DW_AT_decl_column : 19
    <1ab>   DW_AT_type        : <0x1ee>
    <1af>   DW_AT_data_member_location: 0
 <2><1b0>: Abbrev Number: 9 (DW_TAG_member)
    <1b1>   DW_AT_name        : _k
    <1b4>   DW_AT_decl_file   : 7
    <1b4>   DW_AT_decl_line   : 55
    <1b5>   DW_AT_decl_column : 7
    <1b6>   DW_AT_type        : <0x2a>
    <1ba>   DW_AT_data_member_location: 4
 <2><1bb>: Abbrev Number: 2 (DW_TAG_member)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x637a6): _maxwds
    <1c0>   DW_AT_decl_file   : 7
    <1c1>   DW_AT_decl_line   : 55
    <1c2>   DW_AT_decl_column : 11
    <1c3>   DW_AT_type        : <0x2a>
    <1c7>   DW_AT_data_member_location: 8
 <2><1c8>: Abbrev Number: 2 (DW_TAG_member)
    <1c9>   DW_AT_name        : (indirect string, offset: 0x4a126): _sign
    <1cd>   DW_AT_decl_file   : 7
    <1ce>   DW_AT_decl_line   : 55
    <1cf>   DW_AT_decl_column : 20
    <1d0>   DW_AT_type        : <0x2a>
    <1d4>   DW_AT_data_member_location: 12
 <2><1d5>: Abbrev Number: 2 (DW_TAG_member)
    <1d6>   DW_AT_name        : (indirect string, offset: 0x49d31): _wds
    <1da>   DW_AT_decl_file   : 7
    <1db>   DW_AT_decl_line   : 55
    <1dc>   DW_AT_decl_column : 27
    <1dd>   DW_AT_type        : <0x2a>
    <1e1>   DW_AT_data_member_location: 16
 <2><1e2>: Abbrev Number: 9 (DW_TAG_member)
    <1e3>   DW_AT_name        : _x
    <1e6>   DW_AT_decl_file   : 7
    <1e6>   DW_AT_decl_line   : 56
    <1e7>   DW_AT_decl_column : 11
    <1e8>   DW_AT_type        : <0x1f3>
    <1ec>   DW_AT_data_member_location: 20
 <2><1ed>: Abbrev Number: 0
 <1><1ee>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1ef>   DW_AT_byte_size   : 4
    <1ef>   DW_AT_type        : <0x198>
 <1><1f3>: Abbrev Number: 7 (DW_TAG_array_type)
    <1f4>   DW_AT_type        : <0x16a>
    <1f8>   DW_AT_sibling     : <0x203>
 <2><1fc>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1fd>   DW_AT_type        : <0x31>
    <201>   DW_AT_upper_bound : 0
 <2><202>: Abbrev Number: 0
 <1><203>: Abbrev Number: 12 (DW_TAG_structure_type)
    <204>   DW_AT_name        : (indirect string, offset: 0x25edd): __tm
    <208>   DW_AT_byte_size   : 36
    <209>   DW_AT_decl_file   : 7
    <209>   DW_AT_decl_line   : 60
    <20a>   DW_AT_decl_column : 8
    <20a>   DW_AT_sibling     : <0x284>
 <2><20e>: Abbrev Number: 2 (DW_TAG_member)
    <20f>   DW_AT_name        : (indirect string, offset: 0x71fec): __tm_sec
    <213>   DW_AT_decl_file   : 7
    <214>   DW_AT_decl_line   : 62
    <215>   DW_AT_decl_column : 9
    <216>   DW_AT_type        : <0x2a>
    <21a>   DW_AT_data_member_location: 0
 <2><21b>: Abbrev Number: 2 (DW_TAG_member)
    <21c>   DW_AT_name        : (indirect string, offset: 0x9b0): __tm_min
    <220>   DW_AT_decl_file   : 7
    <221>   DW_AT_decl_line   : 63
    <222>   DW_AT_decl_column : 9
    <223>   DW_AT_type        : <0x2a>
    <227>   DW_AT_data_member_location: 4
 <2><228>: Abbrev Number: 2 (DW_TAG_member)
    <229>   DW_AT_name        : (indirect string, offset: 0x1deab): __tm_hour
    <22d>   DW_AT_decl_file   : 7
    <22e>   DW_AT_decl_line   : 64
    <22f>   DW_AT_decl_column : 9
    <230>   DW_AT_type        : <0x2a>
    <234>   DW_AT_data_member_location: 8
 <2><235>: Abbrev Number: 2 (DW_TAG_member)
    <236>   DW_AT_name        : (indirect string, offset: 0x51a90): __tm_mday
    <23a>   DW_AT_decl_file   : 7
    <23b>   DW_AT_decl_line   : 65
    <23c>   DW_AT_decl_column : 9
    <23d>   DW_AT_type        : <0x2a>
    <241>   DW_AT_data_member_location: 12
 <2><242>: Abbrev Number: 2 (DW_TAG_member)
    <243>   DW_AT_name        : (indirect string, offset: 0x24e9): __tm_mon
    <247>   DW_AT_decl_file   : 7
    <248>   DW_AT_decl_line   : 66
    <249>   DW_AT_decl_column : 9
    <24a>   DW_AT_type        : <0x2a>
    <24e>   DW_AT_data_member_location: 16
 <2><24f>: Abbrev Number: 2 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0x82021): __tm_year
    <254>   DW_AT_decl_file   : 7
    <255>   DW_AT_decl_line   : 67
    <256>   DW_AT_decl_column : 9
    <257>   DW_AT_type        : <0x2a>
    <25b>   DW_AT_data_member_location: 20
 <2><25c>: Abbrev Number: 2 (DW_TAG_member)
    <25d>   DW_AT_name        : (indirect string, offset: 0x3a671): __tm_wday
    <261>   DW_AT_decl_file   : 7
    <262>   DW_AT_decl_line   : 68
    <263>   DW_AT_decl_column : 9
    <264>   DW_AT_type        : <0x2a>
    <268>   DW_AT_data_member_location: 24
 <2><269>: Abbrev Number: 2 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x6e4d3): __tm_yday
    <26e>   DW_AT_decl_file   : 7
    <26f>   DW_AT_decl_line   : 69
    <270>   DW_AT_decl_column : 9
    <271>   DW_AT_type        : <0x2a>
    <275>   DW_AT_data_member_location: 28
 <2><276>: Abbrev Number: 2 (DW_TAG_member)
    <277>   DW_AT_name        : (indirect string, offset: 0x7d86b): __tm_isdst
    <27b>   DW_AT_decl_file   : 7
    <27c>   DW_AT_decl_line   : 70
    <27d>   DW_AT_decl_column : 9
    <27e>   DW_AT_type        : <0x2a>
    <282>   DW_AT_data_member_location: 32
 <2><283>: Abbrev Number: 0
 <1><284>: Abbrev Number: 12 (DW_TAG_structure_type)
    <285>   DW_AT_name        : (indirect string, offset: 0x5c9c1): __sbuf
    <289>   DW_AT_byte_size   : 8
    <28a>   DW_AT_decl_file   : 7
    <28a>   DW_AT_decl_line   : 115
    <28b>   DW_AT_decl_column : 8
    <28b>   DW_AT_sibling     : <0x2aa>
 <2><28f>: Abbrev Number: 2 (DW_TAG_member)
    <290>   DW_AT_name        : (indirect string, offset: 0x8ab67): _base
    <294>   DW_AT_decl_file   : 7
    <295>   DW_AT_decl_line   : 116
    <296>   DW_AT_decl_column : 17
    <297>   DW_AT_type        : <0x2aa>
    <29b>   DW_AT_data_member_location: 0
 <2><29c>: Abbrev Number: 2 (DW_TAG_member)
    <29d>   DW_AT_name        : (indirect string, offset: 0x4fc9e): _size
    <2a1>   DW_AT_decl_file   : 7
    <2a2>   DW_AT_decl_line   : 117
    <2a3>   DW_AT_decl_column : 6
    <2a4>   DW_AT_type        : <0x2a>
    <2a8>   DW_AT_data_member_location: 4
 <2><2a9>: Abbrev Number: 0
 <1><2aa>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <2ab>   DW_AT_byte_size   : 4
    <2ab>   DW_AT_type        : <0x59>
 <1><2af>: Abbrev Number: 12 (DW_TAG_structure_type)
    <2b0>   DW_AT_name        : (indirect string, offset: 0x6aac3): __sFILE
    <2b4>   DW_AT_byte_size   : 104
    <2b5>   DW_AT_decl_file   : 7
    <2b5>   DW_AT_decl_line   : 152
    <2b6>   DW_AT_decl_column : 8
    <2b6>   DW_AT_sibling     : <0x3e8>
 <2><2ba>: Abbrev Number: 9 (DW_TAG_member)
    <2bb>   DW_AT_name        : _p
    <2be>   DW_AT_decl_file   : 7
    <2be>   DW_AT_decl_line   : 153
    <2bf>   DW_AT_decl_column : 18
    <2c0>   DW_AT_type        : <0x2aa>
    <2c4>   DW_AT_data_member_location: 0
 <2><2c5>: Abbrev Number: 9 (DW_TAG_member)
    <2c6>   DW_AT_name        : _r
    <2c9>   DW_AT_decl_file   : 7
    <2c9>   DW_AT_decl_line   : 154
    <2ca>   DW_AT_decl_column : 7
    <2cb>   DW_AT_type        : <0x2a>
    <2cf>   DW_AT_data_member_location: 4
 <2><2d0>: Abbrev Number: 9 (DW_TAG_member)
    <2d1>   DW_AT_name        : _w
    <2d4>   DW_AT_decl_file   : 7
    <2d4>   DW_AT_decl_line   : 155
    <2d5>   DW_AT_decl_column : 7
    <2d6>   DW_AT_type        : <0x2a>
    <2da>   DW_AT_data_member_location: 8
 <2><2db>: Abbrev Number: 2 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0x3f5fc): _flags
    <2e0>   DW_AT_decl_file   : 7
    <2e1>   DW_AT_decl_line   : 156
    <2e2>   DW_AT_decl_column : 9
    <2e3>   DW_AT_type        : <0x60>
    <2e7>   DW_AT_data_member_location: 12
 <2><2e8>: Abbrev Number: 2 (DW_TAG_member)
    <2e9>   DW_AT_name        : (indirect string, offset: 0x15946): _file
    <2ed>   DW_AT_decl_file   : 7
    <2ee>   DW_AT_decl_line   : 157
    <2ef>   DW_AT_decl_column : 9
    <2f0>   DW_AT_type        : <0x60>
    <2f4>   DW_AT_data_member_location: 14
 <2><2f5>: Abbrev Number: 9 (DW_TAG_member)
    <2f6>   DW_AT_name        : _bf
    <2fa>   DW_AT_decl_file   : 7
    <2fa>   DW_AT_decl_line   : 158
    <2fb>   DW_AT_decl_column : 17
    <2fc>   DW_AT_type        : <0x284>
    <300>   DW_AT_data_member_location: 16
 <2><301>: Abbrev Number: 2 (DW_TAG_member)
    <302>   DW_AT_name        : (indirect string, offset: 0x3fbfc): _lbfsize
    <306>   DW_AT_decl_file   : 7
    <307>   DW_AT_decl_line   : 159
    <308>   DW_AT_decl_column : 7
    <309>   DW_AT_type        : <0x2a>
    <30d>   DW_AT_data_member_location: 24
 <2><30e>: Abbrev Number: 2 (DW_TAG_member)
    <30f>   DW_AT_name        : (indirect string, offset: 0x61aa4): _data
    <313>   DW_AT_decl_file   : 7
    <314>   DW_AT_decl_line   : 162
    <315>   DW_AT_decl_column : 18
    <316>   DW_AT_type        : <0x501>
    <31a>   DW_AT_data_member_location: 28
 <2><31b>: Abbrev Number: 2 (DW_TAG_member)
    <31c>   DW_AT_name        : (indirect string, offset: 0x7c6b2): _cookie
    <320>   DW_AT_decl_file   : 7
    <321>   DW_AT_decl_line   : 166
    <322>   DW_AT_decl_column : 10
    <323>   DW_AT_type        : <0xbf>
    <327>   DW_AT_data_member_location: 32
 <2><328>: Abbrev Number: 2 (DW_TAG_member)
    <329>   DW_AT_name        : (indirect string, offset: 0x6ded7): _read
    <32d>   DW_AT_decl_file   : 7
    <32e>   DW_AT_decl_line   : 168
    <32f>   DW_AT_decl_column : 29
    <330>   DW_AT_type        : <0x535>
    <334>   DW_AT_data_member_location: 36
 <2><335>: Abbrev Number: 2 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x1157c): _write
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 170
    <33c>   DW_AT_decl_column : 29
    <33d>   DW_AT_type        : <0x55d>
    <341>   DW_AT_data_member_location: 40
 <2><342>: Abbrev Number: 2 (DW_TAG_member)
    <343>   DW_AT_name        : (indirect string, offset: 0x892bc): _seek
    <347>   DW_AT_decl_file   : 7
    <348>   DW_AT_decl_line   : 173
    <349>   DW_AT_decl_column : 13
    <34a>   DW_AT_type        : <0x580>
    <34e>   DW_AT_data_member_location: 44
 <2><34f>: Abbrev Number: 2 (DW_TAG_member)
    <350>   DW_AT_name        : (indirect string, offset: 0x3cdb9): _close
    <354>   DW_AT_decl_file   : 7
    <355>   DW_AT_decl_line   : 174
    <356>   DW_AT_decl_column : 9
    <357>   DW_AT_type        : <0x599>
    <35b>   DW_AT_data_member_location: 48
 <2><35c>: Abbrev Number: 9 (DW_TAG_member)
    <35d>   DW_AT_name        : _ub
    <361>   DW_AT_decl_file   : 7
    <361>   DW_AT_decl_line   : 177
    <362>   DW_AT_decl_column : 17
    <363>   DW_AT_type        : <0x284>
    <367>   DW_AT_data_member_location: 52
 <2><368>: Abbrev Number: 9 (DW_TAG_member)
    <369>   DW_AT_name        : _up
    <36d>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 178
    <36e>   DW_AT_decl_column : 18
    <36f>   DW_AT_type        : <0x2aa>
    <373>   DW_AT_data_member_location: 60
 <2><374>: Abbrev Number: 9 (DW_TAG_member)
    <375>   DW_AT_name        : _ur
    <379>   DW_AT_decl_file   : 7
    <379>   DW_AT_decl_line   : 179
    <37a>   DW_AT_decl_column : 7
    <37b>   DW_AT_type        : <0x2a>
    <37f>   DW_AT_data_member_location: 64
 <2><380>: Abbrev Number: 2 (DW_TAG_member)
    <381>   DW_AT_name        : (indirect string, offset: 0x25b0c): _ubuf
    <385>   DW_AT_decl_file   : 7
    <386>   DW_AT_decl_line   : 182
    <387>   DW_AT_decl_column : 17
    <388>   DW_AT_type        : <0x59e>
    <38c>   DW_AT_data_member_location: 68
 <2><38d>: Abbrev Number: 2 (DW_TAG_member)
    <38e>   DW_AT_name        : (indirect string, offset: 0x5e640): _nbuf
    <392>   DW_AT_decl_file   : 7
    <393>   DW_AT_decl_line   : 183
    <394>   DW_AT_decl_column : 17
    <395>   DW_AT_type        : <0x5ae>
    <399>   DW_AT_data_member_location: 71
 <2><39a>: Abbrev Number: 9 (DW_TAG_member)
    <39b>   DW_AT_name        : _lb
    <39f>   DW_AT_decl_file   : 7
    <39f>   DW_AT_decl_line   : 186
    <3a0>   DW_AT_decl_column : 17
    <3a1>   DW_AT_type        : <0x284>
    <3a5>   DW_AT_data_member_location: 72
 <2><3a6>: Abbrev Number: 2 (DW_TAG_member)
    <3a7>   DW_AT_name        : (indirect string, offset: 0x232f7): _blksize
    <3ab>   DW_AT_decl_file   : 7
    <3ac>   DW_AT_decl_line   : 189
    <3ad>   DW_AT_decl_column : 7
    <3ae>   DW_AT_type        : <0x2a>
    <3b2>   DW_AT_data_member_location: 80
 <2><3b3>: Abbrev Number: 2 (DW_TAG_member)
    <3b4>   DW_AT_name        : (indirect string, offset: 0x2ccf1): _offset
    <3b8>   DW_AT_decl_file   : 7
    <3b9>   DW_AT_decl_line   : 190
    <3ba>   DW_AT_decl_column : 10
    <3bb>   DW_AT_type        : <0xf2>
    <3bf>   DW_AT_data_member_location: 84
 <2><3c0>: Abbrev Number: 2 (DW_TAG_member)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x2b00e): _lock
    <3c5>   DW_AT_decl_file   : 7
    <3c6>   DW_AT_decl_line   : 197
    <3c7>   DW_AT_decl_column : 12
    <3c8>   DW_AT_type        : <0x18c>
    <3cc>   DW_AT_data_member_location: 88
 <2><3cd>: Abbrev Number: 2 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0xfc9c): _mbstate
    <3d2>   DW_AT_decl_file   : 7
    <3d3>   DW_AT_decl_line   : 199
    <3d4>   DW_AT_decl_column : 14
    <3d5>   DW_AT_type        : <0x15e>
    <3d9>   DW_AT_data_member_location: 92
 <2><3da>: Abbrev Number: 2 (DW_TAG_member)
    <3db>   DW_AT_name        : (indirect string, offset: 0x71327): _flags2
    <3df>   DW_AT_decl_file   : 7
    <3e0>   DW_AT_decl_line   : 200
    <3e1>   DW_AT_decl_column : 9
    <3e2>   DW_AT_type        : <0x2a>
    <3e6>   DW_AT_data_member_location: 100
 <2><3e7>: Abbrev Number: 0
 <1><3e8>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3e9>   DW_AT_name        : (indirect string, offset: 0x9602a): _reent
    <3ed>   DW_AT_byte_size   : 76
    <3ee>   DW_AT_decl_file   : 7
    <3ef>   DW_AT_decl_line   : 375
    <3f1>   DW_AT_decl_column : 8
    <3f2>   DW_AT_sibling     : <0x501>
 <2><3f6>: Abbrev Number: 1 (DW_TAG_member)
    <3f7>   DW_AT_name        : (indirect string, offset: 0x51c56): _errno
    <3fb>   DW_AT_decl_file   : 7
    <3fc>   DW_AT_decl_line   : 379
    <3fe>   DW_AT_decl_column : 7
    <3ff>   DW_AT_type        : <0x2a>
    <403>   DW_AT_data_member_location: 0
 <2><404>: Abbrev Number: 1 (DW_TAG_member)
    <405>   DW_AT_name        : (indirect string, offset: 0x46829): _stdin
    <409>   DW_AT_decl_file   : 7
    <40a>   DW_AT_decl_line   : 384
    <40c>   DW_AT_decl_column : 11
    <40d>   DW_AT_type        : <0x5cb>
    <411>   DW_AT_data_member_location: 4
 <2><412>: Abbrev Number: 1 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0x5f7ae): _stdout
    <417>   DW_AT_decl_file   : 7
    <418>   DW_AT_decl_line   : 384
    <41a>   DW_AT_decl_column : 20
    <41b>   DW_AT_type        : <0x5cb>
    <41f>   DW_AT_data_member_location: 8
 <2><420>: Abbrev Number: 1 (DW_TAG_member)
    <421>   DW_AT_name        : (indirect string, offset: 0x7f27e): _stderr
    <425>   DW_AT_decl_file   : 7
    <426>   DW_AT_decl_line   : 384
    <428>   DW_AT_decl_column : 30
    <429>   DW_AT_type        : <0x5cb>
    <42d>   DW_AT_data_member_location: 12
 <2><42e>: Abbrev Number: 1 (DW_TAG_member)
    <42f>   DW_AT_name        : (indirect string, offset: 0x57f7e): _inc
    <433>   DW_AT_decl_file   : 7
    <434>   DW_AT_decl_line   : 386
    <436>   DW_AT_decl_column : 8
    <437>   DW_AT_type        : <0x2a>
    <43b>   DW_AT_data_member_location: 16
 <2><43c>: Abbrev Number: 1 (DW_TAG_member)
    <43d>   DW_AT_name        : (indirect string, offset: 0x6e123): _emergency
    <441>   DW_AT_decl_file   : 7
    <442>   DW_AT_decl_line   : 388
    <444>   DW_AT_decl_column : 9
    <445>   DW_AT_type        : <0x524>
    <449>   DW_AT_data_member_location: 20
 <2><44a>: Abbrev Number: 1 (DW_TAG_member)
    <44b>   DW_AT_name        : (indirect string, offset: 0x7bb6a): _locale
    <44f>   DW_AT_decl_file   : 7
    <450>   DW_AT_decl_line   : 394
    <452>   DW_AT_decl_column : 22
    <453>   DW_AT_type        : <0x731>
    <457>   DW_AT_data_member_location: 24
 <2><458>: Abbrev Number: 24 (DW_TAG_member)
    <459>   DW_AT_name        : _mp
    <45d>   DW_AT_decl_file   : 7
    <45e>   DW_AT_decl_line   : 396
    <460>   DW_AT_decl_column : 18
    <461>   DW_AT_type        : <0x736>
    <465>   DW_AT_data_member_location: 28
 <2><466>: Abbrev Number: 1 (DW_TAG_member)
    <467>   DW_AT_name        : (indirect string, offset: 0x16045): __cleanup
    <46b>   DW_AT_decl_file   : 7
    <46c>   DW_AT_decl_line   : 398
    <46e>   DW_AT_decl_column : 10
    <46f>   DW_AT_type        : <0x746>
    <473>   DW_AT_data_member_location: 32
 <2><474>: Abbrev Number: 1 (DW_TAG_member)
    <475>   DW_AT_name        : (indirect string, offset: 0x9606): _gamma_signgam
    <479>   DW_AT_decl_file   : 7
    <47a>   DW_AT_decl_line   : 400
    <47c>   DW_AT_decl_column : 7
    <47d>   DW_AT_type        : <0x2a>
    <481>   DW_AT_data_member_location: 36
 <2><482>: Abbrev Number: 1 (DW_TAG_member)
    <483>   DW_AT_name        : (indirect string, offset: 0x664a1): _cvtlen
    <487>   DW_AT_decl_file   : 7
    <488>   DW_AT_decl_line   : 403
    <48a>   DW_AT_decl_column : 7
    <48b>   DW_AT_type        : <0x2a>
    <48f>   DW_AT_data_member_location: 40
 <2><490>: Abbrev Number: 1 (DW_TAG_member)
    <491>   DW_AT_name        : (indirect string, offset: 0x40456): _cvtbuf
    <495>   DW_AT_decl_file   : 7
    <496>   DW_AT_decl_line   : 404
    <498>   DW_AT_decl_column : 9
    <499>   DW_AT_type        : <0x524>
    <49d>   DW_AT_data_member_location: 44
 <2><49e>: Abbrev Number: 1 (DW_TAG_member)
    <49f>   DW_AT_name        : (indirect string, offset: 0x680b5): _r48
    <4a3>   DW_AT_decl_file   : 7
    <4a4>   DW_AT_decl_line   : 406
    <4a6>   DW_AT_decl_column : 19
    <4a7>   DW_AT_type        : <0x74b>
    <4ab>   DW_AT_data_member_location: 48
 <2><4ac>: Abbrev Number: 1 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x73e09): _localtime_buf
    <4b1>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 407
    <4b4>   DW_AT_decl_column : 16
    <4b5>   DW_AT_type        : <0x750>
    <4b9>   DW_AT_data_member_location: 52
 <2><4ba>: Abbrev Number: 1 (DW_TAG_member)
    <4bb>   DW_AT_name        : (indirect string, offset: 0x20f57): _asctime_buf
    <4bf>   DW_AT_decl_file   : 7
    <4c0>   DW_AT_decl_line   : 408
    <4c2>   DW_AT_decl_column : 9
    <4c3>   DW_AT_type        : <0x524>
    <4c7>   DW_AT_data_member_location: 56
 <2><4c8>: Abbrev Number: 1 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x6d71): _sig_func
    <4cd>   DW_AT_decl_file   : 7
    <4ce>   DW_AT_decl_line   : 411
    <4d0>   DW_AT_decl_column : 12
    <4d1>   DW_AT_type        : <0x760>
    <4d5>   DW_AT_data_member_location: 60
 <2><4d6>: Abbrev Number: 1 (DW_TAG_member)
    <4d7>   DW_AT_name        : (indirect string, offset: 0x2590c): __sf
    <4db>   DW_AT_decl_file   : 7
    <4dc>   DW_AT_decl_line   : 419
    <4de>   DW_AT_decl_column : 11
    <4df>   DW_AT_type        : <0x5cb>
    <4e3>   DW_AT_data_member_location: 64
 <2><4e4>: Abbrev Number: 1 (DW_TAG_member)
    <4e5>   DW_AT_name        : (indirect string, offset: 0x3ea5e): _misc
    <4e9>   DW_AT_decl_file   : 7
    <4ea>   DW_AT_decl_line   : 420
    <4ec>   DW_AT_decl_column : 23
    <4ed>   DW_AT_type        : <0x76a>
    <4f1>   DW_AT_data_member_location: 68
 <2><4f2>: Abbrev Number: 1 (DW_TAG_member)
    <4f3>   DW_AT_name        : (indirect string, offset: 0x56876): _signal_buf
    <4f7>   DW_AT_decl_file   : 7
    <4f8>   DW_AT_decl_line   : 421
    <4fa>   DW_AT_decl_column : 9
    <4fb>   DW_AT_type        : <0x524>
    <4ff>   DW_AT_data_member_location: 72
 <2><500>: Abbrev Number: 0
 <1><501>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <502>   DW_AT_byte_size   : 4
    <502>   DW_AT_type        : <0x3e8>
 <1><506>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <507>   DW_AT_prototyped  : 1
    <507>   DW_AT_type        : <0x2a>
    <50b>   DW_AT_sibling     : <0x524>
 <2><50f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <510>   DW_AT_type        : <0x501>
 <2><514>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <515>   DW_AT_type        : <0xbf>
 <2><519>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <51a>   DW_AT_type        : <0x524>
 <2><51e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <51f>   DW_AT_type        : <0x2a>
 <2><523>: Abbrev Number: 0
 <1><524>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <525>   DW_AT_byte_size   : 4
    <525>   DW_AT_type        : <0x529>
 <1><529>: Abbrev Number: 6 (DW_TAG_base_type)
    <52a>   DW_AT_byte_size   : 1
    <52b>   DW_AT_encoding    : 8	(unsigned char)
    <52c>   DW_AT_name        : (indirect string, offset: 0x2d073): char
 <1><530>: Abbrev Number: 25 (DW_TAG_const_type)
    <531>   DW_AT_type        : <0x529>
 <1><535>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <536>   DW_AT_byte_size   : 4
    <536>   DW_AT_type        : <0x506>
 <1><53a>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <53b>   DW_AT_prototyped  : 1
    <53b>   DW_AT_type        : <0x2a>
    <53f>   DW_AT_sibling     : <0x558>
 <2><543>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <544>   DW_AT_type        : <0x501>
 <2><548>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <549>   DW_AT_type        : <0xbf>
 <2><54d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <54e>   DW_AT_type        : <0x558>
 <2><552>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <553>   DW_AT_type        : <0x2a>
 <2><557>: Abbrev Number: 0
 <1><558>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <559>   DW_AT_byte_size   : 4
    <559>   DW_AT_type        : <0x530>
 <1><55d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <55e>   DW_AT_byte_size   : 4
    <55e>   DW_AT_type        : <0x53a>
 <1><562>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <563>   DW_AT_prototyped  : 1
    <563>   DW_AT_type        : <0xfe>
    <567>   DW_AT_sibling     : <0x580>
 <2><56b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <56c>   DW_AT_type        : <0x501>
 <2><570>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <571>   DW_AT_type        : <0xbf>
 <2><575>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <576>   DW_AT_type        : <0xfe>
 <2><57a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <57b>   DW_AT_type        : <0x2a>
 <2><57f>: Abbrev Number: 0
 <1><580>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <581>   DW_AT_byte_size   : 4
    <581>   DW_AT_type        : <0x562>
 <1><585>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <586>   DW_AT_prototyped  : 1
    <586>   DW_AT_type        : <0x2a>
    <58a>   DW_AT_sibling     : <0x599>
 <2><58e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <58f>   DW_AT_type        : <0x501>
 <2><593>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <594>   DW_AT_type        : <0xbf>
 <2><598>: Abbrev Number: 0
 <1><599>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <59a>   DW_AT_byte_size   : 4
    <59a>   DW_AT_type        : <0x585>
 <1><59e>: Abbrev Number: 7 (DW_TAG_array_type)
    <59f>   DW_AT_type        : <0x59>
    <5a3>   DW_AT_sibling     : <0x5ae>
 <2><5a7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5a8>   DW_AT_type        : <0x31>
    <5ac>   DW_AT_upper_bound : 2
 <2><5ad>: Abbrev Number: 0
 <1><5ae>: Abbrev Number: 7 (DW_TAG_array_type)
    <5af>   DW_AT_type        : <0x59>
    <5b3>   DW_AT_sibling     : <0x5be>
 <2><5b7>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5b8>   DW_AT_type        : <0x31>
    <5bc>   DW_AT_upper_bound : 0
 <2><5bd>: Abbrev Number: 0
 <1><5be>: Abbrev Number: 11 (DW_TAG_typedef)
    <5bf>   DW_AT_name        : (indirect string, offset: 0x583b0): __FILE
    <5c3>   DW_AT_decl_file   : 7
    <5c4>   DW_AT_decl_line   : 269
    <5c6>   DW_AT_decl_column : 26
    <5c7>   DW_AT_type        : <0x2af>
 <1><5cb>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <5cc>   DW_AT_byte_size   : 4
    <5cc>   DW_AT_type        : <0x5be>
 <1><5d0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x30314): _rand48
    <5d5>   DW_AT_byte_size   : 24
    <5d6>   DW_AT_decl_file   : 7
    <5d7>   DW_AT_decl_line   : 305
    <5d9>   DW_AT_decl_column : 8
    <5da>   DW_AT_sibling     : <0x617>
 <2><5de>: Abbrev Number: 1 (DW_TAG_member)
    <5df>   DW_AT_name        : (indirect string, offset: 0x28496): _seed
    <5e3>   DW_AT_decl_file   : 7
    <5e4>   DW_AT_decl_line   : 306
    <5e6>   DW_AT_decl_column : 18
    <5e7>   DW_AT_type        : <0x617>
    <5eb>   DW_AT_data_member_location: 0
 <2><5ec>: Abbrev Number: 1 (DW_TAG_member)
    <5ed>   DW_AT_name        : (indirect string, offset: 0xb567): _mult
    <5f1>   DW_AT_decl_file   : 7
    <5f2>   DW_AT_decl_line   : 307
    <5f4>   DW_AT_decl_column : 18
    <5f5>   DW_AT_type        : <0x617>
    <5f9>   DW_AT_data_member_location: 6
 <2><5fa>: Abbrev Number: 1 (DW_TAG_member)
    <5fb>   DW_AT_name        : (indirect string, offset: 0x47c64): _add
    <5ff>   DW_AT_decl_file   : 7
    <600>   DW_AT_decl_line   : 308
    <602>   DW_AT_decl_column : 18
    <603>   DW_AT_type        : <0x73>
    <607>   DW_AT_data_member_location: 12
 <2><608>: Abbrev Number: 1 (DW_TAG_member)
    <609>   DW_AT_name        : (indirect string, offset: 0x52e61): _rand_next
    <60d>   DW_AT_decl_file   : 7
    <60e>   DW_AT_decl_line   : 311
    <610>   DW_AT_decl_column : 36
    <611>   DW_AT_type        : <0x94>
    <615>   DW_AT_data_member_location: 16
 <2><616>: Abbrev Number: 0
 <1><617>: Abbrev Number: 7 (DW_TAG_array_type)
    <618>   DW_AT_type        : <0x73>
    <61c>   DW_AT_sibling     : <0x627>
 <2><620>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <621>   DW_AT_type        : <0x31>
    <625>   DW_AT_upper_bound : 2
 <2><626>: Abbrev Number: 0
 <1><627>: Abbrev Number: 10 (DW_TAG_structure_type)
    <628>   DW_AT_name        : (indirect string, offset: 0x6a004): _mprec
    <62c>   DW_AT_byte_size   : 16
    <62d>   DW_AT_decl_file   : 7
    <62e>   DW_AT_decl_line   : 347
    <630>   DW_AT_decl_column : 8
    <631>   DW_AT_sibling     : <0x66e>
 <2><635>: Abbrev Number: 1 (DW_TAG_member)
    <636>   DW_AT_name        : (indirect string, offset: 0x8b3a4): _result
    <63a>   DW_AT_decl_file   : 7
    <63b>   DW_AT_decl_line   : 350
    <63d>   DW_AT_decl_column : 19
    <63e>   DW_AT_type        : <0x1ee>
    <642>   DW_AT_data_member_location: 0
 <2><643>: Abbrev Number: 1 (DW_TAG_member)
    <644>   DW_AT_name        : (indirect string, offset: 0x69b8b): _result_k
    <648>   DW_AT_decl_file   : 7
    <649>   DW_AT_decl_line   : 351
    <64b>   DW_AT_decl_column : 7
    <64c>   DW_AT_type        : <0x2a>
    <650>   DW_AT_data_member_location: 4
 <2><651>: Abbrev Number: 1 (DW_TAG_member)
    <652>   DW_AT_name        : (indirect string, offset: 0x424de): _p5s
    <656>   DW_AT_decl_file   : 7
    <657>   DW_AT_decl_line   : 352
    <659>   DW_AT_decl_column : 19
    <65a>   DW_AT_type        : <0x1ee>
    <65e>   DW_AT_data_member_location: 8
 <2><65f>: Abbrev Number: 1 (DW_TAG_member)
    <660>   DW_AT_name        : (indirect string, offset: 0x50a2e): _freelist
    <664>   DW_AT_decl_file   : 7
    <665>   DW_AT_decl_line   : 353
    <667>   DW_AT_decl_column : 20
    <668>   DW_AT_type        : <0x66e>
    <66c>   DW_AT_data_member_location: 12
 <2><66d>: Abbrev Number: 0
 <1><66e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <66f>   DW_AT_byte_size   : 4
    <66f>   DW_AT_type        : <0x1ee>
 <1><673>: Abbrev Number: 10 (DW_TAG_structure_type)
    <674>   DW_AT_name        : (indirect string, offset: 0x42482): _misc_reent
    <678>   DW_AT_byte_size   : 80
    <679>   DW_AT_decl_file   : 7
    <67a>   DW_AT_decl_line   : 357
    <67c>   DW_AT_decl_column : 8
    <67d>   DW_AT_sibling     : <0x71c>
 <2><681>: Abbrev Number: 1 (DW_TAG_member)
    <682>   DW_AT_name        : (indirect string, offset: 0x7f966): _strtok_last
    <686>   DW_AT_decl_file   : 7
    <687>   DW_AT_decl_line   : 360
    <689>   DW_AT_decl_column : 9
    <68a>   DW_AT_type        : <0x524>
    <68e>   DW_AT_data_member_location: 0
 <2><68f>: Abbrev Number: 1 (DW_TAG_member)
    <690>   DW_AT_name        : (indirect string, offset: 0x3c775): _mblen_state
    <694>   DW_AT_decl_file   : 7
    <695>   DW_AT_decl_line   : 361
    <697>   DW_AT_decl_column : 14
    <698>   DW_AT_type        : <0x15e>
    <69c>   DW_AT_data_member_location: 4
 <2><69d>: Abbrev Number: 1 (DW_TAG_member)
    <69e>   DW_AT_name        : (indirect string, offset: 0x7f995): _wctomb_state
    <6a2>   DW_AT_decl_file   : 7
    <6a3>   DW_AT_decl_line   : 362
    <6a5>   DW_AT_decl_column : 14
    <6a6>   DW_AT_type        : <0x15e>
    <6aa>   DW_AT_data_member_location: 12
 <2><6ab>: Abbrev Number: 1 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x76cc7): _mbtowc_state
    <6b0>   DW_AT_decl_file   : 7
    <6b1>   DW_AT_decl_line   : 363
    <6b3>   DW_AT_decl_column : 14
    <6b4>   DW_AT_type        : <0x15e>
    <6b8>   DW_AT_data_member_location: 20
 <2><6b9>: Abbrev Number: 1 (DW_TAG_member)
    <6ba>   DW_AT_name        : (indirect string, offset: 0x46aa8): _l64a_buf
    <6be>   DW_AT_decl_file   : 7
    <6bf>   DW_AT_decl_line   : 364
    <6c1>   DW_AT_decl_column : 8
    <6c2>   DW_AT_type        : <0x71c>
    <6c6>   DW_AT_data_member_location: 28
 <2><6c7>: Abbrev Number: 1 (DW_TAG_member)
    <6c8>   DW_AT_name        : (indirect string, offset: 0x7eb29): _getdate_err
    <6cc>   DW_AT_decl_file   : 7
    <6cd>   DW_AT_decl_line   : 365
    <6cf>   DW_AT_decl_column : 7
    <6d0>   DW_AT_type        : <0x2a>
    <6d4>   DW_AT_data_member_location: 36
 <2><6d5>: Abbrev Number: 1 (DW_TAG_member)
    <6d6>   DW_AT_name        : (indirect string, offset: 0x433f2): _mbrlen_state
    <6da>   DW_AT_decl_file   : 7
    <6db>   DW_AT_decl_line   : 366
    <6dd>   DW_AT_decl_column : 14
    <6de>   DW_AT_type        : <0x15e>
    <6e2>   DW_AT_data_member_location: 40
 <2><6e3>: Abbrev Number: 1 (DW_TAG_member)
    <6e4>   DW_AT_name        : (indirect string, offset: 0x1e9f8): _mbrtowc_state
    <6e8>   DW_AT_decl_file   : 7
    <6e9>   DW_AT_decl_line   : 367
    <6eb>   DW_AT_decl_column : 14
    <6ec>   DW_AT_type        : <0x15e>
    <6f0>   DW_AT_data_member_location: 48
 <2><6f1>: Abbrev Number: 1 (DW_TAG_member)
    <6f2>   DW_AT_name        : (indirect string, offset: 0x5bd0e): _mbsrtowcs_state
    <6f6>   DW_AT_decl_file   : 7
    <6f7>   DW_AT_decl_line   : 368
    <6f9>   DW_AT_decl_column : 14
    <6fa>   DW_AT_type        : <0x15e>
    <6fe>   DW_AT_data_member_location: 56
 <2><6ff>: Abbrev Number: 1 (DW_TAG_member)
    <700>   DW_AT_name        : (indirect string, offset: 0x2ad0f): _wcrtomb_state
    <704>   DW_AT_decl_file   : 7
    <705>   DW_AT_decl_line   : 369
    <707>   DW_AT_decl_column : 14
    <708>   DW_AT_type        : <0x15e>
    <70c>   DW_AT_data_member_location: 64
 <2><70d>: Abbrev Number: 1 (DW_TAG_member)
    <70e>   DW_AT_name        : (indirect string, offset: 0x4f5f3): _wcsrtombs_state
    <712>   DW_AT_decl_file   : 7
    <713>   DW_AT_decl_line   : 370
    <715>   DW_AT_decl_column : 14
    <716>   DW_AT_type        : <0x15e>
    <71a>   DW_AT_data_member_location: 72
 <2><71b>: Abbrev Number: 0
 <1><71c>: Abbrev Number: 7 (DW_TAG_array_type)
    <71d>   DW_AT_type        : <0x529>
    <721>   DW_AT_sibling     : <0x72c>
 <2><725>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <726>   DW_AT_type        : <0x31>
    <72a>   DW_AT_upper_bound : 7
 <2><72b>: Abbrev Number: 0
 <1><72c>: Abbrev Number: 16 (DW_TAG_structure_type)
    <72d>   DW_AT_name        : (indirect string, offset: 0x775db): __locale_t
    <731>   DW_AT_declaration : 1
 <1><731>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <732>   DW_AT_byte_size   : 4
    <732>   DW_AT_type        : <0x72c>
 <1><736>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <737>   DW_AT_byte_size   : 4
    <737>   DW_AT_type        : <0x627>
 <1><73b>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <73c>   DW_AT_prototyped  : 1
    <73c>   DW_AT_sibling     : <0x746>
 <2><740>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <741>   DW_AT_type        : <0x501>
 <2><745>: Abbrev Number: 0
 <1><746>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <747>   DW_AT_byte_size   : 4
    <747>   DW_AT_type        : <0x73b>
 <1><74b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <74c>   DW_AT_byte_size   : 4
    <74c>   DW_AT_type        : <0x5d0>
 <1><750>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <751>   DW_AT_byte_size   : 4
    <751>   DW_AT_type        : <0x203>
 <1><755>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <756>   DW_AT_prototyped  : 1
    <756>   DW_AT_sibling     : <0x760>
 <2><75a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <75b>   DW_AT_type        : <0x2a>
 <2><75f>: Abbrev Number: 0
 <1><760>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <761>   DW_AT_byte_size   : 4
    <761>   DW_AT_type        : <0x765>
 <1><765>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <766>   DW_AT_byte_size   : 4
    <766>   DW_AT_type        : <0x755>
 <1><76a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <76b>   DW_AT_byte_size   : 4
    <76b>   DW_AT_type        : <0x673>
 <1><76f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <770>   DW_AT_name        : (indirect string, offset: 0x74824): xSTATIC_LIST_ITEM
    <774>   DW_AT_byte_size   : 20
    <775>   DW_AT_decl_file   : 9
    <776>   DW_AT_decl_line   : 1061
    <778>   DW_AT_decl_column : 8
    <779>   DW_AT_sibling     : <0x79a>
 <2><77d>: Abbrev Number: 1 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0x94489): xDummy2
    <782>   DW_AT_decl_file   : 9
    <783>   DW_AT_decl_line   : 1066
    <785>   DW_AT_decl_column : 13
    <786>   DW_AT_type        : <0xd9>
    <78a>   DW_AT_data_member_location: 0
 <2><78b>: Abbrev Number: 1 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x31dd7): pvDummy3
    <790>   DW_AT_decl_file   : 9
    <791>   DW_AT_decl_line   : 1067
    <793>   DW_AT_decl_column : 8
    <794>   DW_AT_type        : <0x79a>
    <798>   DW_AT_data_member_location: 4
 <2><799>: Abbrev Number: 0
 <1><79a>: Abbrev Number: 7 (DW_TAG_array_type)
    <79b>   DW_AT_type        : <0xbf>
    <79f>   DW_AT_sibling     : <0x7aa>
 <2><7a3>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <7a4>   DW_AT_type        : <0x31>
    <7a8>   DW_AT_upper_bound : 3
 <2><7a9>: Abbrev Number: 0
 <1><7aa>: Abbrev Number: 11 (DW_TAG_typedef)
    <7ab>   DW_AT_name        : (indirect string, offset: 0x32044): StaticListItem_t
    <7af>   DW_AT_decl_file   : 9
    <7b0>   DW_AT_decl_line   : 1072
    <7b2>   DW_AT_decl_column : 34
    <7b3>   DW_AT_type        : <0x76f>
 <1><7b7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7b8>   DW_AT_name        : (indirect string, offset: 0x4fe85): xSTATIC_TCB
    <7bc>   DW_AT_byte_size   : 160
    <7bd>   DW_AT_decl_file   : 9
    <7be>   DW_AT_decl_line   : 1112
    <7c0>   DW_AT_decl_column : 16
    <7c1>   DW_AT_sibling     : <0x852>
 <2><7c5>: Abbrev Number: 1 (DW_TAG_member)
    <7c6>   DW_AT_name        : (indirect string, offset: 0x1c9ac): pxDummy1
    <7ca>   DW_AT_decl_file   : 9
    <7cb>   DW_AT_decl_line   : 1114
    <7cd>   DW_AT_decl_column : 11
    <7ce>   DW_AT_type        : <0xbf>
    <7d2>   DW_AT_data_member_location: 0
 <2><7d3>: Abbrev Number: 1 (DW_TAG_member)
    <7d4>   DW_AT_name        : (indirect string, offset: 0x1adda): xDummy3
    <7d8>   DW_AT_decl_file   : 9
    <7d9>   DW_AT_decl_line   : 1118
    <7db>   DW_AT_decl_column : 19
    <7dc>   DW_AT_type        : <0x852>
    <7e0>   DW_AT_data_member_location: 4
 <2><7e1>: Abbrev Number: 1 (DW_TAG_member)
    <7e2>   DW_AT_name        : (indirect string, offset: 0x13685): uxDummy5
    <7e6>   DW_AT_decl_file   : 9
    <7e7>   DW_AT_decl_line   : 1119
    <7e9>   DW_AT_decl_column : 16
    <7ea>   DW_AT_type        : <0xcd>
    <7ee>   DW_AT_data_member_location: 44
 <2><7ef>: Abbrev Number: 1 (DW_TAG_member)
    <7f0>   DW_AT_name        : (indirect string, offset: 0x1c9cf): pxDummy6
    <7f4>   DW_AT_decl_file   : 9
    <7f5>   DW_AT_decl_line   : 1120
    <7f7>   DW_AT_decl_column : 11
    <7f8>   DW_AT_type        : <0xbf>
    <7fc>   DW_AT_data_member_location: 48
 <2><7fd>: Abbrev Number: 1 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0x30f82): ucDummy7
    <802>   DW_AT_decl_file   : 9
    <803>   DW_AT_decl_line   : 1121
    <805>   DW_AT_decl_column : 13
    <806>   DW_AT_type        : <0x862>
    <80a>   DW_AT_data_member_location: 52
 <2><80b>: Abbrev Number: 1 (DW_TAG_member)
    <80c>   DW_AT_name        : (indirect string, offset: 0x7dfe5): uxDummy12
    <810>   DW_AT_decl_file   : 9
    <811>   DW_AT_decl_line   : 1132
    <813>   DW_AT_decl_column : 16
    <814>   DW_AT_type        : <0x872>
    <818>   DW_AT_data_member_location: 68
 <2><819>: Abbrev Number: 1 (DW_TAG_member)
    <81a>   DW_AT_name        : (indirect string, offset: 0x6f267): xDummy17
    <81e>   DW_AT_decl_file   : 9
    <81f>   DW_AT_decl_line   : 1144
    <821>   DW_AT_decl_column : 17
    <822>   DW_AT_type        : <0x3e8>
    <826>   DW_AT_data_member_location: 76
 <2><827>: Abbrev Number: 1 (DW_TAG_member)
    <828>   DW_AT_name        : (indirect string, offset: 0x146bd): ulDummy18
    <82c>   DW_AT_decl_file   : 9
    <82d>   DW_AT_decl_line   : 1147
    <82f>   DW_AT_decl_column : 14
    <830>   DW_AT_type        : <0xb3>
    <834>   DW_AT_data_member_location: 152
 <2><835>: Abbrev Number: 1 (DW_TAG_member)
    <836>   DW_AT_name        : (indirect string, offset: 0x893f9): ucDummy19
    <83a>   DW_AT_decl_file   : 9
    <83b>   DW_AT_decl_line   : 1148
    <83d>   DW_AT_decl_column : 13
    <83e>   DW_AT_type        : <0x9b>
    <842>   DW_AT_data_member_location: 156
 <2><843>: Abbrev Number: 1 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x7e367): uxDummy20
    <848>   DW_AT_decl_file   : 9
    <849>   DW_AT_decl_line   : 1151
    <84b>   DW_AT_decl_column : 13
    <84c>   DW_AT_type        : <0x9b>
    <850>   DW_AT_data_member_location: 157
 <2><851>: Abbrev Number: 0
 <1><852>: Abbrev Number: 7 (DW_TAG_array_type)
    <853>   DW_AT_type        : <0x7aa>
    <857>   DW_AT_sibling     : <0x862>
 <2><85b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <85c>   DW_AT_type        : <0x31>
    <860>   DW_AT_upper_bound : 1
 <2><861>: Abbrev Number: 0
 <1><862>: Abbrev Number: 7 (DW_TAG_array_type)
    <863>   DW_AT_type        : <0x9b>
    <867>   DW_AT_sibling     : <0x872>
 <2><86b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <86c>   DW_AT_type        : <0x31>
    <870>   DW_AT_upper_bound : 15
 <2><871>: Abbrev Number: 0
 <1><872>: Abbrev Number: 7 (DW_TAG_array_type)
    <873>   DW_AT_type        : <0xcd>
    <877>   DW_AT_sibling     : <0x882>
 <2><87b>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <87c>   DW_AT_type        : <0x31>
    <880>   DW_AT_upper_bound : 1
 <2><881>: Abbrev Number: 0
 <1><882>: Abbrev Number: 11 (DW_TAG_typedef)
    <883>   DW_AT_name        : (indirect string, offset: 0x44df1): StaticTask_t
    <887>   DW_AT_decl_file   : 9
    <888>   DW_AT_decl_line   : 1160
    <88a>   DW_AT_decl_column : 3
    <88b>   DW_AT_type        : <0x7b7>
 <1><88f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <890>   DW_AT_byte_size   : 4
    <890>   DW_AT_type        : <0xc1>
 <1><894>: Abbrev Number: 18 (DW_TAG_variable)
    <895>   DW_AT_name        : (indirect string, offset: 0x49809): xIdleTaskTCBBuffer
    <899>   DW_AT_decl_file   : 1
    <899>   DW_AT_decl_line   : 59
    <89a>   DW_AT_decl_column : 21
    <89b>   DW_AT_type        : <0x882>
    <89f>   DW_AT_location    : 5 byte block: 3 80 0 0 20 	(DW_OP_addr: 20000080)
 <1><8a5>: Abbrev Number: 7 (DW_TAG_array_type)
    <8a6>   DW_AT_type        : <0xc1>
    <8aa>   DW_AT_sibling     : <0x8b5>
 <2><8ae>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <8af>   DW_AT_type        : <0x31>
    <8b3>   DW_AT_upper_bound : 127
 <2><8b4>: Abbrev Number: 0
 <1><8b5>: Abbrev Number: 18 (DW_TAG_variable)
    <8b6>   DW_AT_name        : (indirect string, offset: 0x33d8d): xIdleStack
    <8ba>   DW_AT_decl_file   : 1
    <8ba>   DW_AT_decl_line   : 60
    <8bb>   DW_AT_decl_column : 20
    <8bc>   DW_AT_type        : <0x8a5>
    <8c0>   DW_AT_location    : 5 byte block: 3 20 1 0 20 	(DW_OP_addr: 20000120)
 <1><8c6>: Abbrev Number: 26 (DW_TAG_subprogram)
    <8c7>   DW_AT_external    : 1
    <8c7>   DW_AT_name        : (indirect string, offset: 0xe599): vApplicationGetIdleTaskMemory
    <8cb>   DW_AT_decl_file   : 1
    <8cc>   DW_AT_decl_line   : 62
    <8cd>   DW_AT_decl_column : 6
    <8ce>   DW_AT_prototyped  : 1
    <8ce>   DW_AT_low_pc      : 0x8000d0c
    <8d2>   DW_AT_high_pc     : 0x34
    <8d6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8d8>   DW_AT_call_all_calls: 1
    <8d8>   DW_AT_sibling     : <0x904>
 <2><8dc>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8dd>   DW_AT_name        : (indirect string, offset: 0x49807): ppxIdleTaskTCBBuffer
    <8e1>   DW_AT_decl_file   : 1
    <8e1>   DW_AT_decl_line   : 62
    <8e1>   DW_AT_decl_column : 52
    <8e2>   DW_AT_type        : <0x904>
    <8e6>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8e9>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8ea>   DW_AT_name        : (indirect string, offset: 0x50c91): ppxIdleTaskStackBuffer
    <8ee>   DW_AT_decl_file   : 1
    <8ee>   DW_AT_decl_line   : 62
    <8ee>   DW_AT_decl_column : 88
    <8ef>   DW_AT_type        : <0x90e>
    <8f3>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><8f6>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8f7>   DW_AT_name        : (indirect string, offset: 0x55aaa): pulIdleTaskStackSize
    <8fb>   DW_AT_decl_file   : 1
    <8fb>   DW_AT_decl_line   : 62
    <8fb>   DW_AT_decl_column : 122
    <8fc>   DW_AT_type        : <0x913>
    <900>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><903>: Abbrev Number: 0
 <1><904>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <905>   DW_AT_byte_size   : 4
    <905>   DW_AT_type        : <0x909>
 <1><909>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <90a>   DW_AT_byte_size   : 4
    <90a>   DW_AT_type        : <0x882>
 <1><90e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <90f>   DW_AT_byte_size   : 4
    <90f>   DW_AT_type        : <0x88f>
 <1><913>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <914>   DW_AT_byte_size   : 4
    <914>   DW_AT_type        : <0xb3>
 <1><918>: Abbrev Number: 0
  Compilation Unit @ offset 0x919:
   Length:        0x1fc7 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x16f
   Pointer Size:  4
 <0><925>: Abbrev Number: 40 (DW_TAG_compile_unit)
    <926>   DW_AT_producer    : (indirect string, offset: 0x3352a): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <92a>   DW_AT_language    : 29	(C11)
    <92b>   DW_AT_name        : (indirect string, offset: 0x90a24): ../Core/Src/main.c
    <92f>   DW_AT_comp_dir    : (indirect string, offset: 0x48c21): C:/Users/Bazar/Desktop/sbzrgn/STM32F411Discovery_CubeAI_GestureRecognition_MPU9250_AHRS_FreeRTOS/CubeAI_GestureRecognition_MPU9250_AHRS_FreeRTOS/Debug
    <933>   DW_AT_ranges      : 0x1f
    <937>   DW_AT_low_pc      : 0
    <93b>   DW_AT_stmt_list   : 0x973
    <93f>   DW_AT_macros      : 0x151d6
 <1><943>: Abbrev Number: 13 (DW_TAG_base_type)
    <944>   DW_AT_byte_size   : 1
    <945>   DW_AT_encoding    : 6	(signed char)
    <946>   DW_AT_name        : (indirect string, offset: 0x45cac): signed char
 <1><94a>: Abbrev Number: 4 (DW_TAG_typedef)
    <94b>   DW_AT_name        : (indirect string, offset: 0x282f0): __uint8_t
    <94f>   DW_AT_decl_file   : 3
    <950>   DW_AT_decl_line   : 43
    <951>   DW_AT_decl_column : 24
    <952>   DW_AT_type        : <0x956>
 <1><956>: Abbrev Number: 13 (DW_TAG_base_type)
    <957>   DW_AT_byte_size   : 1
    <958>   DW_AT_encoding    : 8	(unsigned char)
    <959>   DW_AT_name        : (indirect string, offset: 0x1c99e): unsigned char
 <1><95d>: Abbrev Number: 4 (DW_TAG_typedef)
    <95e>   DW_AT_name        : (indirect string, offset: 0x90101): __int16_t
    <962>   DW_AT_decl_file   : 3
    <963>   DW_AT_decl_line   : 55
    <964>   DW_AT_decl_column : 24
    <965>   DW_AT_type        : <0x969>
 <1><969>: Abbrev Number: 13 (DW_TAG_base_type)
    <96a>   DW_AT_byte_size   : 2
    <96b>   DW_AT_encoding    : 5	(signed)
    <96c>   DW_AT_name        : (indirect string, offset: 0x67c68): short int
 <1><970>: Abbrev Number: 4 (DW_TAG_typedef)
    <971>   DW_AT_name        : (indirect string, offset: 0x71ac8): __uint16_t
    <975>   DW_AT_decl_file   : 3
    <976>   DW_AT_decl_line   : 57
    <977>   DW_AT_decl_column : 25
    <978>   DW_AT_type        : <0x97c>
 <1><97c>: Abbrev Number: 13 (DW_TAG_base_type)
    <97d>   DW_AT_byte_size   : 2
    <97e>   DW_AT_encoding    : 7	(unsigned)
    <97f>   DW_AT_name        : (indirect string, offset: 0x85c30): short unsigned int
 <1><983>: Abbrev Number: 13 (DW_TAG_base_type)
    <984>   DW_AT_byte_size   : 4
    <985>   DW_AT_encoding    : 5	(signed)
    <986>   DW_AT_name        : (indirect string, offset: 0xb72a): long int
 <1><98a>: Abbrev Number: 4 (DW_TAG_typedef)
    <98b>   DW_AT_name        : (indirect string, offset: 0x58609): __uint32_t
    <98f>   DW_AT_decl_file   : 3
    <990>   DW_AT_decl_line   : 79
    <991>   DW_AT_decl_column : 25
    <992>   DW_AT_type        : <0x996>
 <1><996>: Abbrev Number: 13 (DW_TAG_base_type)
    <997>   DW_AT_byte_size   : 4
    <998>   DW_AT_encoding    : 7	(unsigned)
    <999>   DW_AT_name        : (indirect string, offset: 0x2addb): long unsigned int
 <1><99d>: Abbrev Number: 13 (DW_TAG_base_type)
    <99e>   DW_AT_byte_size   : 8
    <99f>   DW_AT_encoding    : 5	(signed)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x3f569): long long int
 <1><9a4>: Abbrev Number: 13 (DW_TAG_base_type)
    <9a5>   DW_AT_byte_size   : 8
    <9a6>   DW_AT_encoding    : 7	(unsigned)
    <9a7>   DW_AT_name        : (indirect string, offset: 0x1d2a1): long long unsigned int
 <1><9ab>: Abbrev Number: 41 (DW_TAG_base_type)
    <9ac>   DW_AT_byte_size   : 4
    <9ad>   DW_AT_encoding    : 5	(signed)
    <9ae>   DW_AT_name        : int
 <1><9b2>: Abbrev Number: 13 (DW_TAG_base_type)
    <9b3>   DW_AT_byte_size   : 4
    <9b4>   DW_AT_encoding    : 7	(unsigned)
    <9b5>   DW_AT_name        : (indirect string, offset: 0xb1c6): unsigned int
 <1><9b9>: Abbrev Number: 4 (DW_TAG_typedef)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x282f2): uint8_t
    <9be>   DW_AT_decl_file   : 4
    <9bf>   DW_AT_decl_line   : 24
    <9c0>   DW_AT_decl_column : 19
    <9c1>   DW_AT_type        : <0x94a>
 <1><9c5>: Abbrev Number: 29 (DW_TAG_const_type)
    <9c6>   DW_AT_type        : <0x9b9>
 <1><9ca>: Abbrev Number: 4 (DW_TAG_typedef)
    <9cb>   DW_AT_name        : (indirect string, offset: 0x90103): int16_t
    <9cf>   DW_AT_decl_file   : 4
    <9d0>   DW_AT_decl_line   : 32
    <9d1>   DW_AT_decl_column : 19
    <9d2>   DW_AT_type        : <0x95d>
 <1><9d6>: Abbrev Number: 4 (DW_TAG_typedef)
    <9d7>   DW_AT_name        : (indirect string, offset: 0x6570d): uint16_t
    <9db>   DW_AT_decl_file   : 4
    <9dc>   DW_AT_decl_line   : 36
    <9dd>   DW_AT_decl_column : 20
    <9de>   DW_AT_type        : <0x970>
 <1><9e2>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <9e3>   DW_AT_type        : <0x9d6>
 <1><9e7>: Abbrev Number: 4 (DW_TAG_typedef)
    <9e8>   DW_AT_name        : (indirect string, offset: 0x64fca): uint32_t
    <9ec>   DW_AT_decl_file   : 4
    <9ed>   DW_AT_decl_line   : 48
    <9ee>   DW_AT_decl_column : 20
    <9ef>   DW_AT_type        : <0x98a>
 <1><9f3>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <9f4>   DW_AT_type        : <0x9e7>
 <1><9f8>: Abbrev Number: 9 (DW_TAG_array_type)
    <9f9>   DW_AT_type        : <0x9e7>
    <9fd>   DW_AT_sibling     : <0xa08>
 <2><a01>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <a02>   DW_AT_type        : <0x9b2>
    <a06>   DW_AT_upper_bound : 0
 <2><a07>: Abbrev Number: 0
 <1><a08>: Abbrev Number: 9 (DW_TAG_array_type)
    <a09>   DW_AT_type        : <0x9e7>
    <a0d>   DW_AT_sibling     : <0xa18>
 <2><a11>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <a12>   DW_AT_type        : <0x9b2>
    <a16>   DW_AT_upper_bound : 1
 <2><a17>: Abbrev Number: 0
 <1><a18>: Abbrev Number: 15 (DW_TAG_structure_type)
    <a19>   DW_AT_byte_size   : 24
    <a1a>   DW_AT_decl_file   : 5
    <a1b>   DW_AT_decl_line   : 214
    <a1c>   DW_AT_decl_column : 9
    <a1c>   DW_AT_sibling     : <0xa6e>
 <2><a20>: Abbrev Number: 8 (DW_TAG_member)
    <a21>   DW_AT_name        : CR
    <a24>   DW_AT_decl_file   : 5
    <a25>   DW_AT_decl_line   : 216
    <a26>   DW_AT_decl_column : 17
    <a27>   DW_AT_type        : <0x9f3>
    <a2b>   DW_AT_data_member_location: 0
 <2><a2c>: Abbrev Number: 1 (DW_TAG_member)
    <a2d>   DW_AT_name        : (indirect string, offset: 0x8e59d): NDTR
    <a31>   DW_AT_decl_file   : 5
    <a32>   DW_AT_decl_line   : 217
    <a33>   DW_AT_decl_column : 17
    <a34>   DW_AT_type        : <0x9f3>
    <a38>   DW_AT_data_member_location: 4
 <2><a39>: Abbrev Number: 8 (DW_TAG_member)
    <a3a>   DW_AT_name        : PAR
    <a3e>   DW_AT_decl_file   : 5
    <a3f>   DW_AT_decl_line   : 218
    <a40>   DW_AT_decl_column : 17
    <a41>   DW_AT_type        : <0x9f3>
    <a45>   DW_AT_data_member_location: 8
 <2><a46>: Abbrev Number: 1 (DW_TAG_member)
    <a47>   DW_AT_name        : (indirect string, offset: 0x8e143): M0AR
    <a4b>   DW_AT_decl_file   : 5
    <a4c>   DW_AT_decl_line   : 219
    <a4d>   DW_AT_decl_column : 17
    <a4e>   DW_AT_type        : <0x9f3>
    <a52>   DW_AT_data_member_location: 12
 <2><a53>: Abbrev Number: 1 (DW_TAG_member)
    <a54>   DW_AT_name        : (indirect string, offset: 0x8cad4): M1AR
    <a58>   DW_AT_decl_file   : 5
    <a59>   DW_AT_decl_line   : 220
    <a5a>   DW_AT_decl_column : 17
    <a5b>   DW_AT_type        : <0x9f3>
    <a5f>   DW_AT_data_member_location: 16
 <2><a60>: Abbrev Number: 8 (DW_TAG_member)
    <a61>   DW_AT_name        : FCR
    <a65>   DW_AT_decl_file   : 5
    <a66>   DW_AT_decl_line   : 221
    <a67>   DW_AT_decl_column : 17
    <a68>   DW_AT_type        : <0x9f3>
    <a6c>   DW_AT_data_member_location: 20
 <2><a6d>: Abbrev Number: 0
 <1><a6e>: Abbrev Number: 4 (DW_TAG_typedef)
    <a6f>   DW_AT_name        : (indirect string, offset: 0x90b48): DMA_Stream_TypeDef
    <a73>   DW_AT_decl_file   : 5
    <a74>   DW_AT_decl_line   : 222
    <a75>   DW_AT_decl_column : 3
    <a76>   DW_AT_type        : <0xa18>
 <1><a7a>: Abbrev Number: 23 (DW_TAG_structure_type)
    <a7b>   DW_AT_byte_size   : 40
    <a7c>   DW_AT_decl_file   : 5
    <a7d>   DW_AT_decl_line   : 265
    <a7f>   DW_AT_decl_column : 9
    <a7f>   DW_AT_sibling     : <0xb02>
 <2><a83>: Abbrev Number: 2 (DW_TAG_member)
    <a84>   DW_AT_name        : (indirect string, offset: 0x8c200): MODER
    <a88>   DW_AT_decl_file   : 5
    <a89>   DW_AT_decl_line   : 267
    <a8b>   DW_AT_decl_column : 17
    <a8c>   DW_AT_type        : <0x9f3>
    <a90>   DW_AT_data_member_location: 0
 <2><a91>: Abbrev Number: 2 (DW_TAG_member)
    <a92>   DW_AT_name        : (indirect string, offset: 0x8fecb): OTYPER
    <a96>   DW_AT_decl_file   : 5
    <a97>   DW_AT_decl_line   : 268
    <a99>   DW_AT_decl_column : 17
    <a9a>   DW_AT_type        : <0x9f3>
    <a9e>   DW_AT_data_member_location: 4
 <2><a9f>: Abbrev Number: 2 (DW_TAG_member)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x90800): OSPEEDR
    <aa4>   DW_AT_decl_file   : 5
    <aa5>   DW_AT_decl_line   : 269
    <aa7>   DW_AT_decl_column : 17
    <aa8>   DW_AT_type        : <0x9f3>
    <aac>   DW_AT_data_member_location: 8
 <2><aad>: Abbrev Number: 2 (DW_TAG_member)
    <aae>   DW_AT_name        : (indirect string, offset: 0x8faae): PUPDR
    <ab2>   DW_AT_decl_file   : 5
    <ab3>   DW_AT_decl_line   : 270
    <ab5>   DW_AT_decl_column : 17
    <ab6>   DW_AT_type        : <0x9f3>
    <aba>   DW_AT_data_member_location: 12
 <2><abb>: Abbrev Number: 7 (DW_TAG_member)
    <abc>   DW_AT_name        : IDR
    <ac0>   DW_AT_decl_file   : 5
    <ac1>   DW_AT_decl_line   : 271
    <ac3>   DW_AT_decl_column : 17
    <ac4>   DW_AT_type        : <0x9f3>
    <ac8>   DW_AT_data_member_location: 16
 <2><ac9>: Abbrev Number: 7 (DW_TAG_member)
    <aca>   DW_AT_name        : ODR
    <ace>   DW_AT_decl_file   : 5
    <acf>   DW_AT_decl_line   : 272
    <ad1>   DW_AT_decl_column : 17
    <ad2>   DW_AT_type        : <0x9f3>
    <ad6>   DW_AT_data_member_location: 20
 <2><ad7>: Abbrev Number: 2 (DW_TAG_member)
    <ad8>   DW_AT_name        : (indirect string, offset: 0x8d3e8): BSRR
    <adc>   DW_AT_decl_file   : 5
    <add>   DW_AT_decl_line   : 273
    <adf>   DW_AT_decl_column : 17
    <ae0>   DW_AT_type        : <0x9f3>
    <ae4>   DW_AT_data_member_location: 24
 <2><ae5>: Abbrev Number: 2 (DW_TAG_member)
    <ae6>   DW_AT_name        : (indirect string, offset: 0x90611): LCKR
    <aea>   DW_AT_decl_file   : 5
    <aeb>   DW_AT_decl_line   : 274
    <aed>   DW_AT_decl_column : 17
    <aee>   DW_AT_type        : <0x9f3>
    <af2>   DW_AT_data_member_location: 28
 <2><af3>: Abbrev Number: 7 (DW_TAG_member)
    <af4>   DW_AT_name        : AFR
    <af8>   DW_AT_decl_file   : 5
    <af9>   DW_AT_decl_line   : 275
    <afb>   DW_AT_decl_column : 17
    <afc>   DW_AT_type        : <0xb12>
    <b00>   DW_AT_data_member_location: 32
 <2><b01>: Abbrev Number: 0
 <1><b02>: Abbrev Number: 9 (DW_TAG_array_type)
    <b03>   DW_AT_type        : <0x9f3>
    <b07>   DW_AT_sibling     : <0xb12>
 <2><b0b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <b0c>   DW_AT_type        : <0x9b2>
    <b10>   DW_AT_upper_bound : 1
 <2><b11>: Abbrev Number: 0
 <1><b12>: Abbrev Number: 17 (DW_TAG_volatile_type)
    <b13>   DW_AT_type        : <0xb02>
 <1><b17>: Abbrev Number: 11 (DW_TAG_typedef)
    <b18>   DW_AT_name        : (indirect string, offset: 0x911d5): GPIO_TypeDef
    <b1c>   DW_AT_decl_file   : 5
    <b1d>   DW_AT_decl_line   : 276
    <b1f>   DW_AT_decl_column : 3
    <b20>   DW_AT_type        : <0xa7a>
 <1><b24>: Abbrev Number: 23 (DW_TAG_structure_type)
    <b25>   DW_AT_byte_size   : 8
    <b26>   DW_AT_decl_file   : 5
    <b27>   DW_AT_decl_line   : 326
    <b29>   DW_AT_decl_column : 9
    <b29>   DW_AT_sibling     : <0xb49>
 <2><b2d>: Abbrev Number: 7 (DW_TAG_member)
    <b2e>   DW_AT_name        : CR
    <b31>   DW_AT_decl_file   : 5
    <b32>   DW_AT_decl_line   : 328
    <b34>   DW_AT_decl_column : 17
    <b35>   DW_AT_type        : <0x9f3>
    <b39>   DW_AT_data_member_location: 0
 <2><b3a>: Abbrev Number: 7 (DW_TAG_member)
    <b3b>   DW_AT_name        : CSR
    <b3f>   DW_AT_decl_file   : 5
    <b40>   DW_AT_decl_line   : 329
    <b42>   DW_AT_decl_column : 17
    <b43>   DW_AT_type        : <0x9f3>
    <b47>   DW_AT_data_member_location: 4
 <2><b48>: Abbrev Number: 0
 <1><b49>: Abbrev Number: 11 (DW_TAG_typedef)
    <b4a>   DW_AT_name        : (indirect string, offset: 0x8facc): PWR_TypeDef
    <b4e>   DW_AT_decl_file   : 5
    <b4f>   DW_AT_decl_line   : 330
    <b51>   DW_AT_decl_column : 3
    <b52>   DW_AT_type        : <0xb24>
 <1><b56>: Abbrev Number: 23 (DW_TAG_structure_type)
    <b57>   DW_AT_byte_size   : 144
    <b58>   DW_AT_decl_file   : 5
    <b59>   DW_AT_decl_line   : 336
    <b5b>   DW_AT_decl_column : 9
    <b5b>   DW_AT_sibling     : <0xd1f>
 <2><b5f>: Abbrev Number: 7 (DW_TAG_member)
    <b60>   DW_AT_name        : CR
    <b63>   DW_AT_decl_file   : 5
    <b64>   DW_AT_decl_line   : 338
    <b66>   DW_AT_decl_column : 17
    <b67>   DW_AT_type        : <0x9f3>
    <b6b>   DW_AT_data_member_location: 0
 <2><b6c>: Abbrev Number: 2 (DW_TAG_member)
    <b6d>   DW_AT_name        : (indirect string, offset: 0x8f99a): PLLCFGR
    <b71>   DW_AT_decl_file   : 5
    <b72>   DW_AT_decl_line   : 339
    <b74>   DW_AT_decl_column : 17
    <b75>   DW_AT_type        : <0x9f3>
    <b79>   DW_AT_data_member_location: 4
 <2><b7a>: Abbrev Number: 2 (DW_TAG_member)
    <b7b>   DW_AT_name        : (indirect string, offset: 0x8e2ca): CFGR
    <b7f>   DW_AT_decl_file   : 5
    <b80>   DW_AT_decl_line   : 340
    <b82>   DW_AT_decl_column : 17
    <b83>   DW_AT_type        : <0x9f3>
    <b87>   DW_AT_data_member_location: 8
 <2><b88>: Abbrev Number: 7 (DW_TAG_member)
    <b89>   DW_AT_name        : CIR
    <b8d>   DW_AT_decl_file   : 5
    <b8e>   DW_AT_decl_line   : 341
    <b90>   DW_AT_decl_column : 17
    <b91>   DW_AT_type        : <0x9f3>
    <b95>   DW_AT_data_member_location: 12
 <2><b96>: Abbrev Number: 2 (DW_TAG_member)
    <b97>   DW_AT_name        : (indirect string, offset: 0x90115): AHB1RSTR
    <b9b>   DW_AT_decl_file   : 5
    <b9c>   DW_AT_decl_line   : 342
    <b9e>   DW_AT_decl_column : 17
    <b9f>   DW_AT_type        : <0x9f3>
    <ba3>   DW_AT_data_member_location: 16
 <2><ba4>: Abbrev Number: 2 (DW_TAG_member)
    <ba5>   DW_AT_name        : (indirect string, offset: 0x8cb87): AHB2RSTR
    <ba9>   DW_AT_decl_file   : 5
    <baa>   DW_AT_decl_line   : 343
    <bac>   DW_AT_decl_column : 17
    <bad>   DW_AT_type        : <0x9f3>
    <bb1>   DW_AT_data_member_location: 20
 <2><bb2>: Abbrev Number: 2 (DW_TAG_member)
    <bb3>   DW_AT_name        : (indirect string, offset: 0x8e2be): AHB3RSTR
    <bb7>   DW_AT_decl_file   : 5
    <bb8>   DW_AT_decl_line   : 344
    <bba>   DW_AT_decl_column : 17
    <bbb>   DW_AT_type        : <0x9f3>
    <bbf>   DW_AT_data_member_location: 24
 <2><bc0>: Abbrev Number: 2 (DW_TAG_member)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x90fd4): RESERVED0
    <bc5>   DW_AT_decl_file   : 5
    <bc6>   DW_AT_decl_line   : 345
    <bc8>   DW_AT_decl_column : 17
    <bc9>   DW_AT_type        : <0x9e7>
    <bcd>   DW_AT_data_member_location: 28
 <2><bce>: Abbrev Number: 2 (DW_TAG_member)
    <bcf>   DW_AT_name        : (indirect string, offset: 0x8cb7e): APB1RSTR
    <bd3>   DW_AT_decl_file   : 5
    <bd4>   DW_AT_decl_line   : 346
    <bd6>   DW_AT_decl_column : 17
    <bd7>   DW_AT_type        : <0x9f3>
    <bdb>   DW_AT_data_member_location: 32
 <2><bdc>: Abbrev Number: 2 (DW_TAG_member)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x8e2a9): APB2RSTR
    <be1>   DW_AT_decl_file   : 5
    <be2>   DW_AT_decl_line   : 347
    <be4>   DW_AT_decl_column : 17
    <be5>   DW_AT_type        : <0x9f3>
    <be9>   DW_AT_data_member_location: 36
 <2><bea>: Abbrev Number: 2 (DW_TAG_member)
    <beb>   DW_AT_name        : (indirect string, offset: 0x90fde): RESERVED1
    <bef>   DW_AT_decl_file   : 5
    <bf0>   DW_AT_decl_line   : 348
    <bf2>   DW_AT_decl_column : 17
    <bf3>   DW_AT_type        : <0xa08>
    <bf7>   DW_AT_data_member_location: 40
 <2><bf8>: Abbrev Number: 2 (DW_TAG_member)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x8ca4e): AHB1ENR
    <bfd>   DW_AT_decl_file   : 5
    <bfe>   DW_AT_decl_line   : 349
    <c00>   DW_AT_decl_column : 17
    <c01>   DW_AT_type        : <0x9f3>
    <c05>   DW_AT_data_member_location: 48
 <2><c06>: Abbrev Number: 2 (DW_TAG_member)
    <c07>   DW_AT_name        : (indirect string, offset: 0x8d5c3): AHB2ENR
    <c0b>   DW_AT_decl_file   : 5
    <c0c>   DW_AT_decl_line   : 350
    <c0e>   DW_AT_decl_column : 17
    <c0f>   DW_AT_type        : <0x9f3>
    <c13>   DW_AT_data_member_location: 52
 <2><c14>: Abbrev Number: 2 (DW_TAG_member)
    <c15>   DW_AT_name        : (indirect string, offset: 0x8e386): AHB3ENR
    <c19>   DW_AT_decl_file   : 5
    <c1a>   DW_AT_decl_line   : 351
    <c1c>   DW_AT_decl_column : 17
    <c1d>   DW_AT_type        : <0x9f3>
    <c21>   DW_AT_data_member_location: 56
 <2><c22>: Abbrev Number: 2 (DW_TAG_member)
    <c23>   DW_AT_name        : (indirect string, offset: 0x90fe8): RESERVED2
    <c27>   DW_AT_decl_file   : 5
    <c28>   DW_AT_decl_line   : 352
    <c2a>   DW_AT_decl_column : 17
    <c2b>   DW_AT_type        : <0x9e7>
    <c2f>   DW_AT_data_member_location: 60
 <2><c30>: Abbrev Number: 2 (DW_TAG_member)
    <c31>   DW_AT_name        : (indirect string, offset: 0x8fc7e): APB1ENR
    <c35>   DW_AT_decl_file   : 5
    <c36>   DW_AT_decl_line   : 353
    <c38>   DW_AT_decl_column : 17
    <c39>   DW_AT_type        : <0x9f3>
    <c3d>   DW_AT_data_member_location: 64
 <2><c3e>: Abbrev Number: 2 (DW_TAG_member)
    <c3f>   DW_AT_name        : (indirect string, offset: 0x8cb90): APB2ENR
    <c43>   DW_AT_decl_file   : 5
    <c44>   DW_AT_decl_line   : 354
    <c46>   DW_AT_decl_column : 17
    <c47>   DW_AT_type        : <0x9f3>
    <c4b>   DW_AT_data_member_location: 68
 <2><c4c>: Abbrev Number: 2 (DW_TAG_member)
    <c4d>   DW_AT_name        : (indirect string, offset: 0x90ff2): RESERVED3
    <c51>   DW_AT_decl_file   : 5
    <c52>   DW_AT_decl_line   : 355
    <c54>   DW_AT_decl_column : 17
    <c55>   DW_AT_type        : <0xa08>
    <c59>   DW_AT_data_member_location: 72
 <2><c5a>: Abbrev Number: 2 (DW_TAG_member)
    <c5b>   DW_AT_name        : (indirect string, offset: 0x8e633): AHB1LPENR
    <c5f>   DW_AT_decl_file   : 5
    <c60>   DW_AT_decl_line   : 356
    <c62>   DW_AT_decl_column : 17
    <c63>   DW_AT_type        : <0x9f3>
    <c67>   DW_AT_data_member_location: 80
 <2><c68>: Abbrev Number: 2 (DW_TAG_member)
    <c69>   DW_AT_name        : (indirect string, offset: 0x8d3de): AHB2LPENR
    <c6d>   DW_AT_decl_file   : 5
    <c6e>   DW_AT_decl_line   : 357
    <c70>   DW_AT_decl_column : 17
    <c71>   DW_AT_type        : <0x9f3>
    <c75>   DW_AT_data_member_location: 84
 <2><c76>: Abbrev Number: 2 (DW_TAG_member)
    <c77>   DW_AT_name        : (indirect string, offset: 0x8f664): AHB3LPENR
    <c7b>   DW_AT_decl_file   : 5
    <c7c>   DW_AT_decl_line   : 358
    <c7e>   DW_AT_decl_column : 17
    <c7f>   DW_AT_type        : <0x9f3>
    <c83>   DW_AT_data_member_location: 88
 <2><c84>: Abbrev Number: 2 (DW_TAG_member)
    <c85>   DW_AT_name        : (indirect string, offset: 0x90ffc): RESERVED4
    <c89>   DW_AT_decl_file   : 5
    <c8a>   DW_AT_decl_line   : 359
    <c8c>   DW_AT_decl_column : 17
    <c8d>   DW_AT_type        : <0x9e7>
    <c91>   DW_AT_data_member_location: 92
 <2><c92>: Abbrev Number: 2 (DW_TAG_member)
    <c93>   DW_AT_name        : (indirect string, offset: 0x8f629): APB1LPENR
    <c97>   DW_AT_decl_file   : 5
    <c98>   DW_AT_decl_line   : 360
    <c9a>   DW_AT_decl_column : 17
    <c9b>   DW_AT_type        : <0x9f3>
    <c9f>   DW_AT_data_member_location: 96
 <2><ca0>: Abbrev Number: 2 (DW_TAG_member)
    <ca1>   DW_AT_name        : (indirect string, offset: 0x8ca2c): APB2LPENR
    <ca5>   DW_AT_decl_file   : 5
    <ca6>   DW_AT_decl_line   : 361
    <ca8>   DW_AT_decl_column : 17
    <ca9>   DW_AT_type        : <0x9f3>
    <cad>   DW_AT_data_member_location: 100
 <2><cae>: Abbrev Number: 2 (DW_TAG_member)
    <caf>   DW_AT_name        : (indirect string, offset: 0x91006): RESERVED5
    <cb3>   DW_AT_decl_file   : 5
    <cb4>   DW_AT_decl_line   : 362
    <cb6>   DW_AT_decl_column : 17
    <cb7>   DW_AT_type        : <0xa08>
    <cbb>   DW_AT_data_member_location: 104
 <2><cbc>: Abbrev Number: 2 (DW_TAG_member)
    <cbd>   DW_AT_name        : (indirect string, offset: 0x8cd4a): BDCR
    <cc1>   DW_AT_decl_file   : 5
    <cc2>   DW_AT_decl_line   : 363
    <cc4>   DW_AT_decl_column : 17
    <cc5>   DW_AT_type        : <0x9f3>
    <cc9>   DW_AT_data_member_location: 112
 <2><cca>: Abbrev Number: 7 (DW_TAG_member)
    <ccb>   DW_AT_name        : CSR
    <ccf>   DW_AT_decl_file   : 5
    <cd0>   DW_AT_decl_line   : 364
    <cd2>   DW_AT_decl_column : 17
    <cd3>   DW_AT_type        : <0x9f3>
    <cd7>   DW_AT_data_member_location: 116
 <2><cd8>: Abbrev Number: 2 (DW_TAG_member)
    <cd9>   DW_AT_name        : (indirect string, offset: 0x91010): RESERVED6
    <cdd>   DW_AT_decl_file   : 5
    <cde>   DW_AT_decl_line   : 365
    <ce0>   DW_AT_decl_column : 17
    <ce1>   DW_AT_type        : <0xa08>
    <ce5>   DW_AT_data_member_location: 120
 <2><ce6>: Abbrev Number: 2 (DW_TAG_member)
    <ce7>   DW_AT_name        : (indirect string, offset: 0x8e8bb): SSCGR
    <ceb>   DW_AT_decl_file   : 5
    <cec>   DW_AT_decl_line   : 366
    <cee>   DW_AT_decl_column : 17
    <cef>   DW_AT_type        : <0x9f3>
    <cf3>   DW_AT_data_member_location: 128
 <2><cf4>: Abbrev Number: 2 (DW_TAG_member)
    <cf5>   DW_AT_name        : (indirect string, offset: 0x8dac5): PLLI2SCFGR
    <cf9>   DW_AT_decl_file   : 5
    <cfa>   DW_AT_decl_line   : 367
    <cfc>   DW_AT_decl_column : 17
    <cfd>   DW_AT_type        : <0x9f3>
    <d01>   DW_AT_data_member_location: 132
 <2><d02>: Abbrev Number: 2 (DW_TAG_member)
    <d03>   DW_AT_name        : (indirect string, offset: 0x9101a): RESERVED7
    <d07>   DW_AT_decl_file   : 5
    <d08>   DW_AT_decl_line   : 368
    <d0a>   DW_AT_decl_column : 17
    <d0b>   DW_AT_type        : <0x9f8>
    <d0f>   DW_AT_data_member_location: 136
 <2><d10>: Abbrev Number: 2 (DW_TAG_member)
    <d11>   DW_AT_name        : (indirect string, offset: 0x8e2c7): DCKCFGR
    <d15>   DW_AT_decl_file   : 5
    <d16>   DW_AT_decl_line   : 369
    <d18>   DW_AT_decl_column : 17
    <d19>   DW_AT_type        : <0x9f3>
    <d1d>   DW_AT_data_member_location: 140
 <2><d1e>: Abbrev Number: 0
 <1><d1f>: Abbrev Number: 11 (DW_TAG_typedef)
    <d20>   DW_AT_name        : (indirect string, offset: 0x8e45e): RCC_TypeDef
    <d24>   DW_AT_decl_file   : 5
    <d25>   DW_AT_decl_line   : 370
    <d27>   DW_AT_decl_column : 3
    <d28>   DW_AT_type        : <0xb56>
 <1><d2c>: Abbrev Number: 23 (DW_TAG_structure_type)
    <d2d>   DW_AT_byte_size   : 36
    <d2e>   DW_AT_decl_file   : 5
    <d2f>   DW_AT_decl_line   : 452
    <d31>   DW_AT_decl_column : 9
    <d31>   DW_AT_sibling     : <0xdb2>
 <2><d35>: Abbrev Number: 7 (DW_TAG_member)
    <d36>   DW_AT_name        : CR1
    <d3a>   DW_AT_decl_file   : 5
    <d3b>   DW_AT_decl_line   : 454
    <d3d>   DW_AT_decl_column : 17
    <d3e>   DW_AT_type        : <0x9f3>
    <d42>   DW_AT_data_member_location: 0
 <2><d43>: Abbrev Number: 7 (DW_TAG_member)
    <d44>   DW_AT_name        : CR2
    <d48>   DW_AT_decl_file   : 5
    <d49>   DW_AT_decl_line   : 455
    <d4b>   DW_AT_decl_column : 17
    <d4c>   DW_AT_type        : <0x9f3>
    <d50>   DW_AT_data_member_location: 4
 <2><d51>: Abbrev Number: 7 (DW_TAG_member)
    <d52>   DW_AT_name        : SR
    <d55>   DW_AT_decl_file   : 5
    <d56>   DW_AT_decl_line   : 456
    <d58>   DW_AT_decl_column : 17
    <d59>   DW_AT_type        : <0x9f3>
    <d5d>   DW_AT_data_member_location: 8
 <2><d5e>: Abbrev Number: 7 (DW_TAG_member)
    <d5f>   DW_AT_name        : DR
    <d62>   DW_AT_decl_file   : 5
    <d63>   DW_AT_decl_line   : 457
    <d65>   DW_AT_decl_column : 17
    <d66>   DW_AT_type        : <0x9f3>
    <d6a>   DW_AT_data_member_location: 12
 <2><d6b>: Abbrev Number: 2 (DW_TAG_member)
    <d6c>   DW_AT_name        : (indirect string, offset: 0x8d4f8): CRCPR
    <d70>   DW_AT_decl_file   : 5
    <d71>   DW_AT_decl_line   : 458
    <d73>   DW_AT_decl_column : 17
    <d74>   DW_AT_type        : <0x9f3>
    <d78>   DW_AT_data_member_location: 16
 <2><d79>: Abbrev Number: 2 (DW_TAG_member)
    <d7a>   DW_AT_name        : (indirect string, offset: 0x8ef56): RXCRCR
    <d7e>   DW_AT_decl_file   : 5
    <d7f>   DW_AT_decl_line   : 459
    <d81>   DW_AT_decl_column : 17
    <d82>   DW_AT_type        : <0x9f3>
    <d86>   DW_AT_data_member_location: 20
 <2><d87>: Abbrev Number: 2 (DW_TAG_member)
    <d88>   DW_AT_name        : (indirect string, offset: 0x8e682): TXCRCR
    <d8c>   DW_AT_decl_file   : 5
    <d8d>   DW_AT_decl_line   : 460
    <d8f>   DW_AT_decl_column : 17
    <d90>   DW_AT_type        : <0x9f3>
    <d94>   DW_AT_data_member_location: 24
 <2><d95>: Abbrev Number: 2 (DW_TAG_member)
    <d96>   DW_AT_name        : (indirect string, offset: 0x8dac8): I2SCFGR
    <d9a>   DW_AT_decl_file   : 5
    <d9b>   DW_AT_decl_line   : 461
    <d9d>   DW_AT_decl_column : 17
    <d9e>   DW_AT_type        : <0x9f3>
    <da2>   DW_AT_data_member_location: 28
 <2><da3>: Abbrev Number: 2 (DW_TAG_member)
    <da4>   DW_AT_name        : (indirect string, offset: 0x8dbd1): I2SPR
    <da8>   DW_AT_decl_file   : 5
    <da9>   DW_AT_decl_line   : 462
    <dab>   DW_AT_decl_column : 17
    <dac>   DW_AT_type        : <0x9f3>
    <db0>   DW_AT_data_member_location: 32
 <2><db1>: Abbrev Number: 0
 <1><db2>: Abbrev Number: 11 (DW_TAG_typedef)
    <db3>   DW_AT_name        : (indirect string, offset: 0x8d46a): SPI_TypeDef
    <db7>   DW_AT_decl_file   : 5
    <db8>   DW_AT_decl_line   : 463
    <dba>   DW_AT_decl_column : 3
    <dbb>   DW_AT_type        : <0xd2c>
 <1><dbf>: Abbrev Number: 23 (DW_TAG_structure_type)
    <dc0>   DW_AT_byte_size   : 84
    <dc1>   DW_AT_decl_file   : 5
    <dc2>   DW_AT_decl_line   : 470
    <dc4>   DW_AT_decl_column : 9
    <dc4>   DW_AT_sibling     : <0xeed>
 <2><dc8>: Abbrev Number: 7 (DW_TAG_member)
    <dc9>   DW_AT_name        : CR1
    <dcd>   DW_AT_decl_file   : 5
    <dce>   DW_AT_decl_line   : 472
    <dd0>   DW_AT_decl_column : 17
    <dd1>   DW_AT_type        : <0x9f3>
    <dd5>   DW_AT_data_member_location: 0
 <2><dd6>: Abbrev Number: 7 (DW_TAG_member)
    <dd7>   DW_AT_name        : CR2
    <ddb>   DW_AT_decl_file   : 5
    <ddc>   DW_AT_decl_line   : 473
    <dde>   DW_AT_decl_column : 17
    <ddf>   DW_AT_type        : <0x9f3>
    <de3>   DW_AT_data_member_location: 4
 <2><de4>: Abbrev Number: 2 (DW_TAG_member)
    <de5>   DW_AT_name        : (indirect string, offset: 0x2894f): SMCR
    <de9>   DW_AT_decl_file   : 5
    <dea>   DW_AT_decl_line   : 474
    <dec>   DW_AT_decl_column : 17
    <ded>   DW_AT_type        : <0x9f3>
    <df1>   DW_AT_data_member_location: 8
 <2><df2>: Abbrev Number: 2 (DW_TAG_member)
    <df3>   DW_AT_name        : (indirect string, offset: 0x2ce8c): DIER
    <df7>   DW_AT_decl_file   : 5
    <df8>   DW_AT_decl_line   : 475
    <dfa>   DW_AT_decl_column : 17
    <dfb>   DW_AT_type        : <0x9f3>
    <dff>   DW_AT_data_member_location: 12
 <2><e00>: Abbrev Number: 7 (DW_TAG_member)
    <e01>   DW_AT_name        : SR
    <e04>   DW_AT_decl_file   : 5
    <e05>   DW_AT_decl_line   : 476
    <e07>   DW_AT_decl_column : 17
    <e08>   DW_AT_type        : <0x9f3>
    <e0c>   DW_AT_data_member_location: 16
 <2><e0d>: Abbrev Number: 7 (DW_TAG_member)
    <e0e>   DW_AT_name        : EGR
    <e12>   DW_AT_decl_file   : 5
    <e13>   DW_AT_decl_line   : 477
    <e15>   DW_AT_decl_column : 17
    <e16>   DW_AT_type        : <0x9f3>
    <e1a>   DW_AT_data_member_location: 20
 <2><e1b>: Abbrev Number: 2 (DW_TAG_member)
    <e1c>   DW_AT_name        : (indirect string, offset: 0x7f60f): CCMR1
    <e20>   DW_AT_decl_file   : 5
    <e21>   DW_AT_decl_line   : 478
    <e23>   DW_AT_decl_column : 17
    <e24>   DW_AT_type        : <0x9f3>
    <e28>   DW_AT_data_member_location: 24
 <2><e29>: Abbrev Number: 2 (DW_TAG_member)
    <e2a>   DW_AT_name        : (indirect string, offset: 0x37450): CCMR2
    <e2e>   DW_AT_decl_file   : 5
    <e2f>   DW_AT_decl_line   : 479
    <e31>   DW_AT_decl_column : 17
    <e32>   DW_AT_type        : <0x9f3>
    <e36>   DW_AT_data_member_location: 28
 <2><e37>: Abbrev Number: 2 (DW_TAG_member)
    <e38>   DW_AT_name        : (indirect string, offset: 0x1d5f0): CCER
    <e3c>   DW_AT_decl_file   : 5
    <e3d>   DW_AT_decl_line   : 480
    <e3f>   DW_AT_decl_column : 17
    <e40>   DW_AT_type        : <0x9f3>
    <e44>   DW_AT_data_member_location: 32
 <2><e45>: Abbrev Number: 7 (DW_TAG_member)
    <e46>   DW_AT_name        : CNT
    <e4a>   DW_AT_decl_file   : 5
    <e4b>   DW_AT_decl_line   : 481
    <e4d>   DW_AT_decl_column : 17
    <e4e>   DW_AT_type        : <0x9f3>
    <e52>   DW_AT_data_member_location: 36
 <2><e53>: Abbrev Number: 7 (DW_TAG_member)
    <e54>   DW_AT_name        : PSC
    <e58>   DW_AT_decl_file   : 5
    <e59>   DW_AT_decl_line   : 482
    <e5b>   DW_AT_decl_column : 17
    <e5c>   DW_AT_type        : <0x9f3>
    <e60>   DW_AT_data_member_location: 40
 <2><e61>: Abbrev Number: 7 (DW_TAG_member)
    <e62>   DW_AT_name        : ARR
    <e66>   DW_AT_decl_file   : 5
    <e67>   DW_AT_decl_line   : 483
    <e69>   DW_AT_decl_column : 17
    <e6a>   DW_AT_type        : <0x9f3>
    <e6e>   DW_AT_data_member_location: 44
 <2><e6f>: Abbrev Number: 7 (DW_TAG_member)
    <e70>   DW_AT_name        : RCR
    <e74>   DW_AT_decl_file   : 5
    <e75>   DW_AT_decl_line   : 484
    <e77>   DW_AT_decl_column : 17
    <e78>   DW_AT_type        : <0x9f3>
    <e7c>   DW_AT_data_member_location: 48
 <2><e7d>: Abbrev Number: 2 (DW_TAG_member)
    <e7e>   DW_AT_name        : (indirect string, offset: 0x10407): CCR1
    <e82>   DW_AT_decl_file   : 5
    <e83>   DW_AT_decl_line   : 485
    <e85>   DW_AT_decl_column : 17
    <e86>   DW_AT_type        : <0x9f3>
    <e8a>   DW_AT_data_member_location: 52
 <2><e8b>: Abbrev Number: 2 (DW_TAG_member)
    <e8c>   DW_AT_name        : (indirect string, offset: 0x3a03a): CCR2
    <e90>   DW_AT_decl_file   : 5
    <e91>   DW_AT_decl_line   : 486
    <e93>   DW_AT_decl_column : 17
    <e94>   DW_AT_type        : <0x9f3>
    <e98>   DW_AT_data_member_location: 56
 <2><e99>: Abbrev Number: 2 (DW_TAG_member)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x6a9dd): CCR3
    <e9e>   DW_AT_decl_file   : 5
    <e9f>   DW_AT_decl_line   : 487
    <ea1>   DW_AT_decl_column : 17
    <ea2>   DW_AT_type        : <0x9f3>
    <ea6>   DW_AT_data_member_location: 60
 <2><ea7>: Abbrev Number: 2 (DW_TAG_member)
    <ea8>   DW_AT_name        : (indirect string, offset: 0x87fe): CCR4
    <eac>   DW_AT_decl_file   : 5
    <ead>   DW_AT_decl_line   : 488
    <eaf>   DW_AT_decl_column : 17
    <eb0>   DW_AT_type        : <0x9f3>
    <eb4>   DW_AT_data_member_location: 64
 <2><eb5>: Abbrev Number: 2 (DW_TAG_member)
    <eb6>   DW_AT_name        : (indirect string, offset: 0x40125): BDTR
    <eba>   DW_AT_decl_file   : 5
    <ebb>   DW_AT_decl_line   : 489
    <ebd>   DW_AT_decl_column : 17
    <ebe>   DW_AT_type        : <0x9f3>
    <ec2>   DW_AT_data_member_location: 68
 <2><ec3>: Abbrev Number: 7 (DW_TAG_member)
    <ec4>   DW_AT_name        : DCR
    <ec8>   DW_AT_decl_file   : 5
    <ec9>   DW_AT_decl_line   : 490
    <ecb>   DW_AT_decl_column : 17
    <ecc>   DW_AT_type        : <0x9f3>
    <ed0>   DW_AT_data_member_location: 72
 <2><ed1>: Abbrev Number: 2 (DW_TAG_member)
    <ed2>   DW_AT_name        : (indirect string, offset: 0x77a23): DMAR
    <ed6>   DW_AT_decl_file   : 5
    <ed7>   DW_AT_decl_line   : 491
    <ed9>   DW_AT_decl_column : 17
    <eda>   DW_AT_type        : <0x9f3>
    <ede>   DW_AT_data_member_location: 76
 <2><edf>: Abbrev Number: 7 (DW_TAG_member)
    <ee0>   DW_AT_name        : OR
    <ee3>   DW_AT_decl_file   : 5
    <ee4>   DW_AT_decl_line   : 492
    <ee6>   DW_AT_decl_column : 17
    <ee7>   DW_AT_type        : <0x9f3>
    <eeb>   DW_AT_data_member_location: 80
 <2><eec>: Abbrev Number: 0
 <1><eed>: Abbrev Number: 11 (DW_TAG_typedef)
    <eee>   DW_AT_name        : (indirect string, offset: 0x8c5f2): TIM_TypeDef
    <ef2>   DW_AT_decl_file   : 5
    <ef3>   DW_AT_decl_line   : 493
    <ef5>   DW_AT_decl_column : 3
    <ef6>   DW_AT_type        : <0xdbf>
 <1><efa>: Abbrev Number: 13 (DW_TAG_base_type)
    <efb>   DW_AT_byte_size   : 8
    <efc>   DW_AT_encoding    : 4	(float)
    <efd>   DW_AT_name        : (indirect string, offset: 0x724fe): long double
 <1><f01>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <f02>   DW_AT_encoding    : 7	(unsigned)
    <f03>   DW_AT_byte_size   : 1
    <f04>   DW_AT_type        : <0x956>
    <f08>   DW_AT_decl_file   : 6
    <f09>   DW_AT_decl_line   : 39
    <f0a>   DW_AT_decl_column : 1
    <f0b>   DW_AT_sibling     : <0xf28>
 <2><f0f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f10>   DW_AT_name        : (indirect string, offset: 0x8dae9): HAL_OK
    <f14>   DW_AT_const_value : 0
 <2><f15>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f16>   DW_AT_name        : (indirect string, offset: 0x8f3da): HAL_ERROR
    <f1a>   DW_AT_const_value : 1
 <2><f1b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f1c>   DW_AT_name        : (indirect string, offset: 0x90423): HAL_BUSY
    <f20>   DW_AT_const_value : 2
 <2><f21>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f22>   DW_AT_name        : (indirect string, offset: 0x8d831): HAL_TIMEOUT
    <f26>   DW_AT_const_value : 3
 <2><f27>: Abbrev Number: 0
 <1><f28>: Abbrev Number: 4 (DW_TAG_typedef)
    <f29>   DW_AT_name        : (indirect string, offset: 0x8c21e): HAL_StatusTypeDef
    <f2d>   DW_AT_decl_file   : 6
    <f2e>   DW_AT_decl_line   : 44
    <f2f>   DW_AT_decl_column : 3
    <f30>   DW_AT_type        : <0xf01>
 <1><f34>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <f35>   DW_AT_encoding    : 7	(unsigned)
    <f36>   DW_AT_byte_size   : 1
    <f37>   DW_AT_type        : <0x956>
    <f3b>   DW_AT_decl_file   : 6
    <f3c>   DW_AT_decl_line   : 50
    <f3d>   DW_AT_decl_column : 1
    <f3e>   DW_AT_sibling     : <0xf4f>
 <2><f42>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f43>   DW_AT_name        : (indirect string, offset: 0x8fbd4): HAL_UNLOCKED
    <f47>   DW_AT_const_value : 0
 <2><f48>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f49>   DW_AT_name        : (indirect string, offset: 0x91517): HAL_LOCKED
    <f4d>   DW_AT_const_value : 1
 <2><f4e>: Abbrev Number: 0
 <1><f4f>: Abbrev Number: 4 (DW_TAG_typedef)
    <f50>   DW_AT_name        : (indirect string, offset: 0x8f121): HAL_LockTypeDef
    <f54>   DW_AT_decl_file   : 6
    <f55>   DW_AT_decl_line   : 53
    <f56>   DW_AT_decl_column : 3
    <f57>   DW_AT_type        : <0xf34>
 <1><f5b>: Abbrev Number: 15 (DW_TAG_structure_type)
    <f5c>   DW_AT_byte_size   : 24
    <f5d>   DW_AT_decl_file   : 7
    <f5e>   DW_AT_decl_line   : 45
    <f5f>   DW_AT_decl_column : 9
    <f5f>   DW_AT_sibling     : <0xfb2>
 <2><f63>: Abbrev Number: 1 (DW_TAG_member)
    <f64>   DW_AT_name        : (indirect string, offset: 0x8f63c): PLLState
    <f68>   DW_AT_decl_file   : 7
    <f69>   DW_AT_decl_line   : 47
    <f6a>   DW_AT_decl_column : 12
    <f6b>   DW_AT_type        : <0x9e7>
    <f6f>   DW_AT_data_member_location: 0
 <2><f70>: Abbrev Number: 1 (DW_TAG_member)
    <f71>   DW_AT_name        : (indirect string, offset: 0x8f677): PLLSource
    <f75>   DW_AT_decl_file   : 7
    <f76>   DW_AT_decl_line   : 50
    <f77>   DW_AT_decl_column : 12
    <f78>   DW_AT_type        : <0x9e7>
    <f7c>   DW_AT_data_member_location: 4
 <2><f7d>: Abbrev Number: 1 (DW_TAG_member)
    <f7e>   DW_AT_name        : (indirect string, offset: 0x90382): PLLM
    <f82>   DW_AT_decl_file   : 7
    <f83>   DW_AT_decl_line   : 53
    <f84>   DW_AT_decl_column : 12
    <f85>   DW_AT_type        : <0x9e7>
    <f89>   DW_AT_data_member_location: 8
 <2><f8a>: Abbrev Number: 1 (DW_TAG_member)
    <f8b>   DW_AT_name        : (indirect string, offset: 0x90387): PLLN
    <f8f>   DW_AT_decl_file   : 7
    <f90>   DW_AT_decl_line   : 56
    <f91>   DW_AT_decl_column : 12
    <f92>   DW_AT_type        : <0x9e7>
    <f96>   DW_AT_data_member_location: 12
 <2><f97>: Abbrev Number: 1 (DW_TAG_member)
    <f98>   DW_AT_name        : (indirect string, offset: 0x8e47c): PLLP
    <f9c>   DW_AT_decl_file   : 7
    <f9d>   DW_AT_decl_line   : 60
    <f9e>   DW_AT_decl_column : 12
    <f9f>   DW_AT_type        : <0x9e7>
    <fa3>   DW_AT_data_member_location: 16
 <2><fa4>: Abbrev Number: 1 (DW_TAG_member)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x336ac): PLLQ
    <fa9>   DW_AT_decl_file   : 7
    <faa>   DW_AT_decl_line   : 63
    <fab>   DW_AT_decl_column : 12
    <fac>   DW_AT_type        : <0x9e7>
    <fb0>   DW_AT_data_member_location: 20
 <2><fb1>: Abbrev Number: 0
 <1><fb2>: Abbrev Number: 4 (DW_TAG_typedef)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x8f0fc): RCC_PLLInitTypeDef
    <fb7>   DW_AT_decl_file   : 7
    <fb8>   DW_AT_decl_line   : 73
    <fb9>   DW_AT_decl_column : 3
    <fba>   DW_AT_type        : <0xf5b>
 <1><fbe>: Abbrev Number: 15 (DW_TAG_structure_type)
    <fbf>   DW_AT_byte_size   : 48
    <fc0>   DW_AT_decl_file   : 8
    <fc1>   DW_AT_decl_line   : 49
    <fc2>   DW_AT_decl_column : 9
    <fc2>   DW_AT_sibling     : <0x1022>
 <2><fc6>: Abbrev Number: 1 (DW_TAG_member)
    <fc7>   DW_AT_name        : (indirect string, offset: 0x90273): OscillatorType
    <fcb>   DW_AT_decl_file   : 8
    <fcc>   DW_AT_decl_line   : 51
    <fcd>   DW_AT_decl_column : 12
    <fce>   DW_AT_type        : <0x9e7>
    <fd2>   DW_AT_data_member_location: 0
 <2><fd3>: Abbrev Number: 1 (DW_TAG_member)
    <fd4>   DW_AT_name        : (indirect string, offset: 0x8f66e): HSEState
    <fd8>   DW_AT_decl_file   : 8
    <fd9>   DW_AT_decl_line   : 54
    <fda>   DW_AT_decl_column : 12
    <fdb>   DW_AT_type        : <0x9e7>
    <fdf>   DW_AT_data_member_location: 4
 <2><fe0>: Abbrev Number: 1 (DW_TAG_member)
    <fe1>   DW_AT_name        : (indirect string, offset: 0x8f404): LSEState
    <fe5>   DW_AT_decl_file   : 8
    <fe6>   DW_AT_decl_line   : 57
    <fe7>   DW_AT_decl_column : 12
    <fe8>   DW_AT_type        : <0x9e7>
    <fec>   DW_AT_data_member_location: 8
 <2><fed>: Abbrev Number: 1 (DW_TAG_member)
    <fee>   DW_AT_name        : (indirect string, offset: 0x8e369): HSIState
    <ff2>   DW_AT_decl_file   : 8
    <ff3>   DW_AT_decl_line   : 60
    <ff4>   DW_AT_decl_column : 12
    <ff5>   DW_AT_type        : <0x9e7>
    <ff9>   DW_AT_data_member_location: 12
 <2><ffa>: Abbrev Number: 1 (DW_TAG_member)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x90616): HSICalibrationValue
    <fff>   DW_AT_decl_file   : 8
    <1000>   DW_AT_decl_line   : 63
    <1001>   DW_AT_decl_column : 12
    <1002>   DW_AT_type        : <0x9e7>
    <1006>   DW_AT_data_member_location: 16
 <2><1007>: Abbrev Number: 1 (DW_TAG_member)
    <1008>   DW_AT_name        : (indirect string, offset: 0x90a37): LSIState
    <100c>   DW_AT_decl_file   : 8
    <100d>   DW_AT_decl_line   : 66
    <100e>   DW_AT_decl_column : 12
    <100f>   DW_AT_type        : <0x9e7>
    <1013>   DW_AT_data_member_location: 20
 <2><1014>: Abbrev Number: 8 (DW_TAG_member)
    <1015>   DW_AT_name        : PLL
    <1019>   DW_AT_decl_file   : 8
    <101a>   DW_AT_decl_line   : 69
    <101b>   DW_AT_decl_column : 22
    <101c>   DW_AT_type        : <0xfb2>
    <1020>   DW_AT_data_member_location: 24
 <2><1021>: Abbrev Number: 0
 <1><1022>: Abbrev Number: 4 (DW_TAG_typedef)
    <1023>   DW_AT_name        : (indirect string, offset: 0x8e958): RCC_OscInitTypeDef
    <1027>   DW_AT_decl_file   : 8
    <1028>   DW_AT_decl_line   : 70
    <1029>   DW_AT_decl_column : 3
    <102a>   DW_AT_type        : <0xfbe>
 <1><102e>: Abbrev Number: 15 (DW_TAG_structure_type)
    <102f>   DW_AT_byte_size   : 20
    <1030>   DW_AT_decl_file   : 8
    <1031>   DW_AT_decl_line   : 75
    <1032>   DW_AT_decl_column : 9
    <1032>   DW_AT_sibling     : <0x1078>
 <2><1036>: Abbrev Number: 1 (DW_TAG_member)
    <1037>   DW_AT_name        : (indirect string, offset: 0x8d967): ClockType
    <103b>   DW_AT_decl_file   : 8
    <103c>   DW_AT_decl_line   : 77
    <103d>   DW_AT_decl_column : 12
    <103e>   DW_AT_type        : <0x9e7>
    <1042>   DW_AT_data_member_location: 0
 <2><1043>: Abbrev Number: 1 (DW_TAG_member)
    <1044>   DW_AT_name        : (indirect string, offset: 0x8e6e5): SYSCLKSource
    <1048>   DW_AT_decl_file   : 8
    <1049>   DW_AT_decl_line   : 80
    <104a>   DW_AT_decl_column : 12
    <104b>   DW_AT_type        : <0x9e7>
    <104f>   DW_AT_data_member_location: 4
 <2><1050>: Abbrev Number: 1 (DW_TAG_member)
    <1051>   DW_AT_name        : (indirect string, offset: 0x902dd): AHBCLKDivider
    <1055>   DW_AT_decl_file   : 8
    <1056>   DW_AT_decl_line   : 83
    <1057>   DW_AT_decl_column : 12
    <1058>   DW_AT_type        : <0x9e7>
    <105c>   DW_AT_data_member_location: 8
 <2><105d>: Abbrev Number: 1 (DW_TAG_member)
    <105e>   DW_AT_name        : (indirect string, offset: 0x8c612): APB1CLKDivider
    <1062>   DW_AT_decl_file   : 8
    <1063>   DW_AT_decl_line   : 86
    <1064>   DW_AT_decl_column : 12
    <1065>   DW_AT_type        : <0x9e7>
    <1069>   DW_AT_data_member_location: 12
 <2><106a>: Abbrev Number: 1 (DW_TAG_member)
    <106b>   DW_AT_name        : (indirect string, offset: 0x8e406): APB2CLKDivider
    <106f>   DW_AT_decl_file   : 8
    <1070>   DW_AT_decl_line   : 89
    <1071>   DW_AT_decl_column : 12
    <1072>   DW_AT_type        : <0x9e7>
    <1076>   DW_AT_data_member_location: 16
 <2><1077>: Abbrev Number: 0
 <1><1078>: Abbrev Number: 4 (DW_TAG_typedef)
    <1079>   DW_AT_name        : (indirect string, offset: 0x8fea4): RCC_ClkInitTypeDef
    <107d>   DW_AT_decl_file   : 8
    <107e>   DW_AT_decl_line   : 92
    <107f>   DW_AT_decl_column : 3
    <1080>   DW_AT_type        : <0x102e>
 <1><1084>: Abbrev Number: 15 (DW_TAG_structure_type)
    <1085>   DW_AT_byte_size   : 20
    <1086>   DW_AT_decl_file   : 9
    <1087>   DW_AT_decl_line   : 46
    <1088>   DW_AT_decl_column : 9
    <1088>   DW_AT_sibling     : <0x10ce>
 <2><108c>: Abbrev Number: 8 (DW_TAG_member)
    <108d>   DW_AT_name        : Pin
    <1091>   DW_AT_decl_file   : 9
    <1092>   DW_AT_decl_line   : 48
    <1093>   DW_AT_decl_column : 12
    <1094>   DW_AT_type        : <0x9e7>
    <1098>   DW_AT_data_member_location: 0
 <2><1099>: Abbrev Number: 1 (DW_TAG_member)
    <109a>   DW_AT_name        : (indirect string, offset: 0x9300a): Mode
    <109e>   DW_AT_decl_file   : 9
    <109f>   DW_AT_decl_line   : 51
    <10a0>   DW_AT_decl_column : 12
    <10a1>   DW_AT_type        : <0x9e7>
    <10a5>   DW_AT_data_member_location: 4
 <2><10a6>: Abbrev Number: 1 (DW_TAG_member)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x8e720): Pull
    <10ab>   DW_AT_decl_file   : 9
    <10ac>   DW_AT_decl_line   : 54
    <10ad>   DW_AT_decl_column : 12
    <10ae>   DW_AT_type        : <0x9e7>
    <10b2>   DW_AT_data_member_location: 8
 <2><10b3>: Abbrev Number: 1 (DW_TAG_member)
    <10b4>   DW_AT_name        : (indirect string, offset: 0x8ef2e): Speed
    <10b8>   DW_AT_decl_file   : 9
    <10b9>   DW_AT_decl_line   : 57
    <10ba>   DW_AT_decl_column : 12
    <10bb>   DW_AT_type        : <0x9e7>
    <10bf>   DW_AT_data_member_location: 12
 <2><10c0>: Abbrev Number: 1 (DW_TAG_member)
    <10c1>   DW_AT_name        : (indirect string, offset: 0x8e3fc): Alternate
    <10c5>   DW_AT_decl_file   : 9
    <10c6>   DW_AT_decl_line   : 60
    <10c7>   DW_AT_decl_column : 12
    <10c8>   DW_AT_type        : <0x9e7>
    <10cc>   DW_AT_data_member_location: 16
 <2><10cd>: Abbrev Number: 0
 <1><10ce>: Abbrev Number: 4 (DW_TAG_typedef)
    <10cf>   DW_AT_name        : (indirect string, offset: 0x8ffe0): GPIO_InitTypeDef
    <10d3>   DW_AT_decl_file   : 9
    <10d4>   DW_AT_decl_line   : 62
    <10d5>   DW_AT_decl_column : 2
    <10d6>   DW_AT_type        : <0x1084>
 <1><10da>: Abbrev Number: 12 (DW_TAG_enumeration_type)
    <10db>   DW_AT_encoding    : 7	(unsigned)
    <10dc>   DW_AT_byte_size   : 1
    <10dd>   DW_AT_type        : <0x956>
    <10e1>   DW_AT_decl_file   : 9
    <10e2>   DW_AT_decl_line   : 68
    <10e3>   DW_AT_decl_column : 1
    <10e4>   DW_AT_sibling     : <0x10f5>
 <2><10e8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <10e9>   DW_AT_name        : (indirect string, offset: 0x8d1cd): GPIO_PIN_RESET
    <10ed>   DW_AT_const_value : 0
 <2><10ee>: Abbrev Number: 3 (DW_TAG_enumerator)
    <10ef>   DW_AT_name        : (indirect string, offset: 0x8cf2a): GPIO_PIN_SET
    <10f3>   DW_AT_const_value : 1
 <2><10f4>: Abbrev Number: 0
 <1><10f5>: Abbrev Number: 4 (DW_TAG_typedef)
    <10f6>   DW_AT_name        : (indirect string, offset: 0x912a2): GPIO_PinState
    <10fa>   DW_AT_decl_file   : 9
    <10fb>   DW_AT_decl_line   : 71
    <10fc>   DW_AT_decl_column : 2
    <10fd>   DW_AT_type        : <0x10da>
 <1><1101>: Abbrev Number: 15 (DW_TAG_structure_type)
    <1102>   DW_AT_byte_size   : 48
    <1103>   DW_AT_decl_file   : 10
    <1104>   DW_AT_decl_line   : 48
    <1105>   DW_AT_decl_column : 9
    <1105>   DW_AT_sibling     : <0x11a6>
 <2><1109>: Abbrev Number: 1 (DW_TAG_member)
    <110a>   DW_AT_name        : (indirect string, offset: 0x8e86a): Channel
    <110e>   DW_AT_decl_file   : 10
    <110f>   DW_AT_decl_line   : 50
    <1110>   DW_AT_decl_column : 12
    <1111>   DW_AT_type        : <0x9e7>
    <1115>   DW_AT_data_member_location: 0
 <2><1116>: Abbrev Number: 1 (DW_TAG_member)
    <1117>   DW_AT_name        : (indirect string, offset: 0x8dd31): Direction
    <111b>   DW_AT_decl_file   : 10
    <111c>   DW_AT_decl_line   : 53
    <111d>   DW_AT_decl_column : 12
    <111e>   DW_AT_type        : <0x9e7>
    <1122>   DW_AT_data_member_location: 4
 <2><1123>: Abbrev Number: 1 (DW_TAG_member)
    <1124>   DW_AT_name        : (indirect string, offset: 0x8c9c2): PeriphInc
    <1128>   DW_AT_decl_file   : 10
    <1129>   DW_AT_decl_line   : 57
    <112a>   DW_AT_decl_column : 12
    <112b>   DW_AT_type        : <0x9e7>
    <112f>   DW_AT_data_member_location: 8
 <2><1130>: Abbrev Number: 1 (DW_TAG_member)
    <1131>   DW_AT_name        : (indirect string, offset: 0x8ce5d): MemInc
    <1135>   DW_AT_decl_file   : 10
    <1136>   DW_AT_decl_line   : 60
    <1137>   DW_AT_decl_column : 12
    <1138>   DW_AT_type        : <0x9e7>
    <113c>   DW_AT_data_member_location: 12
 <2><113d>: Abbrev Number: 1 (DW_TAG_member)
    <113e>   DW_AT_name        : (indirect string, offset: 0x8e663): PeriphDataAlignment
    <1142>   DW_AT_decl_file   : 10
    <1143>   DW_AT_decl_line   : 63
    <1144>   DW_AT_decl_column : 12
    <1145>   DW_AT_type        : <0x9e7>
    <1149>   DW_AT_data_member_location: 16
 <2><114a>: Abbrev Number: 1 (DW_TAG_member)
    <114b>   DW_AT_name        : (indirect string, offset: 0x90acc): MemDataAlignment
    <114f>   DW_AT_decl_file   : 10
    <1150>   DW_AT_decl_line   : 66
    <1151>   DW_AT_decl_column : 12
    <1152>   DW_AT_type        : <0x9e7>
    <1156>   DW_AT_data_member_location: 20
 <2><1157>: Abbrev Number: 1 (DW_TAG_member)
    <1158>   DW_AT_name        : (indirect string, offset: 0x9300a): Mode
    <115c>   DW_AT_decl_file   : 10
    <115d>   DW_AT_decl_line   : 69
