Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x911 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x382): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x4a2): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x554): C:/Users/Bazar/Desktop/New folder/STM32F746Discovery_LTDC_ESP32-CAM_CaptureImage_FreeRTOS/STM32_Side/LTDC_CaptureImage_FreeRTOS/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
 <1><26>: Abbrev Number: 20 (DW_TAG_base_type)
    <27>   DW_AT_byte_size   : 4
    <28>   DW_AT_encoding    : 5	(signed)
    <29>   DW_AT_name        : int
 <1><2d>: Abbrev Number: 6 (DW_TAG_base_type)
    <2e>   DW_AT_byte_size   : 4
    <2f>   DW_AT_encoding    : 7	(unsigned)
    <30>   DW_AT_name        : (indirect string, offset: 0x70): unsigned int
 <1><34>: Abbrev Number: 6 (DW_TAG_base_type)
    <35>   DW_AT_byte_size   : 8
    <36>   DW_AT_encoding    : 5	(signed)
    <37>   DW_AT_name        : (indirect string, offset: 0x127): long long int

    <45>   DW_AT_name        : (indirect string, offset: 0x2b9): signed char
 <1><49>: Abbrev Number: 5 (DW_TAG_typedef)
    <4a>   DW_AT_name        : (indirect string, offset: 0x1d): __uint8_t
    <4e>   DW_AT_decl_file   : 2
    <4f>   DW_AT_decl_line   : 43
    <50>   DW_AT_decl_column : 24
    <51>   DW_AT_type        : <0x55>
 <1><55>: Abbrev Number: 6 (DW_TAG_base_type)
    <56>   DW_AT_byte_size   : 1
    <57>   DW_AT_encoding    : 8	(unsigned char)
    <58>   DW_AT_name        : (indirect string, offset: 0x2b7): unsigned char
 <1><5c>: Abbrev Number: 6 (DW_TAG_base_type)
    <5d>   DW_AT_byte_size   : 2
    <5e>   DW_AT_encoding    : 5	(signed)
    <5f>   DW_AT_name        : (indirect string, offset: 0): short int
 <1><63>: Abbrev Number: 5 (DW_TAG_typedef)
    <64>   DW_AT_name        : (indirect string, offset: 0x446): __uint16_t
    <68>   DW_AT_decl_file   : 2
    <69>   DW_AT_decl_line   : 57
    <6a>   DW_AT_decl_column : 25
    <6b>   DW_AT_type        : <0x6f>
 <1><6f>: Abbrev Number: 6 (DW_TAG_base_type)
    <70>   DW_AT_byte_size   : 2
    <71>   DW_AT_encoding    : 7	(unsigned)
    <72>   DW_AT_name        : (indirect string, offset: 0x1b8): short unsigned int
 <1><76>: Abbrev Number: 6 (DW_TAG_base_type)
    <77>   DW_AT_byte_size   : 4
    <78>   DW_AT_encoding    : 5	(signed)
    <79>   DW_AT_name        : (indirect string, offset: 0x12c): long int
 <1><7d>: Abbrev Number: 5 (DW_TAG_typedef)
    <7e>   DW_AT_name        : (indirect string, offset: 0x15c): __uint32_t
    <82>   DW_AT_decl_file   : 2
    <83>   DW_AT_decl_line   : 79
    <84>   DW_AT_decl_column : 25
    <85>   DW_AT_type        : <0x89>
 <1><89>: Abbrev Number: 6 (DW_TAG_base_type)
    <8a>   DW_AT_byte_size   : 4
    <8b>   DW_AT_encoding    : 7	(unsigned)
    <8c>   DW_AT_name        : (indirect string, offset: 0x6b): long unsigned int
 <1><90>: Abbrev Number: 6 (DW_TAG_base_type)
    <91>   DW_AT_byte_size   : 8
    <92>   DW_AT_encoding    : 7	(unsigned)
    <93>   DW_AT_name        : (indirect string, offset: 0x66): long long unsigned int
 <1><97>: Abbrev Number: 5 (DW_TAG_typedef)
    <98>   DW_AT_name        : (indirect string, offset: 0x1f): uint8_t
    <9c>   DW_AT_decl_file   : 3
    <9d>   DW_AT_decl_line   : 24
    <9e>   DW_AT_decl_column : 19
    <9f>   DW_AT_type        : <0x49>
 <1><a3>: Abbrev Number: 5 (DW_TAG_typedef)
    <a4>   DW_AT_name        : (indirect string, offset: 0x448): uint16_t
    <a8>   DW_AT_decl_file   : 3
    <a9>   DW_AT_decl_line   : 36
    <aa>   DW_AT_decl_column : 20
    <ab>   DW_AT_type        : <0x63>
 <1><af>: Abbrev Number: 5 (DW_TAG_typedef)
    <b0>   DW_AT_name        : (indirect string, offset: 0x15e): uint32_t
    <b4>   DW_AT_decl_file   : 3
    <b5>   DW_AT_decl_line   : 48
    <b6>   DW_AT_decl_column : 20
    <b7>   DW_AT_type        : <0x7d>
 <1><bb>: Abbrev Number: 21 (DW_TAG_pointer_type)
    <bc>   DW_AT_byte_size   : 4
 <1><bd>: Abbrev Number: 5 (DW_TAG_typedef)
    <be>   DW_AT_name        : (indirect string, offset: 0x1cb): StackType_t
    <c2>   DW_AT_decl_file   : 4
    <c3>   DW_AT_decl_line   : 55
    <c4>   DW_AT_decl_column : 24
    <c5>   DW_AT_type        : <0xaf>
 <1><c9>: Abbrev Number: 5 (DW_TAG_typedef)
    <ca>   DW_AT_name        : (indirect string, offset: 0x531): UBaseType_t
    <ce>   DW_AT_decl_file   : 4
    <cf>   DW_AT_decl_line   : 57
    <d0>   DW_AT_decl_column : 23
    <d1>   DW_AT_type        : <0x89>
 <1><d5>: Abbrev Number: 5 (DW_TAG_typedef)
    <d6>   DW_AT_name        : (indirect string, offset: 0x265): TickType_t
    <da>   DW_AT_decl_file   : 4
    <db>   DW_AT_decl_line   : 63
    <dc>   DW_AT_decl_column : 19
    <dd>   DW_AT_type        : <0xaf>
 <1><e1>: Abbrev Number: 11 (DW_TAG_typedef)
    <e2>   DW_AT_name        : (indirect string, offset: 0x21b): wint_t
    <e6>   DW_AT_decl_file   : 5
    <e7>   DW_AT_decl_line   : 359
    <e9>   DW_AT_decl_column : 23
    <ea>   DW_AT_type        : <0x2d>
 <1><ee>: Abbrev Number: 5 (DW_TAG_typedef)
    <ef>   DW_AT_name        : (indirect string, offset: 0x28cb): _off_t
    <f3>   DW_AT_decl_file   : 6
    <f4>   DW_AT_decl_line   : 46
    <f5>   DW_AT_decl_column : 14
    <f6>   DW_AT_type        : <0x76>
 <1><fa>: Abbrev Number: 5 (DW_TAG_typedef)
    <fb>   DW_AT_name        : (indirect string, offset: 0x36e): _fpos_t
    <ff>   DW_AT_decl_file   : 6
    <100>   DW_AT_decl_line   : 116
    <101>   DW_AT_decl_column : 14
    <102>   DW_AT_type        : <0x76>
 <1><106>: Abbrev Number: 22 (DW_TAG_union_type)
    <107>   DW_AT_byte_size   : 4
    <108>   DW_AT_decl_file   : 6
    <109>   DW_AT_decl_line   : 165
    <10a>   DW_AT_decl_column : 3
    <10b>   DW_AT_sibling     : <0x126>
 <2><10f>: Abbrev Number: 15 (DW_TAG_member)
    <110>   DW_AT_name        : (indirect string, offset: 0x1f8): __wch
    <114>   DW_AT_decl_file   : 6
    <114>   DW_AT_decl_line   : 167
    <115>   DW_AT_decl_column : 12
    <116>   DW_AT_type        : <0xe1>
 <2><11a>: Abbrev Number: 15 (DW_TAG_member)
    <11b>   DW_AT_name        : (indirect string, offset: 0x1a3): __wchb
    <11f>   DW_AT_decl_file   : 6
    <11f>   DW_AT_decl_line   : 168
    <120>   DW_AT_decl_column : 19
    <121>   DW_AT_type        : <0x126>
 <2><125>: Abbrev Number: 0
 <1><126>: Abbrev Number: 7 (DW_TAG_array_type)
    <127>   DW_AT_type        : <0x55>
    <12b>   DW_AT_sibling     : <0x136>
 <2><12f>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <130>   DW_AT_type        : <0x2d>
    <134>   DW_AT_upper_bound : 3
 <2><135>: Abbrev Number: 0
 <1><136>: Abbrev Number: 23 (DW_TAG_structure_type)
    <137>   DW_AT_byte_size   : 8
    <138>   DW_AT_decl_file   : 6
    <139>   DW_AT_decl_line   : 162
    <13a>   DW_AT_decl_column : 9
    <13b>   DW_AT_sibling     : <0x15a>
 <2><13f>: Abbrev Number: 2 (DW_TAG_member)
    <140>   DW_AT_name        : (indirect string, offset: 0x344): __count
    <144>   DW_AT_decl_file   : 6
    <145>   DW_AT_decl_line   : 164
    <146>   DW_AT_decl_column : 7
    <147>   DW_AT_type        : <0x26>
    <14b>   DW_AT_data_member_location: 0
 <2><14c>: Abbrev Number: 2 (DW_TAG_member)
    <14d>   DW_AT_name        : (indirect string, offset: 0x47d): __value
    <151>   DW_AT_decl_file   : 6
    <152>   DW_AT_decl_line   : 169
    <153>   DW_AT_decl_column : 5
    <154>   DW_AT_type        : <0x106>
    <158>   DW_AT_data_member_location: 4
 <2><159>: Abbrev Number: 0
 <1><15a>: Abbrev Number: 5 (DW_TAG_typedef)
    <15b>   DW_AT_name        : (indirect string, offset: 0x29e): _mbstate_t
    <15f>   DW_AT_decl_file   : 6
    <160>   DW_AT_decl_line   : 170
    <161>   DW_AT_decl_column : 3
    <162>   DW_AT_type        : <0x136>
 <1><166>: Abbrev Number: 5 (DW_TAG_typedef)
    <167>   DW_AT_name        : (indirect string, offset: 0x491): __ULong
    <16b>   DW_AT_decl_file   : 7
    <16c>   DW_AT_decl_line   : 23
    <16d>   DW_AT_decl_column : 25
    <16e>   DW_AT_type        : <0x89>
 <1><172>: Abbrev Number: 5 (DW_TAG_typedef)
    <173>   DW_AT_name        : (indirect string, offset: 0x213): _LOCK_T
    <177>   DW_AT_decl_file   : 8
    <178>   DW_AT_decl_line   : 34
    <179>   DW_AT_decl_column : 25
    <17a>   DW_AT_type        : <0x17e>
 <1><17e>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <17f>   DW_AT_byte_size   : 4
    <17f>   DW_AT_type        : <0x183>
 <1><183>: Abbrev Number: 16 (DW_TAG_structure_type)
    <184>   DW_AT_name        : (indirect string, offset: 0x34c): __lock
    <188>   DW_AT_declaration : 1
 <1><188>: Abbrev Number: 5 (DW_TAG_typedef)
    <189>   DW_AT_name        : (indirect string, offset: 0x2c5): _flock_t
    <18d>   DW_AT_decl_file   : 7
    <18e>   DW_AT_decl_line   : 36
    <18f>   DW_AT_decl_column : 27
    <190>   DW_AT_type        : <0x172>
 <1><194>: Abbrev Number: 12 (DW_TAG_structure_type)
    <195>   DW_AT_name        : (indirect string, offset: 0x17e): _Bigint
    <199>   DW_AT_byte_size   : 24
    <19a>   DW_AT_decl_file   : 7
    <19a>   DW_AT_decl_line   : 53
    <19b>   DW_AT_decl_column : 8
    <19b>   DW_AT_sibling     : <0x1ea>
 <2><19f>: Abbrev Number: 2 (DW_TAG_member)
    <1a0>   DW_AT_name        : (indirect string, offset: 0x306): _next
    <1a4>   DW_AT_decl_file   : 7
    <1a5>   DW_AT_decl_line   : 55
    <1a6>   DW_AT_decl_column : 19
    <1a7>   DW_AT_type        : <0x1ea>
    <1ab>   DW_AT_data_member_location: 0
 <2><1ac>: Abbrev Number: 9 (DW_TAG_member)
    <1ad>   DW_AT_name        : _k
    <1b0>   DW_AT_decl_file   : 7
    <1b0>   DW_AT_decl_line   : 56
    <1b1>   DW_AT_decl_column : 7
    <1b2>   DW_AT_type        : <0x26>
    <1b6>   DW_AT_data_member_location: 4
 <2><1b7>: Abbrev Number: 2 (DW_TAG_member)
    <1b8>   DW_AT_name        : (indirect string, offset: 0x330): _maxwds
    <1bc>   DW_AT_decl_file   : 7
    <1bd>   DW_AT_decl_line   : 56
    <1be>   DW_AT_decl_column : 11
    <1bf>   DW_AT_type        : <0x26>
    <1c3>   DW_AT_data_member_location: 8
 <2><1c4>: Abbrev Number: 2 (DW_TAG_member)
    <1c5>   DW_AT_name        : (indirect string, offset: 0x167): _sign
    <1c9>   DW_AT_decl_file   : 7
    <1ca>   DW_AT_decl_line   : 56
    <1cb>   DW_AT_decl_column : 20
    <1cc>   DW_AT_type        : <0x26>
    <1d0>   DW_AT_data_member_location: 12
 <2><1d1>: Abbrev Number: 2 (DW_TAG_member)
    <1d2>   DW_AT_name        : (indirect string, offset: 0x118): _wds
    <1d6>   DW_AT_decl_file   : 7
    <1d7>   DW_AT_decl_line   : 56
    <1d8>   DW_AT_decl_column : 27
    <1d9>   DW_AT_type        : <0x26>
    <1dd>   DW_AT_data_member_location: 16
 <2><1de>: Abbrev Number: 9 (DW_TAG_member)
    <1df>   DW_AT_name        : _x
    <1e2>   DW_AT_decl_file   : 7
    <1e2>   DW_AT_decl_line   : 57
    <1e3>   DW_AT_decl_column : 11
    <1e4>   DW_AT_type        : <0x1ef>
    <1e8>   DW_AT_data_member_location: 20
 <2><1e9>: Abbrev Number: 0
 <1><1ea>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <1eb>   DW_AT_byte_size   : 4
    <1eb>   DW_AT_type        : <0x194>
 <1><1ef>: Abbrev Number: 7 (DW_TAG_array_type)
    <1f0>   DW_AT_type        : <0x166>
    <1f4>   DW_AT_sibling     : <0x1ff>
 <2><1f8>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <1f9>   DW_AT_type        : <0x2d>
    <1fd>   DW_AT_upper_bound : 0
 <2><1fe>: Abbrev Number: 0
 <1><1ff>: Abbrev Number: 12 (DW_TAG_structure_type)
    <200>   DW_AT_name        : (indirect string, offset: 0x195): __tm
    <204>   DW_AT_byte_size   : 36
    <205>   DW_AT_decl_file   : 7
    <205>   DW_AT_decl_line   : 61
    <206>   DW_AT_decl_column : 8
    <206>   DW_AT_sibling     : <0x280>
 <2><20a>: Abbrev Number: 2 (DW_TAG_member)
    <20b>   DW_AT_name        : (indirect string, offset: 0xb7): __tm_sec
    <20f>   DW_AT_decl_file   : 7
    <210>   DW_AT_decl_line   : 63
    <211>   DW_AT_decl_column : 9
    <212>   DW_AT_type        : <0x26>
    <216>   DW_AT_data_member_location: 0
 <2><217>: Abbrev Number: 2 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0x510): __tm_min
    <21c>   DW_AT_decl_file   : 7
    <21d>   DW_AT_decl_line   : 64
    <21e>   DW_AT_decl_column : 9
    <21f>   DW_AT_type        : <0x26>
    <223>   DW_AT_data_member_location: 4
 <2><224>: Abbrev Number: 2 (DW_TAG_member)
    <225>   DW_AT_name        : (indirect string, offset: 0xf1): __tm_hour
    <229>   DW_AT_decl_file   : 7
    <22a>   DW_AT_decl_line   : 65
    <22b>   DW_AT_decl_column : 9
    <22c>   DW_AT_type        : <0x26>
    <230>   DW_AT_data_member_location: 8
 <2><231>: Abbrev Number: 2 (DW_TAG_member)
    <232>   DW_AT_name        : (indirect string, offset: 0x54a): __tm_mday
    <236>   DW_AT_decl_file   : 7
    <237>   DW_AT_decl_line   : 66
    <238>   DW_AT_decl_column : 9
    <239>   DW_AT_type        : <0x26>
    <23d>   DW_AT_data_member_location: 12
 <2><23e>: Abbrev Number: 2 (DW_TAG_member)
    <23f>   DW_AT_name        : (indirect string, offset: 0x270): __tm_mon
    <243>   DW_AT_decl_file   : 7
    <244>   DW_AT_decl_line   : 67
    <245>   DW_AT_decl_column : 9
    <246>   DW_AT_type        : <0x26>
    <24a>   DW_AT_data_member_location: 16
 <2><24b>: Abbrev Number: 2 (DW_TAG_member)
    <24c>   DW_AT_name        : (indirect string, offset: 0x245): __tm_year
    <250>   DW_AT_decl_file   : 7
    <251>   DW_AT_decl_line   : 68
    <252>   DW_AT_decl_column : 9
    <253>   DW_AT_type        : <0x26>
    <257>   DW_AT_data_member_location: 20
 <2><258>: Abbrev Number: 2 (DW_TAG_member)
    <259>   DW_AT_name        : (indirect string, offset: 0x4c1): __tm_wday
    <25d>   DW_AT_decl_file   : 7
    <25e>   DW_AT_decl_line   : 69
    <25f>   DW_AT_decl_column : 9
    <260>   DW_AT_type        : <0x26>
    <264>   DW_AT_data_member_location: 24
 <2><265>: Abbrev Number: 2 (DW_TAG_member)
    <266>   DW_AT_name        : (indirect string, offset: 0x2ce): __tm_yday
    <26a>   DW_AT_decl_file   : 7
    <26b>   DW_AT_decl_line   : 70
    <26c>   DW_AT_decl_column : 9
    <26d>   DW_AT_type        : <0x26>
    <271>   DW_AT_data_member_location: 28
 <2><272>: Abbrev Number: 2 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0x4f6): __tm_isdst
    <277>   DW_AT_decl_file   : 7
    <278>   DW_AT_decl_line   : 71
    <279>   DW_AT_decl_column : 9
    <27a>   DW_AT_type        : <0x26>
    <27e>   DW_AT_data_member_location: 32
 <2><27f>: Abbrev Number: 0
 <1><280>: Abbrev Number: 12 (DW_TAG_structure_type)
    <281>   DW_AT_name        : (indirect string, offset: 0x2d8): __sbuf
    <285>   DW_AT_byte_size   : 8
    <286>   DW_AT_decl_file   : 7
    <286>   DW_AT_decl_line   : 116
    <287>   DW_AT_decl_column : 8
    <287>   DW_AT_sibling     : <0x2a6>
 <2><28b>: Abbrev Number: 2 (DW_TAG_member)
    <28c>   DW_AT_name        : (indirect string, offset: 0xeb): _base
    <290>   DW_AT_decl_file   : 7
    <291>   DW_AT_decl_line   : 117
    <292>   DW_AT_decl_column : 17
    <293>   DW_AT_type        : <0x2a6>
    <297>   DW_AT_data_member_location: 0
 <2><298>: Abbrev Number: 2 (DW_TAG_member)
    <299>   DW_AT_name        : (indirect string, offset: 0x288f): _size
    <29d>   DW_AT_decl_file   : 7
    <29e>   DW_AT_decl_line   : 118
    <29f>   DW_AT_decl_column : 6
    <2a0>   DW_AT_type        : <0x26>
    <2a4>   DW_AT_data_member_location: 4
 <2><2a5>: Abbrev Number: 0
 <1><2a6>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <2a7>   DW_AT_byte_size   : 4
    <2a7>   DW_AT_type        : <0x55>
 <1><2ab>: Abbrev Number: 12 (DW_TAG_structure_type)
    <2ac>   DW_AT_name        : (indirect string, offset: 0x2f9): __sFILE
    <2b0>   DW_AT_byte_size   : 104
    <2b1>   DW_AT_decl_file   : 7
    <2b1>   DW_AT_decl_line   : 153
    <2b2>   DW_AT_decl_column : 8
    <2b2>   DW_AT_sibling     : <0x3e4>
 <2><2b6>: Abbrev Number: 9 (DW_TAG_member)
    <2b7>   DW_AT_name        : _p
    <2ba>   DW_AT_decl_file   : 7
    <2ba>   DW_AT_decl_line   : 154
    <2bb>   DW_AT_decl_column : 18
    <2bc>   DW_AT_type        : <0x2a6>
    <2c0>   DW_AT_data_member_location: 0
 <2><2c1>: Abbrev Number: 9 (DW_TAG_member)
    <2c2>   DW_AT_name        : _r
    <2c5>   DW_AT_decl_file   : 7
    <2c5>   DW_AT_decl_line   : 155
    <2c6>   DW_AT_decl_column : 7
    <2c7>   DW_AT_type        : <0x26>
    <2cb>   DW_AT_data_member_location: 4
 <2><2cc>: Abbrev Number: 9 (DW_TAG_member)
    <2cd>   DW_AT_name        : _w
    <2d0>   DW_AT_decl_file   : 7
    <2d0>   DW_AT_decl_line   : 156
    <2d1>   DW_AT_decl_column : 7
    <2d2>   DW_AT_type        : <0x26>
    <2d6>   DW_AT_data_member_location: 8
 <2><2d7>: Abbrev Number: 2 (DW_TAG_member)
    <2d8>   DW_AT_name        : (indirect string, offset: 0x111): _flags
    <2dc>   DW_AT_decl_file   : 7
    <2dd>   DW_AT_decl_line   : 157
    <2de>   DW_AT_decl_column : 9
    <2df>   DW_AT_type        : <0x5c>
    <2e3>   DW_AT_data_member_location: 12
 <2><2e4>: Abbrev Number: 2 (DW_TAG_member)
    <2e5>   DW_AT_name        : (indirect string, offset: 0x1b2): _file
    <2e9>   DW_AT_decl_file   : 7
    <2ea>   DW_AT_decl_line   : 158
    <2eb>   DW_AT_decl_column : 9
    <2ec>   DW_AT_type        : <0x5c>
    <2f0>   DW_AT_data_member_location: 14
 <2><2f1>: Abbrev Number: 9 (DW_TAG_member)
    <2f2>   DW_AT_name        : _bf
    <2f6>   DW_AT_decl_file   : 7
    <2f6>   DW_AT_decl_line   : 159
    <2f7>   DW_AT_decl_column : 17
    <2f8>   DW_AT_type        : <0x280>
    <2fc>   DW_AT_data_member_location: 16
 <2><2fd>: Abbrev Number: 2 (DW_TAG_member)
    <2fe>   DW_AT_name        : (indirect string, offset: 0x94): _lbfsize
    <302>   DW_AT_decl_file   : 7
    <303>   DW_AT_decl_line   : 160
    <304>   DW_AT_decl_column : 7
    <305>   DW_AT_type        : <0x26>
    <309>   DW_AT_data_member_location: 24
 <2><30a>: Abbrev Number: 2 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x5e4d): _data
    <30f>   DW_AT_decl_file   : 7
    <310>   DW_AT_decl_line   : 163
    <311>   DW_AT_decl_column : 18
    <312>   DW_AT_type        : <0x4fd>
    <316>   DW_AT_data_member_location: 28
 <2><317>: Abbrev Number: 2 (DW_TAG_member)
    <318>   DW_AT_name        : (indirect string, offset: 0x109): _cookie
    <31c>   DW_AT_decl_file   : 7
    <31d>   DW_AT_decl_line   : 167
    <31e>   DW_AT_decl_column : 10
    <31f>   DW_AT_type        : <0xbb>
    <323>   DW_AT_data_member_location: 32
 <2><324>: Abbrev Number: 2 (DW_TAG_member)
    <325>   DW_AT_name        : (indirect string, offset: 0x69cd): _read
    <329>   DW_AT_decl_file   : 7
    <32a>   DW_AT_decl_line   : 169
    <32b>   DW_AT_decl_column : 29
    <32c>   DW_AT_type        : <0x531>
    <330>   DW_AT_data_member_location: 36
 <2><331>: Abbrev Number: 2 (DW_TAG_member)
    <332>   DW_AT_name        : (indirect string, offset: 0x69e5): _write
    <336>   DW_AT_decl_file   : 7
    <337>   DW_AT_decl_line   : 171
    <338>   DW_AT_decl_column : 29
    <339>   DW_AT_type        : <0x559>
    <33d>   DW_AT_data_member_location: 40
 <2><33e>: Abbrev Number: 2 (DW_TAG_member)
    <33f>   DW_AT_name        : (indirect string, offset: 0x353): _seek
    <343>   DW_AT_decl_file   : 7
    <344>   DW_AT_decl_line   : 174
    <345>   DW_AT_decl_column : 13
    <346>   DW_AT_type        : <0x57c>
    <34a>   DW_AT_data_member_location: 44
 <2><34b>: Abbrev Number: 2 (DW_TAG_member)
    <34c>   DW_AT_name        : (indirect string, offset: 0xc0): _close
    <350>   DW_AT_decl_file   : 7
    <351>   DW_AT_decl_line   : 175
    <352>   DW_AT_decl_column : 9
    <353>   DW_AT_type        : <0x595>
    <357>   DW_AT_data_member_location: 48
 <2><358>: Abbrev Number: 9 (DW_TAG_member)
    <359>   DW_AT_name        : _ub
    <35d>   DW_AT_decl_file   : 7
    <35d>   DW_AT_decl_line   : 178
    <35e>   DW_AT_decl_column : 17
    <35f>   DW_AT_type        : <0x280>
    <363>   DW_AT_data_member_location: 52
 <2><364>: Abbrev Number: 9 (DW_TAG_member)
    <365>   DW_AT_name        : _up
    <369>   DW_AT_decl_file   : 7
    <369>   DW_AT_decl_line   : 179
    <36a>   DW_AT_decl_column : 18
    <36b>   DW_AT_type        : <0x2a6>
    <36f>   DW_AT_data_member_location: 60
 <2><370>: Abbrev Number: 9 (DW_TAG_member)
    <371>   DW_AT_name        : _ur
    <375>   DW_AT_decl_file   : 7
    <375>   DW_AT_decl_line   : 180
    <376>   DW_AT_decl_column : 7
    <377>   DW_AT_type        : <0x26>
    <37b>   DW_AT_data_member_location: 64
 <2><37c>: Abbrev Number: 2 (DW_TAG_member)
    <37d>   DW_AT_name        : (indirect string, offset: 0xe5): _ubuf
    <381>   DW_AT_decl_file   : 7
    <382>   DW_AT_decl_line   : 183
    <383>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0x59a>
    <388>   DW_AT_data_member_location: 68
 <2><389>: Abbrev Number: 2 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x4f0): _nbuf
    <38e>   DW_AT_decl_file   : 7
    <38f>   DW_AT_decl_line   : 184
    <390>   DW_AT_decl_column : 17
    <391>   DW_AT_type        : <0x5aa>
    <395>   DW_AT_data_member_location: 71
 <2><396>: Abbrev Number: 9 (DW_TAG_member)
    <397>   DW_AT_name        : _lb
    <39b>   DW_AT_decl_file   : 7
    <39b>   DW_AT_decl_line   : 187
    <39c>   DW_AT_decl_column : 17
    <39d>   DW_AT_type        : <0x280>
    <3a1>   DW_AT_data_member_location: 72
 <2><3a2>: Abbrev Number: 2 (DW_TAG_member)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x27ba): _blksize
    <3a7>   DW_AT_decl_file   : 7
    <3a8>   DW_AT_decl_line   : 190
    <3a9>   DW_AT_decl_column : 7
    <3aa>   DW_AT_type        : <0x26>
    <3ae>   DW_AT_data_member_location: 80
 <2><3af>: Abbrev Number: 2 (DW_TAG_member)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x25d): _offset
    <3b4>   DW_AT_decl_file   : 7
    <3b5>   DW_AT_decl_line   : 191
    <3b6>   DW_AT_decl_column : 10
    <3b7>   DW_AT_type        : <0xee>
    <3bb>   DW_AT_data_member_location: 84
 <2><3bc>: Abbrev Number: 2 (DW_TAG_member)
    <3bd>   DW_AT_name        : (indirect string, offset: 0x34d): _lock
    <3c1>   DW_AT_decl_file   : 7
    <3c2>   DW_AT_decl_line   : 198
    <3c3>   DW_AT_decl_column : 12
    <3c4>   DW_AT_type        : <0x188>
    <3c8>   DW_AT_data_member_location: 88
 <2><3c9>: Abbrev Number: 2 (DW_TAG_member)
    <3ca>   DW_AT_name        : (indirect string, offset: 0x19a): _mbstate
    <3ce>   DW_AT_decl_file   : 7
    <3cf>   DW_AT_decl_line   : 200
    <3d0>   DW_AT_decl_column : 14
    <3d1>   DW_AT_type        : <0x15a>
    <3d5>   DW_AT_data_member_location: 92
 <2><3d6>: Abbrev Number: 2 (DW_TAG_member)
    <3d7>   DW_AT_name        : (indirect string, offset: 0x2df): _flags2
    <3db>   DW_AT_decl_file   : 7
    <3dc>   DW_AT_decl_line   : 201
    <3dd>   DW_AT_decl_column : 9
    <3de>   DW_AT_type        : <0x26>
    <3e2>   DW_AT_data_member_location: 100
 <2><3e3>: Abbrev Number: 0
 <1><3e4>: Abbrev Number: 10 (DW_TAG_structure_type)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x809c): _reent
    <3e9>   DW_AT_byte_size   : 76
    <3ea>   DW_AT_decl_file   : 7
    <3eb>   DW_AT_decl_line   : 379
    <3ed>   DW_AT_decl_column : 8
    <3ee>   DW_AT_sibling     : <0x4fd>
 <2><3f2>: Abbrev Number: 1 (DW_TAG_member)
    <3f3>   DW_AT_name        : (indirect string, offset: 0x2925): _errno
    <3f7>   DW_AT_decl_file   : 7
    <3f8>   DW_AT_decl_line   : 383
    <3fa>   DW_AT_decl_column : 7
    <3fb>   DW_AT_type        : <0x26>
    <3ff>   DW_AT_data_member_location: 0
 <2><400>: Abbrev Number: 1 (DW_TAG_member)
    <401>   DW_AT_name        : (indirect string, offset: 0x4d5): _stdin
    <405>   DW_AT_decl_file   : 7
    <406>   DW_AT_decl_line   : 388
    <408>   DW_AT_decl_column : 11
    <409>   DW_AT_type        : <0x5c7>
    <40d>   DW_AT_data_member_location: 4
 <2><40e>: Abbrev Number: 1 (DW_TAG_member)
    <40f>   DW_AT_name        : (indirect string, offset: 0x4b9): _stdout
    <413>   DW_AT_decl_file   : 7
    <414>   DW_AT_decl_line   : 388
    <416>   DW_AT_decl_column : 20
    <417>   DW_AT_type        : <0x5c7>
    <41b>   DW_AT_data_member_location: 8
 <2><41c>: Abbrev Number: 1 (DW_TAG_member)
    <41d>   DW_AT_name        : (indirect string, offset: 0x176): _stderr
    <421>   DW_AT_decl_file   : 7
    <422>   DW_AT_decl_line   : 388
    <424>   DW_AT_decl_column : 30
    <425>   DW_AT_type        : <0x5c7>
    <429>   DW_AT_data_member_location: 12
 <2><42a>: Abbrev Number: 1 (DW_TAG_member)
    <42b>   DW_AT_name        : (indirect string, offset: 0x319): _inc
    <42f>   DW_AT_decl_file   : 7
    <430>   DW_AT_decl_line   : 390
    <432>   DW_AT_decl_column : 8
    <433>   DW_AT_type        : <0x26>
    <437>   DW_AT_data_member_location: 16
 <2><438>: Abbrev Number: 1 (DW_TAG_member)
    <439>   DW_AT_name        : (indirect string, offset: 0x12): _emergency
    <43d>   DW_AT_decl_file   : 7
    <43e>   DW_AT_decl_line   : 392
    <440>   DW_AT_decl_column : 9
    <441>   DW_AT_type        : <0x520>
    <445>   DW_AT_data_member_location: 20
 <2><446>: Abbrev Number: 1 (DW_TAG_member)
    <447>   DW_AT_name        : (indirect string, offset: 0x31e): _locale
    <44b>   DW_AT_decl_file   : 7
    <44c>   DW_AT_decl_line   : 398
    <44e>   DW_AT_decl_column : 22
    <44f>   DW_AT_type        : <0x72d>
    <453>   DW_AT_data_member_location: 24
 <2><454>: Abbrev Number: 24 (DW_TAG_member)
    <455>   DW_AT_name        : _mp
    <459>   DW_AT_decl_file   : 7
    <45a>   DW_AT_decl_line   : 400
    <45c>   DW_AT_decl_column : 18
    <45d>   DW_AT_type        : <0x732>
    <461>   DW_AT_data_member_location: 28
 <2><462>: Abbrev Number: 1 (DW_TAG_member)
    <463>   DW_AT_name        : (indirect string, offset: 0x326): __cleanup
    <467>   DW_AT_decl_file   : 7
    <468>   DW_AT_decl_line   : 402
    <46a>   DW_AT_decl_column : 10
    <46b>   DW_AT_type        : <0x742>
    <46f>   DW_AT_data_member_location: 32
 <2><470>: Abbrev Number: 1 (DW_TAG_member)
    <471>   DW_AT_name        : (indirect string, offset: 0x186): _gamma_signgam
    <475>   DW_AT_decl_file   : 7
    <476>   DW_AT_decl_line   : 404
    <478>   DW_AT_decl_column : 7
    <479>   DW_AT_type        : <0x26>
    <47d>   DW_AT_data_member_location: 36
 <2><47e>: Abbrev Number: 1 (DW_TAG_member)
    <47f>   DW_AT_name        : (indirect string, offset: 0x1aa): _cvtlen
    <483>   DW_AT_decl_file   : 7
    <484>   DW_AT_decl_line   : 407
    <486>   DW_AT_decl_column : 7
    <487>   DW_AT_type        : <0x26>
    <48b>   DW_AT_data_member_location: 40
 <2><48c>: Abbrev Number: 1 (DW_TAG_member)
    <48d>   DW_AT_name        : (indirect string, offset: 0x135): _cvtbuf
    <491>   DW_AT_decl_file   : 7
    <492>   DW_AT_decl_line   : 408
    <494>   DW_AT_decl_column : 9
    <495>   DW_AT_type        : <0x520>
    <499>   DW_AT_data_member_location: 44
 <2><49a>: Abbrev Number: 1 (DW_TAG_member)
    <49b>   DW_AT_name        : (indirect string, offset: 0x519): _r48
    <49f>   DW_AT_decl_file   : 7
    <4a0>   DW_AT_decl_line   : 410
    <4a2>   DW_AT_decl_column : 19
    <4a3>   DW_AT_type        : <0x747>
    <4a7>   DW_AT_data_member_location: 48
 <2><4a8>: Abbrev Number: 1 (DW_TAG_member)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x501): _localtime_buf
    <4ad>   DW_AT_decl_file   : 7
    <4ae>   DW_AT_decl_line   : 411
    <4b0>   DW_AT_decl_column : 16
    <4b1>   DW_AT_type        : <0x74c>
    <4b5>   DW_AT_data_member_location: 52
 <2><4b6>: Abbrev Number: 1 (DW_TAG_member)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x1e3): _asctime_buf
    <4bb>   DW_AT_decl_file   : 7
    <4bc>   DW_AT_decl_line   : 412
    <4be>   DW_AT_decl_column : 9
    <4bf>   DW_AT_type        : <0x520>
    <4c3>   DW_AT_data_member_location: 56
 <2><4c4>: Abbrev Number: 1 (DW_TAG_member)
    <4c5>   DW_AT_name        : (indirect string, offset: 0x4e6): _sig_func
    <4c9>   DW_AT_decl_file   : 7
    <4ca>   DW_AT_decl_line   : 415
    <4cc>   DW_AT_decl_column : 12
    <4cd>   DW_AT_type        : <0x75c>
    <4d1>   DW_AT_data_member_location: 60
 <2><4d2>: Abbrev Number: 1 (DW_TAG_member)
    <4d3>   DW_AT_name        : (indirect string, offset: 0xfb): __sf
    <4d7>   DW_AT_decl_file   : 7
    <4d8>   DW_AT_decl_line   : 423
    <4da>   DW_AT_decl_column : 11
    <4db>   DW_AT_type        : <0x5c7>
    <4df>   DW_AT_data_member_location: 64
 <2><4e0>: Abbrev Number: 1 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0x257): _misc
    <4e5>   DW_AT_decl_file   : 7
    <4e6>   DW_AT_decl_line   : 424
    <4e8>   DW_AT_decl_column : 23
    <4e9>   DW_AT_type        : <0x766>
    <4ed>   DW_AT_data_member_location: 68
 <2><4ee>: Abbrev Number: 1 (DW_TAG_member)
    <4ef>   DW_AT_name        : (indirect string, offset: 0x1d7): _signal_buf
    <4f3>   DW_AT_decl_file   : 7
    <4f4>   DW_AT_decl_line   : 425
    <4f6>   DW_AT_decl_column : 9
    <4f7>   DW_AT_type        : <0x520>
    <4fb>   DW_AT_data_member_location: 72
 <2><4fc>: Abbrev Number: 0
 <1><4fd>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <4fe>   DW_AT_byte_size   : 4
    <4fe>   DW_AT_type        : <0x3e4>
 <1><502>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <503>   DW_AT_prototyped  : 1
    <503>   DW_AT_type        : <0x26>
    <507>   DW_AT_sibling     : <0x520>
 <2><50b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <50c>   DW_AT_type        : <0x4fd>
 <2><510>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <511>   DW_AT_type        : <0xbb>
 <2><515>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <516>   DW_AT_type        : <0x520>
 <2><51a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <51b>   DW_AT_type        : <0x26>
 <2><51f>: Abbrev Number: 0
 <1><520>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <521>   DW_AT_byte_size   : 4
    <521>   DW_AT_type        : <0x525>
 <1><525>: Abbrev Number: 6 (DW_TAG_base_type)
    <526>   DW_AT_byte_size   : 1
    <527>   DW_AT_encoding    : 8	(unsigned char)
    <528>   DW_AT_name        : (indirect string, offset: 0x2c0): char
 <1><52c>: Abbrev Number: 25 (DW_TAG_const_type)
    <52d>   DW_AT_type        : <0x525>
 <1><531>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <532>   DW_AT_byte_size   : 4
    <532>   DW_AT_type        : <0x502>
 <1><536>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <537>   DW_AT_prototyped  : 1
    <537>   DW_AT_type        : <0x26>
    <53b>   DW_AT_sibling     : <0x554>
 <2><53f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <540>   DW_AT_type        : <0x4fd>
 <2><544>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <545>   DW_AT_type        : <0xbb>
 <2><549>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <54a>   DW_AT_type        : <0x554>
 <2><54e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <54f>   DW_AT_type        : <0x26>
 <2><553>: Abbrev Number: 0
 <1><554>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <555>   DW_AT_byte_size   : 4
    <555>   DW_AT_type        : <0x52c>
 <1><559>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <55a>   DW_AT_byte_size   : 4
    <55a>   DW_AT_type        : <0x536>
 <1><55e>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <55f>   DW_AT_prototyped  : 1
    <55f>   DW_AT_type        : <0xfa>
    <563>   DW_AT_sibling     : <0x57c>
 <2><567>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <568>   DW_AT_type        : <0x4fd>
 <2><56c>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <56d>   DW_AT_type        : <0xbb>
 <2><571>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <572>   DW_AT_type        : <0xfa>
 <2><576>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <577>   DW_AT_type        : <0x26>
 <2><57b>: Abbrev Number: 0
 <1><57c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <57d>   DW_AT_byte_size   : 4
    <57d>   DW_AT_type        : <0x55e>
 <1><581>: Abbrev Number: 13 (DW_TAG_subroutine_type)
    <582>   DW_AT_prototyped  : 1
    <582>   DW_AT_type        : <0x26>
    <586>   DW_AT_sibling     : <0x595>
 <2><58a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <58b>   DW_AT_type        : <0x4fd>
 <2><58f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <590>   DW_AT_type        : <0xbb>
 <2><594>: Abbrev Number: 0
 <1><595>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <596>   DW_AT_byte_size   : 4
    <596>   DW_AT_type        : <0x581>
 <1><59a>: Abbrev Number: 7 (DW_TAG_array_type)
    <59b>   DW_AT_type        : <0x55>
    <59f>   DW_AT_sibling     : <0x5aa>
 <2><5a3>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5a4>   DW_AT_type        : <0x2d>
    <5a8>   DW_AT_upper_bound : 2
 <2><5a9>: Abbrev Number: 0
 <1><5aa>: Abbrev Number: 7 (DW_TAG_array_type)
    <5ab>   DW_AT_type        : <0x55>
    <5af>   DW_AT_sibling     : <0x5ba>
 <2><5b3>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <5b4>   DW_AT_type        : <0x2d>
    <5b8>   DW_AT_upper_bound : 0
 <2><5b9>: Abbrev Number: 0
 <1><5ba>: Abbrev Number: 11 (DW_TAG_typedef)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x2e7): __FILE
    <5bf>   DW_AT_decl_file   : 7
    <5c0>   DW_AT_decl_line   : 270
    <5c2>   DW_AT_decl_column : 26
    <5c3>   DW_AT_type        : <0x2ab>
 <1><5c7>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <5c8>   DW_AT_byte_size   : 4
    <5c8>   DW_AT_type        : <0x5ba>
 <1><5cc>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5cd>   DW_AT_name        : (indirect string, offset: 0xa): _rand48
    <5d1>   DW_AT_byte_size   : 24
    <5d2>   DW_AT_decl_file   : 7
    <5d3>   DW_AT_decl_line   : 306
    <5d5>   DW_AT_decl_column : 8
    <5d6>   DW_AT_sibling     : <0x613>
 <2><5da>: Abbrev Number: 1 (DW_TAG_member)
    <5db>   DW_AT_name        : (indirect string, offset: 0x451): _seed
    <5df>   DW_AT_decl_file   : 7
    <5e0>   DW_AT_decl_line   : 307
    <5e2>   DW_AT_decl_column : 18
    <5e3>   DW_AT_type        : <0x613>
    <5e7>   DW_AT_data_member_location: 0
 <2><5e8>: Abbrev Number: 1 (DW_TAG_member)
    <5e9>   DW_AT_name        : (indirect string, offset: 0x22c): _mult
    <5ed>   DW_AT_decl_file   : 7
    <5ee>   DW_AT_decl_line   : 308
    <5f0>   DW_AT_decl_column : 18
    <5f1>   DW_AT_type        : <0x613>
    <5f5>   DW_AT_data_member_location: 6
 <2><5f6>: Abbrev Number: 1 (DW_TAG_member)
    <5f7>   DW_AT_name        : (indirect string, offset: 0x401a): _add
    <5fb>   DW_AT_decl_file   : 7
    <5fc>   DW_AT_decl_line   : 309
    <5fe>   DW_AT_decl_column : 18
    <5ff>   DW_AT_type        : <0x6f>
    <603>   DW_AT_data_member_location: 12
 <2><604>: Abbrev Number: 1 (DW_TAG_member)
    <605>   DW_AT_name        : (indirect string, offset: 0x301): _rand_next
    <609>   DW_AT_decl_file   : 7
    <60a>   DW_AT_decl_line   : 312
    <60c>   DW_AT_decl_column : 36
    <60d>   DW_AT_type        : <0x90>
    <611>   DW_AT_data_member_location: 16
 <2><612>: Abbrev Number: 0
 <1><613>: Abbrev Number: 7 (DW_TAG_array_type)
    <614>   DW_AT_type        : <0x6f>
    <618>   DW_AT_sibling     : <0x623>
 <2><61c>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <61d>   DW_AT_type        : <0x2d>
    <621>   DW_AT_upper_bound : 2
 <2><622>: Abbrev Number: 0
 <1><623>: Abbrev Number: 10 (DW_TAG_structure_type)
    <624>   DW_AT_name        : (indirect string, offset: 0x460): _mprec
    <628>   DW_AT_byte_size   : 16
    <629>   DW_AT_decl_file   : 7
    <62a>   DW_AT_decl_line   : 348
    <62c>   DW_AT_decl_column : 8
    <62d>   DW_AT_sibling     : <0x66a>
 <2><631>: Abbrev Number: 1 (DW_TAG_member)
    <632>   DW_AT_name        : (indirect string, offset: 0x1f0): _result
    <636>   DW_AT_decl_file   : 7
    <637>   DW_AT_decl_line   : 351
    <639>   DW_AT_decl_column : 19
    <63a>   DW_AT_type        : <0x1ea>
    <63e>   DW_AT_data_member_location: 0
 <2><63f>: Abbrev Number: 1 (DW_TAG_member)
    <640>   DW_AT_name        : (indirect string, offset: 0x11d): _result_k
    <644>   DW_AT_decl_file   : 7
    <645>   DW_AT_decl_line   : 352
    <647>   DW_AT_decl_column : 7
    <648>   DW_AT_type        : <0x26>
    <64c>   DW_AT_data_member_location: 4
 <2><64d>: Abbrev Number: 1 (DW_TAG_member)
    <64e>   DW_AT_name        : (indirect string, offset: 0x52c): _p5s
    <652>   DW_AT_decl_file   : 7
    <653>   DW_AT_decl_line   : 353
    <655>   DW_AT_decl_column : 19
    <656>   DW_AT_type        : <0x1ea>
    <65a>   DW_AT_data_member_location: 8
 <2><65b>: Abbrev Number: 1 (DW_TAG_member)
    <65c>   DW_AT_name        : (indirect string, offset: 0x294): _freelist
    <660>   DW_AT_decl_file   : 7
    <661>   DW_AT_decl_line   : 354
    <663>   DW_AT_decl_column : 20
    <664>   DW_AT_type        : <0x66a>
    <668>   DW_AT_data_member_location: 12
 <2><669>: Abbrev Number: 0
 <1><66a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <66b>   DW_AT_byte_size   : 4
    <66b>   DW_AT_type        : <0x1ea>
 <1><66f>: Abbrev Number: 10 (DW_TAG_structure_type)
    <670>   DW_AT_name        : (indirect string, offset: 0x485): _misc_reent
    <674>   DW_AT_byte_size   : 80
    <675>   DW_AT_decl_file   : 7
    <676>   DW_AT_decl_line   : 358
    <678>   DW_AT_decl_column : 8
    <679>   DW_AT_sibling     : <0x718>
 <2><67d>: Abbrev Number: 1 (DW_TAG_member)
    <67e>   DW_AT_name        : (indirect string, offset: 0x470): _strtok_last
    <682>   DW_AT_decl_file   : 7
    <683>   DW_AT_decl_line   : 361
    <685>   DW_AT_decl_column : 9
    <686>   DW_AT_type        : <0x520>
    <68a>   DW_AT_data_member_location: 0
 <2><68b>: Abbrev Number: 1 (DW_TAG_member)
    <68c>   DW_AT_name        : (indirect string, offset: 0x30c): _mblen_state
    <690>   DW_AT_decl_file   : 7
    <691>   DW_AT_decl_line   : 362
    <693>   DW_AT_decl_column : 14
    <694>   DW_AT_type        : <0x15a>
    <698>   DW_AT_data_member_location: 4
 <2><699>: Abbrev Number: 1 (DW_TAG_member)
    <69a>   DW_AT_name        : (indirect string, offset: 0x2a9): _wctomb_state
    <69e>   DW_AT_decl_file   : 7
    <69f>   DW_AT_decl_line   : 363
    <6a1>   DW_AT_decl_column : 14
    <6a2>   DW_AT_type        : <0x15a>
    <6a6>   DW_AT_data_member_location: 12
 <2><6a7>: Abbrev Number: 1 (DW_TAG_member)
    <6a8>   DW_AT_name        : (indirect string, offset: 0x51e): _mbtowc_state
    <6ac>   DW_AT_decl_file   : 7
    <6ad>   DW_AT_decl_line   : 364
    <6af>   DW_AT_decl_column : 14
    <6b0>   DW_AT_type        : <0x15a>
    <6b4>   DW_AT_data_member_location: 20
 <2><6b5>: Abbrev Number: 1 (DW_TAG_member)
    <6b6>   DW_AT_name        : (indirect string, offset: 0x4dc): _l64a_buf
    <6ba>   DW_AT_decl_file   : 7
    <6bb>   DW_AT_decl_line   : 365
    <6bd>   DW_AT_decl_column : 8
    <6be>   DW_AT_type        : <0x718>
    <6c2>   DW_AT_data_member_location: 28
 <2><6c3>: Abbrev Number: 1 (DW_TAG_member)
    <6c4>   DW_AT_name        : (indirect string, offset: 0x39): _getdate_err
    <6c8>   DW_AT_decl_file   : 7
    <6c9>   DW_AT_decl_line   : 366
    <6cb>   DW_AT_decl_column : 7
    <6cc>   DW_AT_type        : <0x26>
    <6d0>   DW_AT_data_member_location: 36
 <2><6d1>: Abbrev Number: 1 (DW_TAG_member)
    <6d2>   DW_AT_name        : (indirect string, offset: 0x14e): _mbrlen_state
    <6d6>   DW_AT_decl_file   : 7
    <6d7>   DW_AT_decl_line   : 367
    <6d9>   DW_AT_decl_column : 14
    <6da>   DW_AT_type        : <0x15a>
    <6de>   DW_AT_data_member_location: 40
 <2><6df>: Abbrev Number: 1 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0xa8): _mbrtowc_state
    <6e4>   DW_AT_decl_file   : 7
    <6e5>   DW_AT_decl_line   : 368
    <6e7>   DW_AT_decl_column : 14
    <6e8>   DW_AT_type        : <0x15a>
    <6ec>   DW_AT_data_member_location: 48
 <2><6ed>: Abbrev Number: 1 (DW_TAG_member)
    <6ee>   DW_AT_name        : (indirect string, offset: 0x13d): _mbsrtowcs_state
    <6f2>   DW_AT_decl_file   : 7
    <6f3>   DW_AT_decl_line   : 369
    <6f5>   DW_AT_decl_column : 14
    <6f6>   DW_AT_type        : <0x15a>
    <6fa>   DW_AT_data_member_location: 56
 <2><6fb>: Abbrev Number: 1 (DW_TAG_member)
    <6fc>   DW_AT_name        : (indirect string, offset: 0x46): _wcrtomb_state
    <700>   DW_AT_decl_file   : 7
    <701>   DW_AT_decl_line   : 370
    <703>   DW_AT_decl_column : 14
    <704>   DW_AT_type        : <0x15a>
    <708>   DW_AT_data_member_location: 64
 <2><709>: Abbrev Number: 1 (DW_TAG_member)
    <70a>   DW_AT_name        : (indirect string, offset: 0x55): _wcsrtombs_state
    <70e>   DW_AT_decl_file   : 7
    <70f>   DW_AT_decl_line   : 371
    <711>   DW_AT_decl_column : 14
    <712>   DW_AT_type        : <0x15a>
    <716>   DW_AT_data_member_location: 72
 <2><717>: Abbrev Number: 0
 <1><718>: Abbrev Number: 7 (DW_TAG_array_type)
    <719>   DW_AT_type        : <0x525>
    <71d>   DW_AT_sibling     : <0x728>
 <2><721>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <722>   DW_AT_type        : <0x2d>
    <726>   DW_AT_upper_bound : 7
 <2><727>: Abbrev Number: 0
 <1><728>: Abbrev Number: 16 (DW_TAG_structure_type)
    <729>   DW_AT_name        : (indirect string, offset: 0x9d): __locale_t
    <72d>   DW_AT_declaration : 1
 <1><72d>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <72e>   DW_AT_byte_size   : 4
    <72e>   DW_AT_type        : <0x728>
 <1><732>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <733>   DW_AT_byte_size   : 4
    <733>   DW_AT_type        : <0x623>
 <1><737>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <738>   DW_AT_prototyped  : 1
    <738>   DW_AT_sibling     : <0x742>
 <2><73c>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <73d>   DW_AT_type        : <0x4fd>
 <2><741>: Abbrev Number: 0
 <1><742>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <743>   DW_AT_byte_size   : 4
    <743>   DW_AT_type        : <0x737>
 <1><747>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <748>   DW_AT_byte_size   : 4
    <748>   DW_AT_type        : <0x5cc>
 <1><74c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <74d>   DW_AT_byte_size   : 4
    <74d>   DW_AT_type        : <0x1ff>
 <1><751>: Abbrev Number: 17 (DW_TAG_subroutine_type)
    <752>   DW_AT_prototyped  : 1
    <752>   DW_AT_sibling     : <0x75c>
 <2><756>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <757>   DW_AT_type        : <0x26>
 <2><75b>: Abbrev Number: 0
 <1><75c>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <75d>   DW_AT_byte_size   : 4
    <75d>   DW_AT_type        : <0x761>
 <1><761>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <762>   DW_AT_byte_size   : 4
    <762>   DW_AT_type        : <0x751>
 <1><766>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <767>   DW_AT_byte_size   : 4
    <767>   DW_AT_type        : <0x66f>
 <1><76b>: Abbrev Number: 10 (DW_TAG_structure_type)
    <76c>   DW_AT_name        : (indirect string, offset: 0x27): xSTATIC_LIST_ITEM
    <770>   DW_AT_byte_size   : 20
    <771>   DW_AT_decl_file   : 9
    <772>   DW_AT_decl_line   : 1044
    <774>   DW_AT_decl_column : 8
    <775>   DW_AT_sibling     : <0x796>
 <2><779>: Abbrev Number: 1 (DW_TAG_member)
    <77a>   DW_AT_name        : (indirect string, offset: 0xb5f): xDummy2
    <77e>   DW_AT_decl_file   : 9
    <77f>   DW_AT_decl_line   : 1049
    <781>   DW_AT_decl_column : 13
    <782>   DW_AT_type        : <0xd5>
    <786>   DW_AT_data_member_location: 0
 <2><787>: Abbrev Number: 1 (DW_TAG_member)
    <788>   DW_AT_name        : (indirect string, offset: 0x232): pvDummy3
    <78c>   DW_AT_decl_file   : 9
    <78d>   DW_AT_decl_line   : 1050
    <78f>   DW_AT_decl_column : 8
    <790>   DW_AT_type        : <0x796>
    <794>   DW_AT_data_member_location: 4
 <2><795>: Abbrev Number: 0
 <1><796>: Abbrev Number: 7 (DW_TAG_array_type)
    <797>   DW_AT_type        : <0xbb>
    <79b>   DW_AT_sibling     : <0x7a6>
 <2><79f>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <7a0>   DW_AT_type        : <0x2d>
    <7a4>   DW_AT_upper_bound : 3
 <2><7a5>: Abbrev Number: 0
 <1><7a6>: Abbrev Number: 11 (DW_TAG_typedef)
    <7a7>   DW_AT_name        : (indirect string, offset: 0x283): StaticListItem_t
    <7ab>   DW_AT_decl_file   : 9
    <7ac>   DW_AT_decl_line   : 1055
    <7ae>   DW_AT_decl_column : 34
    <7af>   DW_AT_type        : <0x76b>
 <1><7b3>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7b4>   DW_AT_name        : (indirect string, offset: 0x338): xSTATIC_TCB
    <7b8>   DW_AT_byte_size   : 160
    <7b9>   DW_AT_decl_file   : 9
    <7ba>   DW_AT_decl_line   : 1095
    <7bc>   DW_AT_decl_column : 16
    <7bd>   DW_AT_sibling     : <0x84e>
 <2><7c1>: Abbrev Number: 1 (DW_TAG_member)
    <7c2>   DW_AT_name        : (indirect string, offset: 0x457): pxDummy1
    <7c6>   DW_AT_decl_file   : 9
    <7c7>   DW_AT_decl_line   : 1097
    <7c9>   DW_AT_decl_column : 11
    <7ca>   DW_AT_type        : <0xbb>
    <7ce>   DW_AT_data_member_location: 0
 <2><7cf>: Abbrev Number: 1 (DW_TAG_member)
    <7d0>   DW_AT_name        : (indirect string, offset: 0x24f): xDummy3
    <7d4>   DW_AT_decl_file   : 9
    <7d5>   DW_AT_decl_line   : 1101
    <7d7>   DW_AT_decl_column : 19
    <7d8>   DW_AT_type        : <0x84e>
    <7dc>   DW_AT_data_member_location: 4
 <2><7dd>: Abbrev Number: 1 (DW_TAG_member)
    <7de>   DW_AT_name        : (indirect string, offset: 0x16d): uxDummy5
    <7e2>   DW_AT_decl_file   : 9
    <7e3>   DW_AT_decl_line   : 1102
    <7e5>   DW_AT_decl_column : 16
    <7e6>   DW_AT_type        : <0xc9>
    <7ea>   DW_AT_data_member_location: 44
 <2><7eb>: Abbrev Number: 1 (DW_TAG_member)
    <7ec>   DW_AT_name        : (indirect string, offset: 0x467): pxDummy6
    <7f0>   DW_AT_decl_file   : 9
    <7f1>   DW_AT_decl_line   : 1103
    <7f3>   DW_AT_decl_column : 11
    <7f4>   DW_AT_type        : <0xbb>
    <7f8>   DW_AT_data_member_location: 48
 <2><7f9>: Abbrev Number: 1 (DW_TAG_member)
    <7fa>   DW_AT_name        : (indirect string, offset: 0x100): ucDummy7
    <7fe>   DW_AT_decl_file   : 9
    <7ff>   DW_AT_decl_line   : 1104
    <801>   DW_AT_decl_column : 13
    <802>   DW_AT_type        : <0x85e>
    <806>   DW_AT_data_member_location: 52
 <2><807>: Abbrev Number: 1 (DW_TAG_member)
    <808>   DW_AT_name        : (indirect string, offset: 0x222): uxDummy12
    <80c>   DW_AT_decl_file   : 9
    <80d>   DW_AT_decl_line   : 1115
    <80f>   DW_AT_decl_column : 16
    <810>   DW_AT_type        : <0x86e>
    <814>   DW_AT_data_member_location: 68
 <2><815>: Abbrev Number: 1 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x499): xDummy17
    <81a>   DW_AT_decl_file   : 9
    <81b>   DW_AT_decl_line   : 1127
    <81d>   DW_AT_decl_column : 17
    <81e>   DW_AT_type        : <0x3e4>
    <822>   DW_AT_data_member_location: 76
 <2><823>: Abbrev Number: 1 (DW_TAG_member)
    <824>   DW_AT_name        : (indirect string, offset: 0x23b): ulDummy18
    <828>   DW_AT_decl_file   : 9
    <829>   DW_AT_decl_line   : 1130
    <82b>   DW_AT_decl_column : 14
    <82c>   DW_AT_type        : <0xaf>
    <830>   DW_AT_data_member_location: 152
 <2><831>: Abbrev Number: 1 (DW_TAG_member)
    <832>   DW_AT_name        : (indirect string, offset: 0x4cb): ucDummy19
    <836>   DW_AT_decl_file   : 9
    <837>   DW_AT_decl_line   : 1131
    <839>   DW_AT_decl_column : 13
    <83a>   DW_AT_type        : <0x97>
    <83e>   DW_AT_data_member_location: 156
 <2><83f>: Abbrev Number: 1 (DW_TAG_member)
    <840>   DW_AT_name        : (indirect string, offset: 0x279): uxDummy20
    <844>   DW_AT_decl_file   : 9
    <845>   DW_AT_decl_line   : 1134
    <847>   DW_AT_decl_column : 13
    <848>   DW_AT_type        : <0x97>
    <84c>   DW_AT_data_member_location: 157
 <2><84d>: Abbrev Number: 0
 <1><84e>: Abbrev Number: 7 (DW_TAG_array_type)
    <84f>   DW_AT_type        : <0x7a6>
    <853>   DW_AT_sibling     : <0x85e>
 <2><857>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <858>   DW_AT_type        : <0x2d>
    <85c>   DW_AT_upper_bound : 1
 <2><85d>: Abbrev Number: 0
 <1><85e>: Abbrev Number: 7 (DW_TAG_array_type)
    <85f>   DW_AT_type        : <0x97>
    <863>   DW_AT_sibling     : <0x86e>
 <2><867>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <868>   DW_AT_type        : <0x2d>
    <86c>   DW_AT_upper_bound : 15
 <2><86d>: Abbrev Number: 0
 <1><86e>: Abbrev Number: 7 (DW_TAG_array_type)
    <86f>   DW_AT_type        : <0xc9>
    <873>   DW_AT_sibling     : <0x87e>
 <2><877>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <878>   DW_AT_type        : <0x2d>
    <87c>   DW_AT_upper_bound : 1
 <2><87d>: Abbrev Number: 0
 <1><87e>: Abbrev Number: 11 (DW_TAG_typedef)
    <87f>   DW_AT_name        : (indirect string, offset: 0x53d): StaticTask_t
    <883>   DW_AT_decl_file   : 9
    <884>   DW_AT_decl_line   : 1143
    <886>   DW_AT_decl_column : 3
    <887>   DW_AT_type        : <0x7b3>
 <1><88b>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <88c>   DW_AT_byte_size   : 4
    <88c>   DW_AT_type        : <0xbd>
 <1><890>: Abbrev Number: 18 (DW_TAG_variable)
    <891>   DW_AT_name        : (indirect string, offset: 0x35b): xIdleTaskTCBBuffer
    <895>   DW_AT_decl_file   : 1
    <895>   DW_AT_decl_line   : 59
    <896>   DW_AT_decl_column : 21
    <897>   DW_AT_type        : <0x87e>
    <89b>   DW_AT_location    : 5 byte block: 3 88 0 0 20 	(DW_OP_addr: 20000088)
 <1><8a1>: Abbrev Number: 7 (DW_TAG_array_type)
    <8a2>   DW_AT_type        : <0xbd>
    <8a6>   DW_AT_sibling     : <0x8b1>
 <2><8aa>: Abbrev Number: 8 (DW_TAG_subrange_type)
    <8ab>   DW_AT_type        : <0x2d>
    <8af>   DW_AT_upper_bound : 255
 <2><8b0>: Abbrev Number: 0
 <1><8b1>: Abbrev Number: 18 (DW_TAG_variable)
    <8b2>   DW_AT_name        : (indirect string, offset: 0x2ee): xIdleStack
    <8b6>   DW_AT_decl_file   : 1
    <8b6>   DW_AT_decl_line   : 60
    <8b7>   DW_AT_decl_column : 20
    <8b8>   DW_AT_type        : <0x8a1>
    <8bc>   DW_AT_location    : 5 byte block: 3 28 1 0 20 	(DW_OP_addr: 20000128)
 <1><8c2>: Abbrev Number: 26 (DW_TAG_subprogram)
    <8c3>   DW_AT_external    : 1
    <8c3>   DW_AT_name        : (indirect string, offset: 0xc7): vApplicationGetIdleTaskMemory
    <8c7>   DW_AT_decl_file   : 1
    <8c8>   DW_AT_decl_line   : 62
    <8c9>   DW_AT_decl_column : 6
    <8ca>   DW_AT_prototyped  : 1
    <8ca>   DW_AT_low_pc      : 0x80005dc
    <8ce>   DW_AT_high_pc     : 0x34
    <8d2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8d4>   DW_AT_call_all_calls: 1
    <8d4>   DW_AT_sibling     : <0x900>
 <2><8d8>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8d9>   DW_AT_name        : (indirect string, offset: 0x359): ppxIdleTaskTCBBuffer
    <8dd>   DW_AT_decl_file   : 1
    <8dd>   DW_AT_decl_line   : 62
    <8dd>   DW_AT_decl_column : 52
    <8de>   DW_AT_type        : <0x900>
    <8e2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8e5>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8e6>   DW_AT_name        : (indirect string, offset: 0x7d): ppxIdleTaskStackBuffer
    <8ea>   DW_AT_decl_file   : 1
    <8ea>   DW_AT_decl_line   : 62
    <8ea>   DW_AT_decl_column : 88
    <8eb>   DW_AT_type        : <0x90a>
    <8ef>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><8f2>: Abbrev Number: 14 (DW_TAG_formal_parameter)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x1fe): pulIdleTaskStackSize
    <8f7>   DW_AT_decl_file   : 1
    <8f7>   DW_AT_decl_line   : 62
    <8f7>   DW_AT_decl_column : 122
    <8f8>   DW_AT_type        : <0x90f>
    <8fc>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8ff>: Abbrev Number: 0
 <1><900>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <901>   DW_AT_byte_size   : 4
    <901>   DW_AT_type        : <0x905>
 <1><905>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <906>   DW_AT_byte_size   : 4
    <906>   DW_AT_type        : <0x87e>
 <1><90a>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <90b>   DW_AT_byte_size   : 4
    <90b>   DW_AT_type        : <0x88b>
 <1><90f>: Abbrev Number: 3 (DW_TAG_pointer_type)
    <910>   DW_AT_byte_size   : 4
    <910>   DW_AT_type        : <0xaf>
 <1><914>: Abbrev Number: 0
  Compilation Unit @ offset 0x915:
   Length:        0x2d9b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x16d
   Pointer Size:  4
 <0><921>: Abbrev Number: 46 (DW_TAG_compile_unit)
    <922>   DW_AT_producer    : (indirect string, offset: 0x382): GNU C11 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <926>   DW_AT_language    : 29	(C11)
    <927>   DW_AT_name        : (indirect string, offset: 0x1f6a): ../Core/Src/main.c
    <92b>   DW_AT_comp_dir    : (indirect string, offset: 0x554): C:/Users/Bazar/Desktop/New folder/STM32F746Discovery_LTDC_ESP32-CAM_CaptureImage_FreeRTOS/STM32_Side/LTDC_CaptureImage_FreeRTOS/Debug
    <92f>   DW_AT_ranges      : 0x1f
    <933>   DW_AT_low_pc      : 0
    <937>   DW_AT_stmt_list   : 0x3b4
 <1><93b>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <93c>   DW_AT_encoding    : 5	(signed)
    <93d>   DW_AT_byte_size   : 1
    <93e>   DW_AT_type        : <0xbc0>
    <942>   DW_AT_decl_file   : 4
    <943>   DW_AT_decl_line   : 49
    <944>   DW_AT_decl_column : 1
    <945>   DW_AT_sibling     : <0xbc0>
 <2><949>: Abbrev Number: 17 (DW_TAG_enumerator)
    <94a>   DW_AT_name        : (indirect string, offset: 0x1d0f): NonMaskableInt_IRQn
    <94e>   DW_AT_const_value : -14
 <2><94f>: Abbrev Number: 17 (DW_TAG_enumerator)
    <950>   DW_AT_name        : (indirect string, offset: 0x14f9): MemoryManagement_IRQn
    <954>   DW_AT_const_value : -12
 <2><955>: Abbrev Number: 17 (DW_TAG_enumerator)
    <956>   DW_AT_name        : (indirect string, offset: 0x218e): BusFault_IRQn
    <95a>   DW_AT_const_value : -11
 <2><95b>: Abbrev Number: 17 (DW_TAG_enumerator)
    <95c>   DW_AT_name        : (indirect string, offset: 0x1b07): UsageFault_IRQn
    <960>   DW_AT_const_value : -10
 <2><961>: Abbrev Number: 17 (DW_TAG_enumerator)
    <962>   DW_AT_name        : (indirect string, offset: 0xad5): SVCall_IRQn
    <966>   DW_AT_const_value : -5
 <2><967>: Abbrev Number: 17 (DW_TAG_enumerator)
    <968>   DW_AT_name        : (indirect string, offset: 0x6b8): DebugMonitor_IRQn
    <96c>   DW_AT_const_value : -4
 <2><96d>: Abbrev Number: 17 (DW_TAG_enumerator)
    <96e>   DW_AT_name        : (indirect string, offset: 0x1ef6): PendSV_IRQn
    <972>   DW_AT_const_value : -2
 <2><973>: Abbrev Number: 17 (DW_TAG_enumerator)
    <974>   DW_AT_name        : (indirect string, offset: 0x1cd2): SysTick_IRQn
    <978>   DW_AT_const_value : -1
 <2><979>: Abbrev Number: 3 (DW_TAG_enumerator)
    <97a>   DW_AT_name        : (indirect string, offset: 0xb92): WWDG_IRQn
    <97e>   DW_AT_const_value : 0
 <2><97f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <980>   DW_AT_name        : (indirect string, offset: 0x2052): PVD_IRQn
    <984>   DW_AT_const_value : 1
 <2><985>: Abbrev Number: 3 (DW_TAG_enumerator)
    <986>   DW_AT_name        : (indirect string, offset: 0xe94): TAMP_STAMP_IRQn
    <98a>   DW_AT_const_value : 2
 <2><98b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <98c>   DW_AT_name        : (indirect string, offset: 0x111c): RTC_WKUP_IRQn
    <990>   DW_AT_const_value : 3
 <2><991>: Abbrev Number: 3 (DW_TAG_enumerator)
    <992>   DW_AT_name        : (indirect string, offset: 0x11b1): FLASH_IRQn
    <996>   DW_AT_const_value : 4
 <2><997>: Abbrev Number: 3 (DW_TAG_enumerator)
    <998>   DW_AT_name        : (indirect string, offset: 0x8cd): RCC_IRQn
    <99c>   DW_AT_const_value : 5
 <2><99d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <99e>   DW_AT_name        : (indirect string, offset: 0xe77): EXTI0_IRQn
    <9a2>   DW_AT_const_value : 6
 <2><9a3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9a4>   DW_AT_name        : (indirect string, offset: 0xdf8): EXTI1_IRQn
    <9a8>   DW_AT_const_value : 7
 <2><9a9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9aa>   DW_AT_name        : (indirect string, offset: 0xd83): EXTI2_IRQn
    <9ae>   DW_AT_const_value : 8
 <2><9af>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9b0>   DW_AT_name        : (indirect string, offset: 0x18b0): EXTI3_IRQn
    <9b4>   DW_AT_const_value : 9
 <2><9b5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9b6>   DW_AT_name        : (indirect string, offset: 0x1864): EXTI4_IRQn
    <9ba>   DW_AT_const_value : 10
 <2><9bb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9bc>   DW_AT_name        : (indirect string, offset: 0x109c): DMA1_Stream0_IRQn
    <9c0>   DW_AT_const_value : 11
 <2><9c1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9c2>   DW_AT_name        : (indirect string, offset: 0x1c4e): DMA1_Stream1_IRQn
    <9c6>   DW_AT_const_value : 12
 <2><9c7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9c8>   DW_AT_name        : (indirect string, offset: 0x1bf7): DMA1_Stream2_IRQn
    <9cc>   DW_AT_const_value : 13
 <2><9cd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9ce>   DW_AT_name        : (indirect string, offset: 0x1b9f): DMA1_Stream3_IRQn
    <9d2>   DW_AT_const_value : 14
 <2><9d3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xbe7): DMA1_Stream4_IRQn
    <9d8>   DW_AT_const_value : 15
 <2><9d9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9da>   DW_AT_name        : (indirect string, offset: 0xb3f): DMA1_Stream5_IRQn
    <9de>   DW_AT_const_value : 16
 <2><9df>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9e0>   DW_AT_name        : (indirect string, offset: 0xaa7): DMA1_Stream6_IRQn
    <9e4>   DW_AT_const_value : 17
 <2><9e5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9e6>   DW_AT_name        : (indirect string, offset: 0x774): ADC_IRQn
    <9ea>   DW_AT_const_value : 18
 <2><9eb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9ec>   DW_AT_name        : (indirect string, offset: 0x1323): CAN1_TX_IRQn
    <9f0>   DW_AT_const_value : 19
 <2><9f1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9f2>   DW_AT_name        : (indirect string, offset: 0x113b): CAN1_RX0_IRQn
    <9f6>   DW_AT_const_value : 20
 <2><9f7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9f8>   DW_AT_name        : (indirect string, offset: 0x10b6): CAN1_RX1_IRQn
    <9fc>   DW_AT_const_value : 21
 <2><9fd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <9fe>   DW_AT_name        : (indirect string, offset: 0x1cfb): CAN1_SCE_IRQn
    <a02>   DW_AT_const_value : 22
 <2><a03>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a04>   DW_AT_name        : (indirect string, offset: 0x10f4): EXTI9_5_IRQn
    <a08>   DW_AT_const_value : 23
 <2><a09>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x14ab): TIM1_BRK_TIM9_IRQn
    <a0e>   DW_AT_const_value : 24
 <2><a0f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a10>   DW_AT_name        : (indirect string, offset: 0x1db5): TIM1_UP_TIM10_IRQn
    <a14>   DW_AT_const_value : 25
 <2><a15>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a16>   DW_AT_name        : (indirect string, offset: 0x1ede): TIM1_TRG_COM_TIM11_IRQn
    <a1a>   DW_AT_const_value : 26
 <2><a1b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a1c>   DW_AT_name        : (indirect string, offset: 0xb51): TIM1_CC_IRQn
    <a20>   DW_AT_const_value : 27
 <2><a21>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a22>   DW_AT_name        : (indirect string, offset: 0x5da): TIM2_IRQn
    <a26>   DW_AT_const_value : 28
 <2><a27>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a28>   DW_AT_name        : (indirect string, offset: 0x2172): TIM3_IRQn
    <a2c>   DW_AT_const_value : 29
 <2><a2d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a2e>   DW_AT_name        : (indirect string, offset: 0x20e3): TIM4_IRQn
    <a32>   DW_AT_const_value : 30
 <2><a33>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a34>   DW_AT_name        : (indirect string, offset: 0x19e2): I2C1_EV_IRQn
    <a38>   DW_AT_const_value : 31
 <2><a39>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a3a>   DW_AT_name        : (indirect string, offset: 0x1ed1): I2C1_ER_IRQn
    <a3e>   DW_AT_const_value : 32
 <2><a3f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a40>   DW_AT_name        : (indirect string, offset: 0x19fa): I2C2_EV_IRQn
    <a44>   DW_AT_const_value : 33
 <2><a45>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a46>   DW_AT_name        : (indirect string, offset: 0x1f02): I2C2_ER_IRQn
    <a4a>   DW_AT_const_value : 34
 <2><a4b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a4c>   DW_AT_name        : (indirect string, offset: 0xfb8): SPI1_IRQn
    <a50>   DW_AT_const_value : 35
 <2><a51>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a52>   DW_AT_name        : (indirect string, offset: 0xf6f): SPI2_IRQn
    <a56>   DW_AT_const_value : 36
 <2><a57>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a58>   DW_AT_name        : (indirect string, offset: 0x1a07): USART1_IRQn
    <a5c>   DW_AT_const_value : 37
 <2><a5d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a5e>   DW_AT_name        : (indirect string, offset: 0x19b0): USART2_IRQn
    <a62>   DW_AT_const_value : 38
 <2><a63>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a64>   DW_AT_name        : (indirect string, offset: 0x192a): USART3_IRQn
    <a68>   DW_AT_const_value : 39
 <2><a69>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a6a>   DW_AT_name        : (indirect string, offset: 0x1640): EXTI15_10_IRQn
    <a6e>   DW_AT_const_value : 40
 <2><a6f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a70>   DW_AT_name        : (indirect string, offset: 0x982): RTC_Alarm_IRQn
    <a74>   DW_AT_const_value : 41
 <2><a75>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a76>   DW_AT_name        : (indirect string, offset: 0x13e7): OTG_FS_WKUP_IRQn
    <a7a>   DW_AT_const_value : 42
 <2><a7b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a7c>   DW_AT_name        : (indirect string, offset: 0x69a): TIM8_BRK_TIM12_IRQn
    <a80>   DW_AT_const_value : 43
 <2><a81>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a82>   DW_AT_name        : (indirect string, offset: 0x1fb9): TIM8_UP_TIM13_IRQn
    <a86>   DW_AT_const_value : 44
 <2><a87>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a88>   DW_AT_name        : (indirect string, offset: 0x1720): TIM8_TRG_COM_TIM14_IRQn
    <a8c>   DW_AT_const_value : 45
 <2><a8d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a8e>   DW_AT_name        : (indirect string, offset: 0xc08): TIM8_CC_IRQn
    <a92>   DW_AT_const_value : 46
 <2><a93>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a94>   DW_AT_name        : (indirect string, offset: 0x160a): DMA1_Stream7_IRQn
    <a98>   DW_AT_const_value : 47
 <2><a99>: Abbrev Number: 3 (DW_TAG_enumerator)
    <a9a>   DW_AT_name        : (indirect string, offset: 0x2049): FMC_IRQn
    <a9e>   DW_AT_const_value : 48
 <2><a9f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x210e): SDMMC1_IRQn
    <aa4>   DW_AT_const_value : 49
 <2><aa5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aa6>   DW_AT_name        : (indirect string, offset: 0x11e9): TIM5_IRQn
    <aaa>   DW_AT_const_value : 50
 <2><aab>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aac>   DW_AT_name        : (indirect string, offset: 0x1ad8): SPI3_IRQn
    <ab0>   DW_AT_const_value : 51
 <2><ab1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ab2>   DW_AT_name        : (indirect string, offset: 0xfc2): UART4_IRQn
    <ab6>   DW_AT_const_value : 52
 <2><ab7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ab8>   DW_AT_name        : (indirect string, offset: 0x1b6d): UART5_IRQn
    <abc>   DW_AT_const_value : 53
 <2><abd>: Abbrev Number: 3 (DW_TAG_enumerator)
    <abe>   DW_AT_name        : (indirect string, offset: 0x15ef): TIM6_DAC_IRQn
    <ac2>   DW_AT_const_value : 54
 <2><ac3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ac4>   DW_AT_name        : (indirect string, offset: 0x1112): TIM7_IRQn
    <ac8>   DW_AT_const_value : 55
 <2><ac9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aca>   DW_AT_name        : (indirect string, offset: 0x1882): DMA2_Stream0_IRQn
    <ace>   DW_AT_const_value : 56
 <2><acf>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ad0>   DW_AT_name        : (indirect string, offset: 0x1816): DMA2_Stream1_IRQn
    <ad4>   DW_AT_const_value : 57
 <2><ad5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ad6>   DW_AT_name        : (indirect string, offset: 0x804): DMA2_Stream2_IRQn
    <ada>   DW_AT_const_value : 58
 <2><adb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <adc>   DW_AT_name        : (indirect string, offset: 0x735): DMA2_Stream3_IRQn
    <ae0>   DW_AT_const_value : 59
 <2><ae1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x6ca): DMA2_Stream4_IRQn
    <ae6>   DW_AT_const_value : 60
 <2><ae7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ae8>   DW_AT_name        : (indirect string, offset: 0x1cc9): ETH_IRQn
    <aec>   DW_AT_const_value : 61
 <2><aed>: Abbrev Number: 3 (DW_TAG_enumerator)
    <aee>   DW_AT_name        : (indirect string, offset: 0x66e): ETH_WKUP_IRQn
    <af2>   DW_AT_const_value : 62
 <2><af3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <af4>   DW_AT_name        : (indirect string, offset: 0x1344): CAN2_TX_IRQn
    <af8>   DW_AT_const_value : 63
 <2><af9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <afa>   DW_AT_name        : (indirect string, offset: 0x15ac): CAN2_RX0_IRQn
    <afe>   DW_AT_const_value : 64
 <2><aff>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b00>   DW_AT_name        : (indirect string, offset: 0x1555): CAN2_RX1_IRQn
    <b04>   DW_AT_const_value : 65
 <2><b05>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b06>   DW_AT_name        : (indirect string, offset: 0x211a): CAN2_SCE_IRQn
    <b0a>   DW_AT_const_value : 66
 <2><b0b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x5e4): OTG_FS_IRQn
    <b10>   DW_AT_const_value : 67
 <2><b11>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b12>   DW_AT_name        : (indirect string, offset: 0x1351): DMA2_Stream5_IRQn
    <b16>   DW_AT_const_value : 68
 <2><b17>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b18>   DW_AT_name        : (indirect string, offset: 0x12e6): DMA2_Stream6_IRQn
    <b1c>   DW_AT_const_value : 69
 <2><b1d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b1e>   DW_AT_name        : (indirect string, offset: 0x127f): DMA2_Stream7_IRQn
    <b22>   DW_AT_const_value : 70
 <2><b23>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b24>   DW_AT_name        : (indirect string, offset: 0x852): USART6_IRQn
    <b28>   DW_AT_const_value : 71
 <2><b29>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b2a>   DW_AT_name        : (indirect string, offset: 0x1a39): I2C3_EV_IRQn
    <b2e>   DW_AT_const_value : 72
 <2><b2f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b30>   DW_AT_name        : (indirect string, offset: 0x1f0f): I2C3_ER_IRQn
    <b34>   DW_AT_const_value : 73
 <2><b35>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b36>   DW_AT_name        : (indirect string, offset: 0x1abe): OTG_HS_EP1_OUT_IRQn
    <b3a>   DW_AT_const_value : 74
 <2><b3b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b3c>   DW_AT_name        : (indirect string, offset: 0xdcc): OTG_HS_EP1_IN_IRQn
    <b40>   DW_AT_const_value : 75
 <2><b41>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b42>   DW_AT_name        : (indirect string, offset: 0x6dc): OTG_HS_WKUP_IRQn
    <b46>   DW_AT_const_value : 76
 <2><b47>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b48>   DW_AT_name        : (indirect string, offset: 0x1296): OTG_HS_IRQn
    <b4c>   DW_AT_const_value : 77
 <2><b4d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b4e>   DW_AT_name        : (indirect string, offset: 0x978): DCMI_IRQn
    <b52>   DW_AT_const_value : 78
 <2><b53>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b54>   DW_AT_name        : (indirect string, offset: 0xe0c): RNG_IRQn
    <b58>   DW_AT_const_value : 80
 <2><b59>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b5a>   DW_AT_name        : (indirect string, offset: 0x14ca): FPU_IRQn
    <b5e>   DW_AT_const_value : 81
 <2><b5f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b60>   DW_AT_name        : (indirect string, offset: 0x1a9e): UART7_IRQn
    <b64>   DW_AT_const_value : 82
 <2><b65>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b66>   DW_AT_name        : (indirect string, offset: 0x19ef): UART8_IRQn
    <b6a>   DW_AT_const_value : 83
 <2><b6b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b6c>   DW_AT_name        : (indirect string, offset: 0x1a69): SPI4_IRQn
    <b70>   DW_AT_const_value : 84
 <2><b71>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b72>   DW_AT_name        : (indirect string, offset: 0x19c6): SPI5_IRQn
    <b76>   DW_AT_const_value : 85
 <2><b77>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b78>   DW_AT_name        : (indirect string, offset: 0x9ad): SPI6_IRQn
    <b7c>   DW_AT_const_value : 86
 <2><b7d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b7e>   DW_AT_name        : (indirect string, offset: 0x930): SAI1_IRQn
    <b82>   DW_AT_const_value : 87
 <2><b83>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b84>   DW_AT_name        : (indirect string, offset: 0x19a6): LTDC_IRQn
    <b88>   DW_AT_const_value : 88
 <2><b89>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x1de8): LTDC_ER_IRQn
    <b8e>   DW_AT_const_value : 89
 <2><b8f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b90>   DW_AT_name        : (indirect string, offset: 0x1bb1): DMA2D_IRQn
    <b94>   DW_AT_const_value : 90
 <2><b95>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b96>   DW_AT_name        : (indirect string, offset: 0x8d6): SAI2_IRQn
    <b9a>   DW_AT_const_value : 91
 <2><b9b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x7f7): QUADSPI_IRQn
    <ba0>   DW_AT_const_value : 92
 <2><ba1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x1cef): LPTIM1_IRQn
    <ba6>   DW_AT_const_value : 93
 <2><ba7>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x1b38): CEC_IRQn
    <bac>   DW_AT_const_value : 94
 <2><bad>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bae>   DW_AT_name        : (indirect string, offset: 0x1a5c): I2C4_EV_IRQn
    <bb2>   DW_AT_const_value : 95
 <2><bb3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bb4>   DW_AT_name        : (indirect string, offset: 0x1f21): I2C4_ER_IRQn
    <bb8>   DW_AT_const_value : 96
 <2><bb9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bba>   DW_AT_name        : (indirect string, offset: 0x198f): SPDIF_RX_IRQn
    <bbe>   DW_AT_const_value : 97
 <2><bbf>: Abbrev Number: 0
 <1><bc0>: Abbrev Number: 18 (DW_TAG_base_type)
    <bc1>   DW_AT_byte_size   : 1
    <bc2>   DW_AT_encoding    : 6	(signed char)
    <bc3>   DW_AT_name        : (indirect string, offset: 0x2b9): signed char
 <1><bc7>: Abbrev Number: 4 (DW_TAG_typedef)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x1412): IRQn_Type
    <bcc>   DW_AT_decl_file   : 4
    <bcd>   DW_AT_decl_line   : 157
    <bce>   DW_AT_decl_column : 3
    <bcf>   DW_AT_type        : <0x93b>
 <1><bd3>: Abbrev Number: 4 (DW_TAG_typedef)
    <bd4>   DW_AT_name        : (indirect string, offset: 0x1d): __uint8_t
    <bd8>   DW_AT_decl_file   : 5
    <bd9>   DW_AT_decl_line   : 43
    <bda>   DW_AT_decl_column : 24
    <bdb>   DW_AT_type        : <0xbdf>
 <1><bdf>: Abbrev Number: 18 (DW_TAG_base_type)
    <be0>   DW_AT_byte_size   : 1
    <be1>   DW_AT_encoding    : 8	(unsigned char)
    <be2>   DW_AT_name        : (indirect string, offset: 0x2b7): unsigned char
 <1><be6>: Abbrev Number: 18 (DW_TAG_base_type)
    <be7>   DW_AT_byte_size   : 2
    <be8>   DW_AT_encoding    : 5	(signed)
    <be9>   DW_AT_name        : (indirect string, offset: 0): short int
 <1><bed>: Abbrev Number: 4 (DW_TAG_typedef)
    <bee>   DW_AT_name        : (indirect string, offset: 0x446): __uint16_t
    <bf2>   DW_AT_decl_file   : 5
    <bf3>   DW_AT_decl_line   : 57
    <bf4>   DW_AT_decl_column : 25
    <bf5>   DW_AT_type        : <0xbf9>
 <1><bf9>: Abbrev Number: 18 (DW_TAG_base_type)
    <bfa>   DW_AT_byte_size   : 2
    <bfb>   DW_AT_encoding    : 7	(unsigned)
    <bfc>   DW_AT_name        : (indirect string, offset: 0x1b8): short unsigned int
 <1><c00>: Abbrev Number: 4 (DW_TAG_typedef)
    <c01>   DW_AT_name        : (indirect string, offset: 0x1ca8): __int32_t
    <c05>   DW_AT_decl_file   : 5
    <c06>   DW_AT_decl_line   : 77
    <c07>   DW_AT_decl_column : 24
    <c08>   DW_AT_type        : <0xc0c>
 <1><c0c>: Abbrev Number: 18 (DW_TAG_base_type)
    <c0d>   DW_AT_byte_size   : 4
    <c0e>   DW_AT_encoding    : 5	(signed)
    <c0f>   DW_AT_name        : (indirect string, offset: 0x12c): long int
 <1><c13>: Abbrev Number: 4 (DW_TAG_typedef)
    <c14>   DW_AT_name        : (indirect string, offset: 0x15c): __uint32_t
    <c18>   DW_AT_decl_file   : 5
    <c19>   DW_AT_decl_line   : 79
    <c1a>   DW_AT_decl_column : 25
    <c1b>   DW_AT_type        : <0xc1f>
 <1><c1f>: Abbrev Number: 18 (DW_TAG_base_type)
    <c20>   DW_AT_byte_size   : 4
    <c21>   DW_AT_encoding    : 7	(unsigned)
    <c22>   DW_AT_name        : (indirect string, offset: 0x6b): long unsigned int
 <1><c26>: Abbrev Number: 18 (DW_TAG_base_type)
    <c27>   DW_AT_byte_size   : 8
    <c28>   DW_AT_encoding    : 5	(signed)
    <c29>   DW_AT_name        : (indirect string, offset: 0x127): long long int
 <1><c2d>: Abbrev Number: 18 (DW_TAG_base_type)
    <c2e>   DW_AT_byte_size   : 8
    <c2f>   DW_AT_encoding    : 7	(unsigned)
    <c30>   DW_AT_name        : (indirect string, offset: 0x66): long long unsigned int
 <1><c34>: Abbrev Number: 47 (DW_TAG_base_type)
    <c35>   DW_AT_byte_size   : 4
    <c36>   DW_AT_encoding    : 5	(signed)
    <c37>   DW_AT_name        : int
 <1><c3b>: Abbrev Number: 18 (DW_TAG_base_type)
    <c3c>   DW_AT_byte_size   : 4
    <c3d>   DW_AT_encoding    : 7	(unsigned)
    <c3e>   DW_AT_name        : (indirect string, offset: 0x70): unsigned int
 <1><c42>: Abbrev Number: 4 (DW_TAG_typedef)
    <c43>   DW_AT_name        : (indirect string, offset: 0x1f): uint8_t
    <c47>   DW_AT_decl_file   : 6
    <c48>   DW_AT_decl_line   : 24
    <c49>   DW_AT_decl_column : 19
    <c4a>   DW_AT_type        : <0xbd3>
 <1><c4e>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c4f>   DW_AT_type        : <0xc42>
 <1><c53>: Abbrev Number: 25 (DW_TAG_const_type)
    <c54>   DW_AT_type        : <0xc42>
 <1><c58>: Abbrev Number: 4 (DW_TAG_typedef)
    <c59>   DW_AT_name        : (indirect string, offset: 0x448): uint16_t
    <c5d>   DW_AT_decl_file   : 6
    <c5e>   DW_AT_decl_line   : 36
    <c5f>   DW_AT_decl_column : 20
    <c60>   DW_AT_type        : <0xbed>
 <1><c64>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c65>   DW_AT_type        : <0xc58>
 <1><c69>: Abbrev Number: 4 (DW_TAG_typedef)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x1caa): int32_t
    <c6e>   DW_AT_decl_file   : 6
    <c6f>   DW_AT_decl_line   : 44
    <c70>   DW_AT_decl_column : 19
    <c71>   DW_AT_type        : <0xc00>
 <1><c75>: Abbrev Number: 4 (DW_TAG_typedef)
    <c76>   DW_AT_name        : (indirect string, offset: 0x15e): uint32_t
    <c7a>   DW_AT_decl_file   : 6
    <c7b>   DW_AT_decl_line   : 48
    <c7c>   DW_AT_decl_column : 20
    <c7d>   DW_AT_type        : <0xc13>
 <1><c81>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <c82>   DW_AT_type        : <0xc75>
 <1><c86>: Abbrev Number: 25 (DW_TAG_const_type)
    <c87>   DW_AT_type        : <0xc81>
 <1><c8b>: Abbrev Number: 8 (DW_TAG_array_type)
    <c8c>   DW_AT_type        : <0xc75>
    <c90>   DW_AT_sibling     : <0xc9b>
 <2><c94>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <c95>   DW_AT_type        : <0xc3b>
    <c99>   DW_AT_upper_bound : 0
 <2><c9a>: Abbrev Number: 0
 <1><c9b>: Abbrev Number: 8 (DW_TAG_array_type)
    <c9c>   DW_AT_type        : <0xc75>
    <ca0>   DW_AT_sibling     : <0xcab>
 <2><ca4>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <ca5>   DW_AT_type        : <0xc3b>
    <ca9>   DW_AT_upper_bound : 14
 <2><caa>: Abbrev Number: 0
 <1><cab>: Abbrev Number: 8 (DW_TAG_array_type)
    <cac>   DW_AT_type        : <0xc75>
    <cb0>   DW_AT_sibling     : <0xcbb>
 <2><cb4>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <cb5>   DW_AT_type        : <0xc3b>
    <cb9>   DW_AT_upper_bound : 5
 <2><cba>: Abbrev Number: 0
 <1><cbb>: Abbrev Number: 39 (DW_TAG_union_type)
    <cbc>   DW_AT_byte_size   : 4
    <cbc>   DW_AT_decl_file   : 2
    <cbd>   DW_AT_decl_line   : 1015
    <cbf>   DW_AT_decl_column : 9
    <cc0>   DW_AT_sibling     : <0xce5>
 <2><cc4>: Abbrev Number: 36 (DW_TAG_member)
    <cc5>   DW_AT_name        : u8
    <cc8>   DW_AT_decl_file   : 2
    <cc8>   DW_AT_decl_line   : 1017
    <cca>   DW_AT_decl_column : 22
    <cca>   DW_AT_type        : <0xc4e>
 <2><cce>: Abbrev Number: 36 (DW_TAG_member)
    <ccf>   DW_AT_name        : u16
    <cd3>   DW_AT_decl_file   : 2
    <cd3>   DW_AT_decl_line   : 1018
    <cd5>   DW_AT_decl_column : 22
    <cd5>   DW_AT_type        : <0xc64>
 <2><cd9>: Abbrev Number: 36 (DW_TAG_member)
    <cda>   DW_AT_name        : u32
    <cde>   DW_AT_decl_file   : 2
    <cde>   DW_AT_decl_line   : 1019
    <ce0>   DW_AT_decl_column : 22
    <ce0>   DW_AT_type        : <0xc81>
 <2><ce4>: Abbrev Number: 0
 <1><ce5>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <ce6>   DW_AT_type        : <0xcbb>
 <1><cea>: Abbrev Number: 48 (DW_TAG_structure_type)
    <ceb>   DW_AT_byte_size   : 4096
    <ced>   DW_AT_decl_file   : 2
    <cee>   DW_AT_decl_line   : 1013
    <cf0>   DW_AT_decl_column : 9
    <cf1>   DW_AT_sibling     : <0xe57>
 <2><cf5>: Abbrev Number: 2 (DW_TAG_member)
    <cf6>   DW_AT_name        : (indirect string, offset: 0x1e44): PORT
    <cfa>   DW_AT_decl_file   : 2
    <cfb>   DW_AT_decl_line   : 1020
    <cfd>   DW_AT_decl_column : 6
    <cfe>   DW_AT_type        : <0xe67>
    <d02>   DW_AT_data_member_location: 0
 <2><d03>: Abbrev Number: 2 (DW_TAG_member)
    <d04>   DW_AT_name        : (indirect string, offset: 0x1d33): RESERVED0
    <d08>   DW_AT_decl_file   : 2
    <d09>   DW_AT_decl_line   : 1021
    <d0b>   DW_AT_decl_column : 18
    <d0c>   DW_AT_type        : <0xe6c>
    <d10>   DW_AT_data_member_location: 128
 <2><d11>: Abbrev Number: 26 (DW_TAG_member)
    <d12>   DW_AT_name        : TER
    <d16>   DW_AT_decl_file   : 2
    <d16>   DW_AT_decl_line   : 1022
    <d18>   DW_AT_decl_column : 18
    <d18>   DW_AT_type        : <0xc81>
    <d1c>   DW_AT_data_member_location: 3584
 <2><d1e>: Abbrev Number: 12 (DW_TAG_member)
    <d1f>   DW_AT_name        : (indirect string, offset: 0x1d3d): RESERVED1
    <d23>   DW_AT_decl_file   : 2
    <d23>   DW_AT_decl_line   : 1023
    <d25>   DW_AT_decl_column : 18
    <d25>   DW_AT_type        : <0xc9b>
    <d29>   DW_AT_data_member_location: 3588
 <2><d2b>: Abbrev Number: 26 (DW_TAG_member)
    <d2c>   DW_AT_name        : TPR
    <d30>   DW_AT_decl_file   : 2
    <d30>   DW_AT_decl_line   : 1024
    <d32>   DW_AT_decl_column : 18
    <d32>   DW_AT_type        : <0xc81>
    <d36>   DW_AT_data_member_location: 3648
 <2><d38>: Abbrev Number: 12 (DW_TAG_member)
    <d39>   DW_AT_name        : (indirect string, offset: 0x1d47): RESERVED2
    <d3d>   DW_AT_decl_file   : 2
    <d3d>   DW_AT_decl_line   : 1025
    <d3f>   DW_AT_decl_column : 18
    <d3f>   DW_AT_type        : <0xc9b>
    <d43>   DW_AT_data_member_location: 3652
 <2><d45>: Abbrev Number: 26 (DW_TAG_member)
    <d46>   DW_AT_name        : TCR
    <d4a>   DW_AT_decl_file   : 2
    <d4a>   DW_AT_decl_line   : 1026
    <d4c>   DW_AT_decl_column : 18
    <d4c>   DW_AT_type        : <0xc81>
    <d50>   DW_AT_data_member_location: 3712
 <2><d52>: Abbrev Number: 12 (DW_TAG_member)
    <d53>   DW_AT_name        : (indirect string, offset: 0x1d51): RESERVED3
    <d57>   DW_AT_decl_file   : 2
    <d57>   DW_AT_decl_line   : 1027
    <d59>   DW_AT_decl_column : 18
    <d59>   DW_AT_type        : <0xe7d>
    <d5d>   DW_AT_data_member_location: 3716
 <2><d5f>: Abbrev Number: 26 (DW_TAG_member)
    <d60>   DW_AT_name        : IWR
    <d64>   DW_AT_decl_file   : 2
    <d64>   DW_AT_decl_line   : 1028
    <d66>   DW_AT_decl_column : 18
    <d66>   DW_AT_type        : <0xc81>
    <d6a>   DW_AT_data_member_location: 3832
 <2><d6c>: Abbrev Number: 26 (DW_TAG_member)
    <d6d>   DW_AT_name        : IRR
    <d71>   DW_AT_decl_file   : 2
    <d71>   DW_AT_decl_line   : 1029
    <d73>   DW_AT_decl_column : 18
    <d73>   DW_AT_type        : <0xc86>
    <d77>   DW_AT_data_member_location: 3836
 <2><d79>: Abbrev Number: 12 (DW_TAG_member)
    <d7a>   DW_AT_name        : (indirect string, offset: 0x6b3): IMCR
    <d7e>   DW_AT_decl_file   : 2
    <d7e>   DW_AT_decl_line   : 1030
    <d80>   DW_AT_decl_column : 18
    <d80>   DW_AT_type        : <0xc81>
    <d84>   DW_AT_data_member_location: 3840
 <2><d86>: Abbrev Number: 12 (DW_TAG_member)
    <d87>   DW_AT_name        : (indirect string, offset: 0x1d5b): RESERVED4
    <d8b>   DW_AT_decl_file   : 2
    <d8b>   DW_AT_decl_line   : 1031
    <d8d>   DW_AT_decl_column : 18
    <d8d>   DW_AT_type        : <0xe8d>
    <d91>   DW_AT_data_member_location: 3844
 <2><d93>: Abbrev Number: 26 (DW_TAG_member)
    <d94>   DW_AT_name        : LAR
    <d98>   DW_AT_decl_file   : 2
    <d98>   DW_AT_decl_line   : 1032
    <d9a>   DW_AT_decl_column : 18
    <d9a>   DW_AT_type        : <0xc81>
    <d9e>   DW_AT_data_member_location: 4016
 <2><da0>: Abbrev Number: 26 (DW_TAG_member)
    <da1>   DW_AT_name        : LSR
    <da5>   DW_AT_decl_file   : 2
    <da5>   DW_AT_decl_line   : 1033
    <da7>   DW_AT_decl_column : 18
    <da7>   DW_AT_type        : <0xc86>
    <dab>   DW_AT_data_member_location: 4020
 <2><dad>: Abbrev Number: 12 (DW_TAG_member)
    <dae>   DW_AT_name        : (indirect string, offset: 0x1d65): RESERVED5
    <db2>   DW_AT_decl_file   : 2
    <db2>   DW_AT_decl_line   : 1034
    <db4>   DW_AT_decl_column : 18
    <db4>   DW_AT_type        : <0xcab>
    <db8>   DW_AT_data_member_location: 4024
 <2><dba>: Abbrev Number: 12 (DW_TAG_member)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x690): PID4
    <dbf>   DW_AT_decl_file   : 2
    <dbf>   DW_AT_decl_line   : 1035
    <dc1>   DW_AT_decl_column : 18
    <dc1>   DW_AT_type        : <0xc86>
    <dc5>   DW_AT_data_member_location: 4048
 <2><dc7>: Abbrev Number: 12 (DW_TAG_member)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x695): PID5
    <dcc>   DW_AT_decl_file   : 2
    <dcc>   DW_AT_decl_line   : 1036
    <dce>   DW_AT_decl_column : 18
    <dce>   DW_AT_type        : <0xc86>
    <dd2>   DW_AT_data_member_location: 4052
 <2><dd4>: Abbrev Number: 12 (DW_TAG_member)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x1e55): PID6
    <dd9>   DW_AT_decl_file   : 2
    <dd9>   DW_AT_decl_line   : 1037
    <ddb>   DW_AT_decl_column : 18
    <ddb>   DW_AT_type        : <0xc86>
    <ddf>   DW_AT_data_member_location: 4056
 <2><de1>: Abbrev Number: 12 (DW_TAG_member)
    <de2>   DW_AT_name        : (indirect string, offset: 0x6ae): PID7
    <de6>   DW_AT_decl_file   : 2
    <de6>   DW_AT_decl_line   : 1038
    <de8>   DW_AT_decl_column : 18
    <de8>   DW_AT_type        : <0xc86>
    <dec>   DW_AT_data_member_location: 4060
 <2><dee>: Abbrev Number: 12 (DW_TAG_member)
    <def>   DW_AT_name        : (indirect string, offset: 0x67c): PID0
    <df3>   DW_AT_decl_file   : 2
    <df3>   DW_AT_decl_line   : 1039
    <df5>   DW_AT_decl_column : 18
    <df5>   DW_AT_type        : <0xc86>
    <df9>   DW_AT_data_member_location: 4064
 <2><dfb>: Abbrev Number: 12 (DW_TAG_member)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x681): PID1
    <e00>   DW_AT_decl_file   : 2
    <e00>   DW_AT_decl_line   : 1040
    <e02>   DW_AT_decl_column : 18
    <e02>   DW_AT_type        : <0xc86>
    <e06>   DW_AT_data_member_location: 4068
 <2><e08>: Abbrev Number: 12 (DW_TAG_member)
    <e09>   DW_AT_name        : (indirect string, offset: 0x686): PID2
    <e0d>   DW_AT_decl_file   : 2
    <e0d>   DW_AT_decl_line   : 1041
    <e0f>   DW_AT_decl_column : 18
    <e0f>   DW_AT_type        : <0xc86>
    <e13>   DW_AT_data_member_location: 4072
 <2><e15>: Abbrev Number: 12 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x68b): PID3
    <e1a>   DW_AT_decl_file   : 2
    <e1a>   DW_AT_decl_line   : 1042
    <e1c>   DW_AT_decl_column : 18
    <e1c>   DW_AT_type        : <0xc86>
    <e20>   DW_AT_data_member_location: 4076
 <2><e22>: Abbrev Number: 12 (DW_TAG_member)
    <e23>   DW_AT_name        : (indirect string, offset: 0x1bd0): CID0
    <e27>   DW_AT_decl_file   : 2
    <e27>   DW_AT_decl_line   : 1043
    <e29>   DW_AT_decl_column : 18
    <e29>   DW_AT_type        : <0xc86>
    <e2d>   DW_AT_data_member_location: 4080
 <2><e2f>: Abbrev Number: 12 (DW_TAG_member)
    <e30>   DW_AT_name        : (indirect string, offset: 0x1bd5): CID1
    <e34>   DW_AT_decl_file   : 2
    <e34>   DW_AT_decl_line   : 1044
    <e36>   DW_AT_decl_column : 18
    <e36>   DW_AT_type        : <0xc86>
    <e3a>   DW_AT_data_member_location: 4084
 <2><e3c>: Abbrev Number: 12 (DW_TAG_member)
    <e3d>   DW_AT_name        : (indirect string, offset: 0x1bda): CID2
    <e41>   DW_AT_decl_file   : 2
    <e41>   DW_AT_decl_line   : 1045
    <e43>   DW_AT_decl_column : 18
    <e43>   DW_AT_type        : <0xc86>
    <e47>   DW_AT_data_member_location: 4088
 <2><e49>: Abbrev Number: 12 (DW_TAG_member)
    <e4a>   DW_AT_name        : (indirect string, offset: 0x1bdf): CID3
    <e4e>   DW_AT_decl_file   : 2
    <e4e>   DW_AT_decl_line   : 1046
    <e50>   DW_AT_decl_column : 18
    <e50>   DW_AT_type        : <0xc86>
    <e54>   DW_AT_data_member_location: 4092
 <2><e56>: Abbrev Number: 0
 <1><e57>: Abbrev Number: 8 (DW_TAG_array_type)
    <e58>   DW_AT_type        : <0xce5>
    <e5c>   DW_AT_sibling     : <0xe67>
 <2><e60>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <e61>   DW_AT_type        : <0xc3b>
    <e65>   DW_AT_upper_bound : 31
 <2><e66>: Abbrev Number: 0
 <1><e67>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <e68>   DW_AT_type        : <0xe57>
 <1><e6c>: Abbrev Number: 8 (DW_TAG_array_type)
    <e6d>   DW_AT_type        : <0xc75>
    <e71>   DW_AT_sibling     : <0xe7d>
 <2><e75>: Abbrev Number: 31 (DW_TAG_subrange_type)
    <e76>   DW_AT_type        : <0xc3b>
    <e7a>   DW_AT_upper_bound : 863
 <2><e7c>: Abbrev Number: 0
 <1><e7d>: Abbrev Number: 8 (DW_TAG_array_type)
    <e7e>   DW_AT_type        : <0xc75>
    <e82>   DW_AT_sibling     : <0xe8d>
 <2><e86>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <e87>   DW_AT_type        : <0xc3b>
    <e8b>   DW_AT_upper_bound : 28
 <2><e8c>: Abbrev Number: 0
 <1><e8d>: Abbrev Number: 8 (DW_TAG_array_type)
    <e8e>   DW_AT_type        : <0xc75>
    <e92>   DW_AT_sibling     : <0xe9d>
 <2><e96>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <e97>   DW_AT_type        : <0xc3b>
    <e9b>   DW_AT_upper_bound : 42
 <2><e9c>: Abbrev Number: 0
 <1><e9d>: Abbrev Number: 10 (DW_TAG_typedef)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x19d0): ITM_Type
    <ea2>   DW_AT_decl_file   : 2
    <ea3>   DW_AT_decl_line   : 1047
    <ea5>   DW_AT_decl_column : 3
    <ea6>   DW_AT_type        : <0xcea>
 <1><eaa>: Abbrev Number: 8 (DW_TAG_array_type)
    <eab>   DW_AT_type        : <0xc75>
    <eaf>   DW_AT_sibling     : <0xeba>
 <2><eb3>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <eb4>   DW_AT_type        : <0xc3b>
    <eb8>   DW_AT_upper_bound : 1
 <2><eb9>: Abbrev Number: 0
 <1><eba>: Abbrev Number: 22 (DW_TAG_structure_type)
    <ebb>   DW_AT_byte_size   : 24
    <ebc>   DW_AT_decl_file   : 4
    <ebd>   DW_AT_decl_line   : 372
    <ebf>   DW_AT_decl_column : 9
    <ebf>   DW_AT_sibling     : <0xf17>
 <2><ec3>: Abbrev Number: 7 (DW_TAG_member)
    <ec4>   DW_AT_name        : CR
    <ec7>   DW_AT_decl_file   : 4
    <ec8>   DW_AT_decl_line   : 374
    <eca>   DW_AT_decl_column : 17
    <ecb>   DW_AT_type        : <0xc81>
    <ecf>   DW_AT_data_member_location: 0
 <2><ed0>: Abbrev Number: 2 (DW_TAG_member)
    <ed1>   DW_AT_name        : (indirect string, offset: 0x123c): NDTR
    <ed5>   DW_AT_decl_file   : 4
    <ed6>   DW_AT_decl_line   : 375
    <ed8>   DW_AT_decl_column : 17
    <ed9>   DW_AT_type        : <0xc81>
    <edd>   DW_AT_data_member_location: 4
 <2><ede>: Abbrev Number: 7 (DW_TAG_member)
    <edf>   DW_AT_name        : PAR
    <ee3>   DW_AT_decl_file   : 4
    <ee4>   DW_AT_decl_line   : 376
    <ee6>   DW_AT_decl_column : 17
    <ee7>   DW_AT_type        : <0xc81>
    <eeb>   DW_AT_data_member_location: 8
 <2><eec>: Abbrev Number: 2 (DW_TAG_member)
    <eed>   DW_AT_name        : (indirect string, offset: 0x96c): M0AR
    <ef1>   DW_AT_decl_file   : 4
    <ef2>   DW_AT_decl_line   : 377
    <ef4>   DW_AT_decl_column : 17
    <ef5>   DW_AT_type        : <0xc81>
    <ef9>   DW_AT_data_member_location: 12
 <2><efa>: Abbrev Number: 2 (DW_TAG_member)
    <efb>   DW_AT_name        : (indirect string, offset: 0xca9): M1AR
    <eff>   DW_AT_decl_file   : 4
    <f00>   DW_AT_decl_line   : 378
    <f02>   DW_AT_decl_column : 17
    <f03>   DW_AT_type        : <0xc81>
    <f07>   DW_AT_data_member_location: 16
 <2><f08>: Abbrev Number: 7 (DW_TAG_member)
    <f09>   DW_AT_name        : FCR
    <f0d>   DW_AT_decl_file   : 4
    <f0e>   DW_AT_decl_line   : 379
    <f10>   DW_AT_decl_column : 17
    <f11>   DW_AT_type        : <0xc81>
    <f15>   DW_AT_data_member_location: 20
 <2><f16>: Abbrev Number: 0
 <1><f17>: Abbrev Number: 10 (DW_TAG_typedef)
    <f18>   DW_AT_name        : (indirect string, offset: 0xcae): DMA_Stream_TypeDef
    <f1c>   DW_AT_decl_file   : 4
    <f1d>   DW_AT_decl_line   : 380
    <f1f>   DW_AT_decl_column : 3
    <f20>   DW_AT_type        : <0xeba>
 <1><f24>: Abbrev Number: 8 (DW_TAG_array_type)
    <f25>   DW_AT_type        : <0xc81>
    <f29>   DW_AT_sibling     : <0xf34>
 <2><f2d>: Abbrev Number: 9 (DW_TAG_subrange_type)
    <f2e>   DW_AT_type        : <0xc3b>
    <f32>   DW_AT_upper_bound : 1
 <2><f33>: Abbrev Number: 0
 <1><f34>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <f35>   DW_AT_type        : <0xf24>
 <1><f39>: Abbrev Number: 22 (DW_TAG_structure_type)
    <f3a>   DW_AT_byte_size   : 40
    <f3b>   DW_AT_decl_file   : 4
    <f3c>   DW_AT_decl_line   : 579
    <f3e>   DW_AT_decl_column : 9
    <f3e>   DW_AT_sibling     : <0xfc1>
 <2><f42>: Abbrev Number: 2 (DW_TAG_member)
    <f43>   DW_AT_name        : (indirect string, offset: 0x1d09): MODER
    <f47>   DW_AT_decl_file   : 4
    <f48>   DW_AT_decl_line   : 581
    <f4a>   DW_AT_decl_column : 17
    <f4b>   DW_AT_type        : <0xc81>
    <f4f>   DW_AT_data_member_location: 0
 <2><f50>: Abbrev Number: 2 (DW_TAG_member)
    <f51>   DW_AT_name        : (indirect string, offset: 0x908): OTYPER
    <f55>   DW_AT_decl_file   : 4
    <f56>   DW_AT_decl_line   : 582
    <f58>   DW_AT_decl_column : 17
    <f59>   DW_AT_type        : <0xc81>
    <f5d>   DW_AT_data_member_location: 4
 <2><f5e>: Abbrev Number: 2 (DW_TAG_member)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x119f): OSPEEDR
    <f63>   DW_AT_decl_file   : 4
    <f64>   DW_AT_decl_line   : 583
    <f66>   DW_AT_decl_column : 17
    <f67>   DW_AT_type        : <0xc81>
    <f6b>   DW_AT_data_member_location: 8
 <2><f6c>: Abbrev Number: 2 (DW_TAG_member)
    <f6d>   DW_AT_name        : (indirect string, offset: 0x1ca2): PUPDR
    <f71>   DW_AT_decl_file   : 4
    <f72>   DW_AT_decl_line   : 584
    <f74>   DW_AT_decl_column : 17
    <f75>   DW_AT_type        : <0xc81>
    <f79>   DW_AT_data_member_location: 12
 <2><f7a>: Abbrev Number: 7 (DW_TAG_member)
    <f7b>   DW_AT_name        : IDR
    <f7f>   DW_AT_decl_file   : 4
    <f80>   DW_AT_decl_line   : 585
    <f82>   DW_AT_decl_column : 17
    <f83>   DW_AT_type        : <0xc81>
    <f87>   DW_AT_data_member_location: 16
 <2><f88>: Abbrev Number: 7 (DW_TAG_member)
    <f89>   DW_AT_name        : ODR
    <f8d>   DW_AT_decl_file   : 4
    <f8e>   DW_AT_decl_line   : 586
    <f90>   DW_AT_decl_column : 17
    <f91>   DW_AT_type        : <0xc81>
    <f95>   DW_AT_data_member_location: 20
 <2><f96>: Abbrev Number: 2 (DW_TAG_member)
    <f97>   DW_AT_name        : (indirect string, offset: 0x13be): BSRR
    <f9b>   DW_AT_decl_file   : 4
    <f9c>   DW_AT_decl_line   : 587
    <f9e>   DW_AT_decl_column : 17
    <f9f>   DW_AT_type        : <0xc81>
    <fa3>   DW_AT_data_member_location: 24
 <2><fa4>: Abbrev Number: 2 (DW_TAG_member)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x1811): LCKR
    <fa9>   DW_AT_decl_file   : 4
    <faa>   DW_AT_decl_line   : 588
    <fac>   DW_AT_decl_column : 17
    <fad>   DW_AT_type        : <0xc81>
    <fb1>   DW_AT_data_member_location: 28
 <2><fb2>: Abbrev Number: 7 (DW_TAG_member)
    <fb3>   DW_AT_name        : AFR
    <fb7>   DW_AT_decl_file   : 4
    <fb8>   DW_AT_decl_line   : 589
    <fba>   DW_AT_decl_column : 17
    <fbb>   DW_AT_type        : <0xf34>
    <fbf>   DW_AT_data_member_location: 32
 <2><fc0>: Abbrev Number: 0
 <1><fc1>: Abbrev Number: 10 (DW_TAG_typedef)
    <fc2>   DW_AT_name        : (indirect string, offset: 0x15fd): GPIO_TypeDef
    <fc6>   DW_AT_decl_file   : 4
    <fc7>   DW_AT_decl_line   : 590
    <fc9>   DW_AT_decl_column : 3
    <fca>   DW_AT_type        : <0xf39>
 <1><fce>: Abbrev Number: 22 (DW_TAG_structure_type)
    <fcf>   DW_AT_byte_size   : 76
    <fd0>   DW_AT_decl_file   : 4
    <fd1>   DW_AT_decl_line   : 642
    <fd3>   DW_AT_decl_column : 9
    <fd3>   DW_AT_sibling     : <0x10c6>
 <2><fd7>: Abbrev Number: 2 (DW_TAG_member)
    <fd8>   DW_AT_name        : (indirect string, offset: 0x1d33): RESERVED0
    <fdc>   DW_AT_decl_file   : 4
    <fdd>   DW_AT_decl_line   : 644
    <fdf>   DW_AT_decl_column : 17
    <fe0>   DW_AT_type        : <0xeaa>
    <fe4>   DW_AT_data_member_location: 0
 <2><fe5>: Abbrev Number: 2 (DW_TAG_member)
    <fe6>   DW_AT_name        : (indirect string, offset: 0x1291): SSCR
    <fea>   DW_AT_decl_file   : 4
    <feb>   DW_AT_decl_line   : 645
    <fed>   DW_AT_decl_column : 17
    <fee>   DW_AT_type        : <0xc81>
    <ff2>   DW_AT_data_member_location: 8
 <2><ff3>: Abbrev Number: 2 (DW_TAG_member)
    <ff4>   DW_AT_name        : (indirect string, offset: 0x2a89): BPCR
    <ff8>   DW_AT_decl_file   : 4
    <ff9>   DW_AT_decl_line   : 646
    <ffb>   DW_AT_decl_column : 17
    <ffc>   DW_AT_type        : <0xc81>
    <1000>   DW_AT_data_member_location: 12
 <2><1001>: Abbrev Number: 2 (DW_TAG_member)
    <1002>   DW_AT_name        : (indirect string, offset: 0xa78): AWCR
    <1006>   DW_AT_decl_file   : 4
    <1007>   DW_AT_decl_line   : 647
    <1009>   DW_AT_decl_column : 17
    <100a>   DW_AT_type        : <0xc81>
    <100e>   DW_AT_data_member_location: 16
 <2><100f>: Abbrev Number: 2 (DW_TAG_member)
    <1010>   DW_AT_name        : (indirect string, offset: 0xf4a): TWCR
    <1014>   DW_AT_decl_file   : 4
    <1015>   DW_AT_decl_line   : 648
    <1017>   DW_AT_decl_column : 17
    <1018>   DW_AT_type        : <0xc81>
    <101c>   DW_AT_data_member_location: 20
 <2><101d>: Abbrev Number: 7 (DW_TAG_member)
    <101e>   DW_AT_name        : GCR
    <1022>   DW_AT_decl_file   : 4
    <1023>   DW_AT_decl_line   : 649
    <1025>   DW_AT_decl_column : 17
    <1026>   DW_AT_type        : <0xc81>
    <102a>   DW_AT_data_member_location: 24
 <2><102b>: Abbrev Number: 2 (DW_TAG_member)
    <102c>   DW_AT_name        : (indirect string, offset: 0x1d3d): RESERVED1
    <1030>   DW_AT_decl_file   : 4
    <1031>   DW_AT_decl_line   : 650
    <1033>   DW_AT_decl_column : 17
    <1034>   DW_AT_type        : <0xeaa>
    <1038>   DW_AT_data_member_location: 28
 <2><1039>: Abbrev Number: 2 (DW_TAG_member)
    <103a>   DW_AT_name        : (indirect string, offset: 0xff7): SRCR
    <103e>   DW_AT_decl_file   : 4
    <103f>   DW_AT_decl_line   : 651
    <1041>   DW_AT_decl_column : 17
    <1042>   DW_AT_type        : <0xc81>
    <1046>   DW_AT_data_member_location: 36
 <2><1047>: Abbrev Number: 2 (DW_TAG_member)
    <1048>   DW_AT_name        : (indirect string, offset: 0x1d47): RESERVED2
    <104c>   DW_AT_decl_file   : 4
    <104d>   DW_AT_decl_line   : 652
    <104f>   DW_AT_decl_column : 17
    <1050>   DW_AT_type        : <0xc8b>
    <1054>   DW_AT_data_member_location: 40
 <2><1055>: Abbrev Number: 2 (DW_TAG_member)
    <1056>   DW_AT_name        : (indirect string, offset: 0x1973): BCCR
    <105a>   DW_AT_decl_file   : 4
    <105b>   DW_AT_decl_line   : 653
    <105d>   DW_AT_decl_column : 17
    <105e>   DW_AT_type        : <0xc81>
    <1062>   DW_AT_data_member_location: 44
 <2><1063>: Abbrev Number: 2 (DW_TAG_member)
    <1064>   DW_AT_name        : (indirect string, offset: 0x1d51): RESERVED3
    <1068>   DW_AT_decl_file   : 4
    <1069>   DW_AT_decl_line   : 654
    <106b>   DW_AT_decl_column : 17
    <106c>   DW_AT_type        : <0xc8b>
    <1070>   DW_AT_data_member_location: 48
 <2><1071>: Abbrev Number: 7 (DW_TAG_member)
    <1072>   DW_AT_name        : IER
    <1076>   DW_AT_decl_file   : 4
    <1077>   DW_AT_decl_line   : 655
    <1079>   DW_AT_decl_column : 17
    <107a>   DW_AT_type        : <0xc81>
    <107e>   DW_AT_data_member_location: 52
 <2><107f>: Abbrev Number: 7 (DW_TAG_member)
    <1080>   DW_AT_name        : ISR
    <1084>   DW_AT_decl_file   : 4
    <1085>   DW_AT_decl_line   : 656
    <1087>   DW_AT_decl_column : 17
    <1088>   DW_AT_type        : <0xc81>
    <108c>   DW_AT_data_member_location: 56
 <2><108d>: Abbrev Number: 7 (DW_TAG_member)
    <108e>   DW_AT_name        : ICR
    <1092>   DW_AT_decl_file   : 4
    <1093>   DW_AT_decl_line   : 657
    <1095>   DW_AT_decl_column : 17
    <1096>   DW_AT_type        : <0xc81>
    <109a>   DW_AT_data_member_location: 60
 <2><109b>: Abbrev Number: 2 (DW_TAG_member)
    <109c>   DW_AT_name        : (indirect string, offset: 0x1ad2): LIPCR
    <10a0>   DW_AT_decl_file   : 4
    <10a1>   DW_AT_decl_line   : 658
    <10a3>   DW_AT_decl_column : 17
    <10a4>   DW_AT_type        : <0xc81>
    <10a8>   DW_AT_data_member_location: 64
 <2><10a9>: Abbrev Number: 2 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x1978): CPSR
    <10ae>   DW_AT_decl_file   : 4
    <10af>   DW_AT_decl_line   : 659
    <10b1>   DW_AT_decl_column : 17
    <10b2>   DW_AT_type        : <0xc81>
    <10b6>   DW_AT_data_member_location: 68
 <2><10b7>: Abbrev Number: 2 (DW_TAG_member)
    <10b8>   DW_AT_name        : (indirect string, offset: 0x14ec): CDSR
    <10bc>   DW_AT_decl_file   : 4
    <10bd>   DW_AT_decl_line   : 660
    <10bf>   DW_AT_decl_column : 17
    <10c0>   DW_AT_type        : <0xc81>
    <10c4>   DW_AT_data_member_location: 72
 <2><10c5>: Abbrev Number: 0
 <1><10c6>: Abbrev Number: 10 (DW_TAG_typedef)
    <10c7>   DW_AT_name        : (indirect string, offset: 0x1fe5): LTDC_TypeDef
    <10cb>   DW_AT_decl_file   : 4
    <10cc>   DW_AT_decl_line   : 661
    <10ce>   DW_AT_decl_column : 3
    <10cf>   DW_AT_type        : <0xfce>
 <1><10d3>: Abbrev Number: 22 (DW_TAG_structure_type)
    <10d4>   DW_AT_byte_size   : 16
    <10d5>   DW_AT_decl_file   : 4
    <10d6>   DW_AT_decl_line   : 690
    <10d8>   DW_AT_decl_column : 9
    <10d8>   DW_AT_sibling     : <0x1115>
 <2><10dc>: Abbrev Number: 7 (DW_TAG_member)
    <10dd>   DW_AT_name        : CR1
    <10e1>   DW_AT_decl_file   : 4
    <10e2>   DW_AT_decl_line   : 692
    <10e4>   DW_AT_decl_column : 17
    <10e5>   DW_AT_type        : <0xc81>
    <10e9>   DW_AT_data_member_location: 0
 <2><10ea>: Abbrev Number: 2 (DW_TAG_member)
    <10eb>   DW_AT_name        : (indirect string, offset: 0x2000): CSR1
    <10ef>   DW_AT_decl_file   : 4
    <10f0>   DW_AT_decl_line   : 693
    <10f2>   DW_AT_decl_column : 17
    <10f3>   DW_AT_type        : <0xc81>
    <10f7>   DW_AT_data_member_location: 4
 <2><10f8>: Abbrev Number: 7 (DW_TAG_member)
    <10f9>   DW_AT_name        : CR2
    <10fd>   DW_AT_decl_file   : 4
    <10fe>   DW_AT_decl_line   : 694
    <1100>   DW_AT_decl_column : 17
    <1101>   DW_AT_type        : <0xc81>
    <1105>   DW_AT_data_member_location: 8
 <2><1106>: Abbrev Number: 2 (DW_TAG_member)
    <1107>   DW_AT_name        : (indirect string, offset: 0x2005): CSR2
    <110b>   DW_AT_decl_file   : 4
